{"Xenophilius_Lovegood": {"name": "Xenophilius Lovegood", "series": "harry potter", "big_five": [0.23, 0.21, -0.77, 0.12, 0.22], "url": "https://harrypotter.fandom.com/wiki/Xenophilius_Lovegood", "description": "Xenophilius \"Xeno\" Lovegood was a British wizard who was the editor of The Quibbler magazine, the husband of Pandora, and the father of Luna Lovegood. His wife died when their only child was nine years old, and he raised his daughter by himself. He was likely the source of his daughter’s eccentric beliefs, although he was often correct in his assumptions. He believed in the existence of the Deathly Hallows and supported Harry in The Quibbler when few others would.", "quote": ["The most eccentric-looking wizard... Slightly cross-eyed, with shoulder-length white hair the texture of candyfloss, he wore a white cap whose tassel dangled in front of his nose and robes of an eye-watering shade of egg-yolk yellow. An odd symbol, rather like a triangular eye, glistened from a golden chain around his neck", "―Xenophilius Lovegood's bizarre appearance "], "movie": "Harry Potter and the Deathly Hallows"}, "Newt_Scamander": {"name": "Newt Scamander", "series": "harry potter", "big_five": [0.63, -0.64, 0.38, -0.24, 0.71], "url": "https://harrypotter.fandom.com/wiki/Newt_Scamander", "description": "Newton Artemis Fido \"Newt\" Scamander, O.M. (Second Class), (b. 24 February, 1897) was an English wizard, famed Magizoologist and the author of Fantastic Beasts and Where to Find Them. Early in life Scamander developed an interest in magical creatures, influenced by his mother's breeding of hippogriffs. He attended Hogwarts School of Witchcraft and Wizardry, where he was sorted into Hufflepuff House. While at Hogwarts he was sentenced to expulsion though Albus Dumbledore, who had been his Defence Against the Dark Arts instructor, recognised his innocence, and objected strongly.", "quote": ["I have visited lairs, burrows and nests across five continents, observed the curious habits of magical beasts in a hundred countries, witnessed their powers, gained their trust and, on occasion, beaten them off with my travelling kettle.", "―Newton Scamander"], "movie": "Fantastic Beasts and Where to Find Them "}, "Jacob_Kowalski": {"name": "Jacob Kowalski", "series": "harry potter", "big_five": [0.92, -0.44, -0.13, 0.09, -0.25], "url": "https://harrypotter.fandom.com/wiki/Jacob_Kowalski", "description": "Jacob Kowalski (born c. 1900) was a Polish-born American No-Maj, who lived at 435 Rivington Street New York during the 1920s. Jacob fought in the First World War. Returning home to the United States he found work in a cannery, but dreamt of becoming a baker. On 5 December 1926, he went to Steen National Bank to apply for a loan of $2300, but was turned down. ", "quote": ["Jacob Kowalski: \"Everyone knows Newt only kept me around 'cause... hey, Newt, why did you keep me around?\"\nNewt Scamander: \"Because... I like you. Because you're my friend. And I'll never forget how you helped me, Jacob.\"", "―Jacob and Newt Scamander, in 1926"], "movie": ""}, "Katie_Bell": {"name": "Katie Bell", "series": "harry potter", "big_five": [0.37, 0.47, 0.18, -0.32, 0.13], "url": "https://harrypotter.fandom.com/wiki/Katie_Bell", "description": "Katie Bell (b. 1978/1979) was a British witch and a Gryffindor student at Hogwarts School of Witchcraft and Wizardry from 1990 to 1997. She was a Chaser for the Gryffindor Quidditch team. During her Hogwarts years, she became incredibly close friends with Angelina Johnson and Alicia Spinnet, who were Gryffindors from the year above her. ", "quote": ["I know you're going to ask me Harry, but I don't know who cursed me. I've been trying to remember, honestly. But I just can't.", "―Katie Bell talking about the necklace incident"], "movie": "Harry Potter and the Half-Blood Prince "}, "Ginny_Weasley": {"name": "Ginny Weasley", "series": "harry potter", "big_five": [0.67, 0.86, 0.23, 0.28, 0.44], "url": "https://harrypotter.fandom.com/wiki/Ginny_Weasley", "description": "Ginevra Molly \"Ginny\" Potter (née Weasley) (b. 11 August, 1981), occasionally known as Gin, was an English pure-blood witch, the youngest of Arthur and Molly Weasley's (née Prewett) seven children, and the first female to be born into the Weasley line for several generations. She and her older brothers grew up in The Burrow on the outskirts of Ottery St Catchpole in Devon.", "quote": ["Yeah, size is no guarantee of power. Look at Ginny...", "―Ginny's impressive Bat-Bogey Hex"], "movie": "Harry Potter and the Order of the Phoenix"}, "Ignotus_Peverell": {"name": "Ignotus Peverell", "series": "harry potter", "big_five": [0.38, -0.48, 0.52, -0.57, 0.46], "url": "https://harrypotter.fandom.com/wiki/Ignotus_Peverell", "description": "Ignotus Peverell (12 July, 1214 – 19 May, 1292) was a pure-blood wizard, one of the three brothers mentioned in The Tale of the Three Brothers in The Tales of Beedle the Bard . The youngest of the three brothers, Ignotus was also described as the humblest and wisest of them, and had survived Death's cunning schemes due to these traits. He received the last of the Deathly Hallows, the Cloak of Invisibility, which was passed down through his family to the Potter family, and eventually to Harry Potter.", "quote": ["It was only when he had attained a great age that the youngest brother finally took off the Cloak of Invisibility and gave it to his son. And then he greeted Death as an old friend, and went with him gladly, and, equals, they departed this life.", "―The Tale of the Three Brothers"], "movie": "The Tales of Beedle the Bard "}, "Hermione_Granger": {"name": "Hermione Granger", "series": "harry potter", "big_five": [0.15, -0.14, 0.87, -0.24, 0.67], "url": "https://harrypotter.fandom.com/wiki/Hermione_Granger", "description": "Minister Hermione Jean Granger (b. 19 September, 1979) was an English Muggle-born witch born to Mr and Mrs Granger. At the age of eleven she learned that she was a witch, and had been accepted into Hogwarts School of Witchcraft and Wizardry. She began attending Hogwarts in 1991 and was Sorted into Gryffindor House. Hermione possessed a brilliant academic mind and proved to be a gifted student in almost every subject that she studied. ", "quote": ["Harry Potter: \"But why's she got to go to the library?\"\nRonald Weasley: \"Because that's what Hermione does. When in doubt, go to the library.\"", "―Hermione's book dependency"], "movie": ""}, "Dean_Thomas": {"name": "Dean Thomas", "series": "harry potter", "big_five": [0.29, 0.31, 0.26, -0.59, 0.42], "url": "https://harrypotter.fandom.com/wiki/Dean_Thomas", "description": "Dean Thomas (b. 1979/1980) was an English half-blood wizard, the son of a wizard and a Muggle mother. When Dean Thomas was very young, his father died and his mother married another man, giving Dean several half-siblings. Since Dean's father never told his mother that he was a wizard and was eventually murdered by Death Eaters when he refused to join them, Dean grew up thinking he was Muggle-born.", "quote": ["We're fighting, aren't we? The message said Harry was back, and we were going to fight! I'll have to get a wand, though....", "―Dean's determination to fight"], "movie": "Harry Potter and the Deathly Hallows"}, "Ernie_Macmillan": {"name": "Ernie Macmillan", "series": "harry potter", "big_five": [-0.53, 0.87, 0.67, 0.06, 0.41], "url": "https://harrypotter.fandom.com/wiki/Ernie_Macmillan", "description": "Ernest \"Ernie\" Macmillan (b. 1980) was a pure-blood wizard who attended Hogwarts School of Witchcraft and Wizardry from 1991-1998. He was in the same year as the famous Harry Potter and was sorted into Hufflepuff House. He was also born into the Macmillan family, one of the Sacred Twenty-Eight.", "quote": ["Personally I think this is really important, possibly more important than anything else we'll do this year, even with our O.W.L.s coming up. I, personally, am at a loss to see why the Ministry has foisted such a useless teacher on us at this critical period. Obviously, they are in denial about the return of You-Know-Who.", "―Ernie Macmillan's opinion of Dumbledore's Army"], "movie": "Harry Potter and the Order of the Phoenix"}, "Auntie_Muriel": {"name": "Auntie Muriel", "series": "harry potter", "big_five": [-0.87, 0.23, -0.63, 0.5, 0.61], "url": "https://harrypotter.fandom.com/wiki/Auntie_Muriel", "description": "Muriel (born c. 1890) was a pure or half-blood witch and the great-aunt of Molly Weasley (née Prewett). Thus, the abrasive, gossip-loving centenarian was a great-great aunt of the Weasley children, much to their dismay.", "quote": ["Nightmare, Muriel is.", "―Muriel' unpleasantness"], "movie": "Harry Potter and the Deathly Hallows"}, "Cuthbert_Binns": {"name": "Cuthbert Binns", "series": "harry potter", "big_five": [0.37, 0.17, 0.53, -0.68, 0.47], "url": "https://harrypotter.fandom.com/wiki/Cuthbert_Binns", "description": "Professor Cuthbert Binns was a wizard and History of Magic professor at Hogwarts School of Witchcraft and Wizardry. He owned an office in the main castle and Classroom 4F on the first floor to teach in. He taught until a very old age, when he fell asleep in the staff room and died in slumber. Now, he is a ghost who continued to teach, droning on about various Goblin Rebellions and Giant Wars to bored, sleeping students.", "quote": ["My subject is History of Magic. I deal with ", "―Professor Binns to his class"], "movie": "Harry Potter and the Chamber of Secrets"}, "Argus_Filch": {"name": "Argus Filch", "series": "harry potter", "big_five": [-0.85, 0.02, 0.27, 0.79, -0.63], "url": "https://harrypotter.fandom.com/wiki/Argus_Filch", "description": "Argus Filch was a Squib and the caretaker of Hogwarts School of Witchcraft and Wizardry since around 1968. Filch usually wandered around the school corridors with his cat Mrs Norris, trying to catch students breaking the school rules and complaining about Peeves the Poltergeist.", "quote": ["I bet you'll think twice about breaking a school rule again, won't you, eh? Oh, yes… hard work and pain are the best teachers, if you ask me… It's just a pity they let the old punishments die out… hang you by your wrists from the ceiling for a few days, I've got the chains still in my office, keep 'em well oiled in case they're ever needed… Right, off we go, and don't think of running off, now. It'll be worse for you if you do.", "―Filch's sadistic enjoyment when punishing students"], "movie": "Harry Potter and the Philosopher's Stone"}, "Amycus_Carrow": {"name": "Amycus Carrow", "series": "harry potter", "big_five": [-0.58, -0.18, 0.5, 0.35, 0.72], "url": "https://harrypotter.fandom.com/wiki/Amycus_Carrow", "description": "Professor Amycus Carrow was a Dark wizard, brother of Alecto Carrow and a Death Eater. Amycus fought in the First Wizarding War along with his sister. They did not search for Lord Voldemort after his first downfall but were forgiven after Voldemort's return in 1995 and joined the Death Eater ranks in the Second Wizarding War. ", "quote": ["We can push it off on the kids. Yeah, that's what we'll do. We'll say Alecto was ambushed by the kids, them kids up there, and we'll say they forced her to press her Mark, and that's why he got a false alarm... He can punish them. Couple of kids more or less, what's the difference?", "―Amycus' selfishness and cowardice"], "movie": "Harry Potter and the Deathly Hallows"}, "Bill_Weasley": {"name": "Bill Weasley", "series": "harry potter", "big_five": [0.15, -0.21, 0.55, -0.52, 0.51], "url": "https://harrypotter.fandom.com/wiki/Bill_Weasley", "description": "William Arthur \"Bill\" Weasley (b. 29 November, 1970) was the first child of Arthur and Molly Weasley (née Prewett) and the eldest brother of Charlie, Percy, Fred, George, Ron, and Ginny. He attended Hogwarts School of Witchcraft and Wizardry from 1982-1989 and was both a prefect and Head Boy. ", "quote": ["What do I care how 'e looks? I am good-looking enough for both of us, I theenk! All these scars show is that my husband is brave.", "―Fleur Delacour regarding Bill's bravery"], "movie": "Harry Potter and the Half-Blood Prince"}, "Luna_Lovegood": {"name": "Luna Lovegood", "series": "harry potter", "big_five": [0.78, 0.57, -0.21, -0.33, 0.88], "url": "https://harrypotter.fandom.com/wiki/Luna_Lovegood", "description": "Luna Lovegood (b. 13 February, 1981) was a British witch, the only child and daughter of Xenophilius and Pandora Lovegood. Her mother accidentally died while experimenting with spells when Luna was nine and Luna was raised by her father, editor of the magazine The Quibbler, in a rook-like house near the village of Ottery St Catchpole in Devon. ", "quote": ["The girl gave off an aura of distinct dottiness. Perhaps it was the fact that she had stuck her wand behind her left ear for safekeeping, or that she had chosen to wear a necklace of Butterbeer caps, or that she was reading a magazine upside down.", "―Luna's unusual disposition"], "movie": "Harry Potter and the Order of the Phoenix"}, "Barty_Crouch_Sr": {"name": "Barty Crouch Sr", "series": "harry potter", "big_five": [-0.73, -0.21, 0.18, -0.07, -0.19], "url": "https://harrypotter.fandom.com/wiki/Barty_Crouch_Sr", "description": "Bartemius \"Barty\" Crouch Senior (d. 27 May, 1995) was a pure-blood wizard and an influential Ministry of Magic official during the mid-to-late 20th century. He was the Head of the Department of Magical Law Enforcement during the First Wizarding War, but was demoted to the Head of the Department of International Magical Cooperation afterwards. He had a reputation for \"fighting fire with fire\", exhibiting the sort of ruthlessness and brutality against criminals that could be compared to some Death Eaters to their victims.", "quote": ["He was tipped as the next Minister for Magic. He's a great wizard, Barty Crouch, powerfully magical  — and power-hungry. Oh never a Voldemort supporter. No, Barty Crouch was always very outspoken against the Dark Side. But... I would say he became as ruthless and cruel as many on the Dark Side.", "―Crouch's ruthlessness and extreme methods"], "movie": "Harry Potter and the Goblet of Fire"}, "Vernon_Dursley": {"name": "Vernon Dursley", "series": "harry potter", "big_five": [-0.85, 0.03, 0.56, 0.62, -0.48], "url": "https://harrypotter.fandom.com/wiki/Vernon_Dursley", "description": "Vernon Dursley was a Muggle, husband of Petunia Evans, father of Dudley and uncle of Harry Potter by marriage. He used to live at 4 Privet Drive along with his wife and son for nearly twenty years until they were forced into hiding during the escalation of the Second Wizarding War. After Petunia's sister Lily and brother-in-law, James Potter, were killed by Voldemort in their own home, Petunia remained the sole surviving blood relative of Harry's. Both Wizard and Muggle law demanded that Petunia and Vernon be the new legal guardians of Harry Potter, which they accepted (albeit reluctantly). However, they disliked Harry and treated him badly, while spoiling and fattening Dudley.", "quote": ["There's no such thing as magic!", "―Vernon's strong dislike of magic"], "movie": "Harry Potter and the Philosopher's Stone "}, "Pansy_Parkinson": {"name": "Pansy Parkinson", "series": "harry potter", "big_five": [-0.67, -0.25, 0.04, 0.2, 0.27], "url": "https://harrypotter.fandom.com/wiki/Pansy_Parkinson", "description": "Pansy Parkinson (b. 1979/1980) was a witch in Harry Potter's year at Hogwarts School of Witchcraft and Wizardry. She was born into the Parkinson family, members of the Sacred Twenty-Eight. Pansy was sorted into Slytherin House and in her fifth year became a prefect. In the same year she became a member of the short-lived Inquisitorial Squad.", "quote": ["But, he's there! Potter's there! Someone grab him!", "―Pansy in favour of handing Harry over to Voldemort"], "movie": "Harry Potter and the Deathly Hallows"}, "Aurora_Sinistra": {"name": "Aurora Sinistra", "series": "harry potter", "big_five": [-0.32, 0.21, 0.52, 0.47, 0.18], "url": "https://harrypotter.fandom.com/wiki/Aurora_Sinistra", "description": "Professor Aurora Sinistra was a British witch who taught in the Astronomy department at Hogwarts School of Witchcraft and Wizardry. Professor Sinistra was teaching by September 1985. The subject included studying the night sky with telescopes.", "quote": ["Professor Grubbly-Plank was chatting to Professor Sinistra, the Astronomy teacher... ", "―Sinistra talking with her fellow staff members"], "movie": "Harry Potter and the Order of the Phoenix"}, "Barty_Crouch_Jr": {"name": "Barty Crouch Jr", "series": "harry potter", "big_five": [-0.34, 0.18, 0.24, -0.02, 0.49], "url": "https://harrypotter.fandom.com/wiki/Barty_Crouch_Jr", "description": "Bartemius \"Barty\" Crouch Junior (c. 1962 - 1995) was a pure-blood or half-blood wizard and the son of Bartemius Crouch Senior. He joined Lord Voldemort to become a Death Eater in his teens.  He was the first known escapee of Azkaban prison in its almost 300 year history.", "quote": ["If there's something I hate more than any other, it's a Death Eater who walked free. They turned their backs on my master when he needed them most. I expected him to punish them. I expected him to torture them. Tell me he hurt them, Harry.... Tell me he told them that I, I alone remained faithful... Prepared to risk everything to deliver to him the one thing he wanted above all... You.", "―Bartemius Crouch Jr's loyalty to Lord Voldemort"], "movie": "Harry Potter and the Goblet of Fire"}, "Scabbers": {"name": "Scabbers", "series": "harry potter", "big_five": [-0.54, -0.06, -0.31, 0.84, -0.51], "url": "https://harrypotter.fandom.com/wiki/Scabbers", "description": "Peter Pettigrew, O.M. (First Class), (c. 1960 – March, 1998), usually referred to as Wormtail or Scabbers was a wizard and the son of Mr and Mrs Pettigrew. He began attending Hogwarts School of Witchcraft and Wizardry in 1971 and was sorted into Gryffindor House after the Sorting Hat pondered over which house he belonged in for over five minutes, a true Hatstall. During his years at Hogwarts, he became one of the Marauders; he was best friends with Sirius Black, James Potter, and Remus Lupin, and together they created the Marauder's Map. ", "quote": ["And you understood Wormtail too... you knew there was a bit of regret there, somewhere...", "―Pettigrew later feels regret for the betrayal of his friends"], "movie": "Harry Potter and the Deathly Hallows Part 1"}, "Tom_Riddle": {"name": "Tom Riddle", "series": "harry potter", "big_five": [-0.6, -0.29, 0.07, 0.59, 0.04], "url": "https://harrypotter.fandom.com/wiki/Tom_Riddle", "description": "Tom Marvolo Riddle (31 December, 1926 – 2 May, 1998), later known as Lord Voldemort or alternatively as You-Know-Who, He-Who-Must-Not-Be-Named, or the Dark Lord, was an English half-blood wizard considered to have been the most powerful and dangerous Dark Wizard of all time. The only child and son of Tom and Merope Riddle (née Gaunt) via the coercive use of a love potion, Riddle was raised in the Muggle-run Wool's Orphanage after his father abandoned his new family on the streets of London when the potion's influence was lifted, and his mother died moments after giving birth to and naming him after his father and maternal grandfather, Marvolo Gaunt.  ", "quote": ["You think I was going to use my filthy Muggle father’s name forever? I, in whose veins runs the blood of Salazar Slytherin himself, through my mother’s side? I, keep the name of a foul, common Muggle, who abandoned me even before I was born, just because he found out his wife was a witch? No, Harry. I fashioned myself a new name, a name I knew wizards everywhere would one day fear to speak, when I had become the greatest sorcerer in the world!", "―Tom Riddle's transformation into Lord Voldemort"], "movie": "Harry Potter and the Chamber of Secrets"}, "Pius_Thicknesse": {"name": "Pius Thicknesse", "series": "harry potter", "big_five": [-0.32, -0.23, 0.41, 0.51, -0.29], "url": "https://harrypotter.fandom.com/wiki/Pius_Thicknesse", "description": "Minister Pius Thicknesse was a British wizard and a Ministry of Magic official in the mid to late 1990s. During the Second Wizarding War, he became Head of the Department of Magical Law Enforcement as well as, later in the War, Minister for Magic under Lord Voldemort's puppet regime while under the Imperius Curse and thus essentially Voldemort's puppet himself. He replaced Rufus Scrimgeour as Minister of Magic, who had been murdered by Voldemort. Thicknesse took part in the final conflict of the War where he fought alongside the Death Eaters, still under the curse.", "quote": ["As your new Minister for Magic, I promise to restore this temple of tolerance to its former glory. Therefore, beginning today, each employee will submit themselves... for evaluation. But know this: you have nothing to fear if you have nothing to hide.", "―Thicknesse regarding the Ministry's new regime"], "movie": "Harry Potter and the Deathly Hallows: Part 1"}, "George_Weasley": {"name": "George Weasley", "series": "harry potter", "big_five": [0.59, 0.91, -0.38, -0.37, 0.78], "url": "https://harrypotter.fandom.com/wiki/George_Weasley", "description": "George Weasley (b. 1 April, 1978) was an English pure-blood wizard, son of Arthur Weasley and Molly Weasley (née Prewett), brother of Bill, Charlie, Percy, Ron, and Ginny, and twin brother of the late Fred Weasley. George's first few years were marked by the height of the First Wizarding War and Lord Voldemort's first fall. He attended Hogwarts School of Witchcraft and Wizardry from 1989-1996 with Fred, and was Sorted into Gryffindor House. He and Fred were popular students, becoming Beaters for the Gryffindor Quidditch team in their second year, and members of Dumbledore's Army in their unfinished seventh year. A born prankster and inventor, George left Hogwarts prior to graduation to become a successful entrepreneur, alongside his twin brother, and opened the joke shop Weasleys' Wizard Wheezes at 93 Diagon Alley. He was a member of the Order of the Phoenix and fought in the Battle of the Seven Potters and the Battle of Hogwarts; in the latter, Fred died, leaving George devastated.", "quote": ["The thing about growing up with Fred and George, is that you sort of start thinking anything's possible if you've got enough nerve.", "―The twins' audacity and boldness"], "movie": "Harry Potter and the Order of the Phoenix"}, "Ollivander": {"name": "Ollivander", "series": "harry potter", "big_five": [0.18, 0.18, 0.44, -0.76, 0.36], "url": "https://harrypotter.fandom.com/wiki/Ollivander", "description": "Garrick Ollivander (b. 25 September, pre 1908) was a British half-blood wizard who was the proprietor of Ollivanders in Diagon Alley during most of the 20th century. Ollivander was widely considered the best wandmaker in the world, and many wizards and witches brought their wands from him.", "quote": ["An old man was standing before them, his wide, pale eyes shining like moons through the gloom of the shop.", "―Harry Potter meets Ollivander"], "movie": "Harry Potter and the Philosopher's Stone"}, "Wilhelmina_Grubbly-Plank": {"name": "Wilhelmina Grubbly-Plank", "series": "harry potter", "big_five": [0.78, 0.61, 0.87, -0.32, -0.22], "url": "https://harrypotter.fandom.com/wiki/Wilhelmina_Grubbly-Plank", "description": "Professor Wilhelmina Grubbly-Plank was a British witch who worked as a substitute Care of Magical Creatures teacher at Hogwarts School of Witchcraft and Wizardry.  She was first met by Harry Potter's batch in 1994, taking over lessons when Professor Rubeus Hagrid was unable to teach. She taught the class again in part of the next school year when Hagrid was away on a mission for Albus Dumbledore.", "quote": ["I hope she stays, that woman! That's more of what I thought Care of Magical Creatures would be like... proper creatures like unicorns, not monsters...", "―Grubbly-Plank's first lesson"], "movie": "Harry Potter and the Goblet of Fire"}, "Rita_Skeeter": {"name": "Rita Skeeter", "series": "harry potter", "big_five": [-0.88, 0.62, 0.34, 0.51, 0.08], "url": "https://harrypotter.fandom.com/wiki/Rita_Skeeter", "description": "Rita Skeeter (b. 1950/1951) was a British witch and journalist who specialised in writing poison-pen stories. These stories tended to be based on false information and misreported interviews while she worked for the Daily Prophet, as well authoring a few tell-all biographies. Albus Dumbledore described her writing as \"enchantingly nasty\" after she wrote an unfavourable article about him.", "quote": ["You horrible woman. You don't care, do you, anything for a story, and anyone will do, won't they?", "―Rita's horrid personality"], "movie": "Harry Potter and the Goblet of Fire"}, "Lily_Evans": {"name": "Lily Evans", "series": "harry potter", "big_five": [0.64, 0.32, 0.74, -0.46, 0.67], "url": "https://harrypotter.fandom.com/wiki/Lily_Evans", "description": "Lily J. Potter (née Evans) (30 January, 1960 – 31 October, 1981) was a Muggle-born witch, the younger daughter of Mr and Mrs Evans, and the younger sister of Petunia Evans. She learned that she was a witch as a child, after Severus Snape (a wizard boy who lived nearby) recognised her as such and told her of the existence of magic. Lily attended Hogwarts School of Witchcraft and Wizardry from 1971-1978. She was Sorted into Gryffindor House and was a member of the Slug Club. In her seventh year Lily was made Head Girl and began dating James Potter.", "quote": ["Your mother was there for me at a time when no one else was. Not only was she a singularly gifted witch, she was also an uncommonly kind woman. She had a way of seeing the beauty in others even, and perhaps most especially, when that person couldn't see it in themselves.", "―Description of Lily's nature"], "movie": "Harry Potter and the Prisoner of Azkaban "}, "Arabella_Figg": {"name": "Arabella Figg", "series": "harry potter", "big_five": [-0.06, 0.08, 0.17, -0.05, 0.49], "url": "https://harrypotter.fandom.com/wiki/Arabella_Figg", "description": "Mrs Arabella Doreen Figg was a Squib, a dealer of cross-bred cats and kneazles, and a member of the Order of the Phoenix. She lived on Wisteria Walk in Little Whinging, in a house that smelled strongly of cabbage; she also owned and extensively photographed at least four part-kneazle cats, named Mr Tibbles, Snowy, Mr Paws, and Tufty.", "quote": ["Harry Potter: \"Why didn't you tell me you're a Squib, Mrs Figg? All those times I came round your house — why didn't you say anything?\"\nMrs Figg: \"Dumbledore's orders. I was to keep an eye on you but not say anything, you were too young. I'm sorry I gave you such a miserable time, Harry, but the Dursleys would never have let you come if they'd thought you enjoyed it. It wasn't easy, you know...\"", "―Harry Potter and Arabella Figg in the summer of 1995"], "movie": ""}, "Lavender_Brown": {"name": "Lavender Brown", "series": "harry potter", "big_five": [0.22, -0.06, -0.59, 0.56, -0.79], "url": "https://harrypotter.fandom.com/wiki/Lavender_Brown", "description": "Lavender Brown (c. 1979/1980 – 2 May, 1998) was a pure-blood witch, the daughter of Mr and Mrs Brown and a Gryffindor. She started her education at Hogwarts School of Witchcraft and Wizardry in 1991, the same year as the famous Harry Potter.", "quote": ["At first, Lavender had been very annoyed that nobody had thought to tell her that Ron was in the hospital wing... but unfortunately she had now decided to forgive Harry this lapse of memory and was keen to have lots of in-depth chats with him about Ron's feelings, a most uncomfortable experience that Harry would have happily forgone.", "―Lavender's sensitive and sentimental nature"], "movie": "Harry Potter and the Half-Blood Prince"}, "Stan_Shunpike": {"name": "Stan Shunpike", "series": "harry potter", "big_five": [0.41, 0.75, -0.47, 0.12, -0.46], "url": "https://harrypotter.fandom.com/wiki/Stan_Shunpike", "description": "Stanley \"Stan\" Shunpike (born between 15 September 1974 and 13 September 1975) was a British wizard and was the conductor and helper of the Knight Bus. On 14 September 1996, he was arrested and sent to Azkaban for being a Death Eater when he was overheard claiming to have inside information about the organisation, although in all likelihood, he was only fooling around. In 1997, he broke free from prison and joined the Death Eaters under the Imperius Curse. His fate after the war is unknown; he most likely awoke from the Curse following Lord Voldemort's ultimate defeat, like all the other Imperiused victims, and returned to his job.", "quote": ["Isn't he the one who claimed he was going to be­come Minister for Magic when he was trying to chat up those veela?", "―Ron Weasley explains Stan Shunpike"], "movie": "Harry Potter and the Half-Blood Prince"}, "Aberforth_Dumbledore": {"name": "Aberforth Dumbledore", "series": "harry potter", "big_five": [-0.16, 0.1, 0.31, -0.64, 0.22], "url": "https://harrypotter.fandom.com/wiki/Aberforth_Dumbledore", "description": "Aberforth Dumbledore (b. 1883/1884) was a half-blood wizard, the second son of Percival and Kendra Dumbledore, younger brother of Albus, and older brother of Ariana. He attended Hogwarts School of Witchcraft and Wizardry between 1895 and 1902. His father ― who had been sentenced to prison for attacking three Muggles ― died in Azkaban when Aberforth was young, and his mother and sister were later accidentally killed. Aberforth blamed his brother Albus for the death of their sister, Ariana and thus their relationship was rather strained.", "quote": ["My own brother, Aberforth, was prosecuted for practising inappropriate charms on a goat. It was all over the papers, but did Aberforth hide? No, he did not! He held his head high and went about his business as usual! Of course, I'm not entirely sure he can read, so that may not have been bravery...", "―Aberforth's unconventional personality"], "movie": "Harry Potter and the Goblet of Fire"}, "Albus_Dumbledore": {"name": "Albus Dumbledore", "series": "harry potter", "big_five": [0.37, -0.18, 0.83, -0.43, 0.92], "url": "https://harrypotter.fandom.com/wiki/Albus_Dumbledore", "description": "Professor Albus Percival Wulfric Brian Dumbledore, O.M. (First Class), Grand Sorc., D. Wiz., X.J. (sorc.), S. of Mag.Q. (c. Summer 1881 – 30 June, 1997) was an English half-blood wizard, who was the Defence Against the Dark Arts Professor, later the Transfiguration Professor, and later Headmaster of Hogwarts School of Witchcraft and Wizardry. Professor Dumbledore also served as Supreme Mugwump of the International Confederation of Wizards (?–1995) and Chief Warlock of the Wizengamot (?–1995; 1996–1997). He was a half-blood, Muggle-supporting wizard considered to have been the greatest wizard of modern times, perhaps of all time. The son of Percival and Kendra Dumbledore, and the elder brother of Aberforth and Ariana. His father died in Azkaban when Dumbledore was young, while his mother and sister were later accidentally killed. His early losses greatly affected him early on, even at his death, but, in turn, made him a better person. ", "quote": ["Albus Dumbledore was never proud or vain; he could find something to value in anyone, however apparently insignificant or wretched, and I believe that his early losses endowed him with great humanity and sympathy. I shall miss his friendship more than I can say, but my loss is as nothing compared to the wizarding world's. That he was the most inspiring and the best loved of all Hogwarts headmasters cannot be in question.", "―Dumbledore's obituary"], "movie": "Harry Potter and the Deathly Hallows"}, "Nearly_Headless_Nick": {"name": "Nearly Headless Nick", "series": "harry potter", "big_five": [0.74, 0.69, -0.27, 0.82, -0.2], "url": "https://harrypotter.fandom.com/wiki/Nearly_Headless_Nick", "description": "Sir Nicholas de Mimsy-Porpington, known after his death as Nearly Headless Nick, (d. 31 October, 1492) was a wizard who attended Hogwarts School of Witchcraft and Wizardry and was Sorted into Gryffindor House. He was a wizard of the royal court as an adult. He was executed by an improper decapitation, after he had a magical mishap with Lady Grieve, in which he tried to straighten her teeth but it backfired and she grew tusks. Since then, he is the resident ghost of Gryffindor Tower at the Hogwarts Castle.", "quote": ["I haven't eaten for nearly five hundred years. I don't need to, of course, but one does miss it. I don't think I've introduced myself? Sir Nicholas de Mimsy-Porpington at your service. Resident ghost of Gryffindor Tower.", "―Sir Nicholas greets Gryffindor first years"], "movie": "Harry Potter and the Philosopher's Stone"}, "Quirinus_Quirrell": {"name": "Quirinus Quirrell", "series": "harry potter", "big_five": [0.35, -0.62, 0.01, 0.39, 0.01], "url": "https://harrypotter.fandom.com/wiki/Quirinus_Quirrell", "description": "Professor Quirinus Quirrell (26 September, 1970 or earlier – 4 June, 1992) was a half-blood wizard who attended Hogwarts School of Witchcraft and Wizardry and was Sorted into Ravenclaw House. He was the Muggle Studies professor at Hogwarts, though he later became the Defence Against the Dark Arts professor during the 1991–1992 school year.", "quote": ["I met him when I travelled around the world. A foolish young man I was then, full of ridiculous ideas about good and evil. My master showed me how wrong I was. There is no good and evil... there is only power, and those too weak to understand it... Since then, I serve him faithfully, although I have let him down many times.", "―Quirrell's faithful service to Lord Voldemort"], "movie": "Harry Potter and the Philosopher's Stone"}, "Thorfinn_Rowle": {"name": "Thorfinn Rowle", "series": "harry potter", "big_five": [-0.88, 0.35, -0.32, 0.53, 0.6], "url": "https://harrypotter.fandom.com/wiki/Thorfinn_Rowle", "description": "Thorfinn Rowle was a Dark wizard and a Death Eater who fought in the Second Wizarding War. He fought at the Battle of the Astronomy Tower, where he accidentally killed fellow Death Eater Gibbon, burned Rubeus Hagrid's cabin, and tortured Harry Potter. On 1 August, 1997, he tracked Harry Potter, Ron Weasley, and Hermione Granger to Tottenham Court Road along with Antonin Dolohov disguised as construction workers, but the two Death Eaters were defeated and their memories were modified by Hermione to cover their escape. After this failure, Rowle was punished severely by Lord Voldemort. He also fought at the Battle of Hogwarts on 2 May, 1998.", "quote": ["I think the big one's Thorfinn Rowle.", "―Ron Weasley in 1997, after unmasking the Death Eaters."], "movie": "Harry Potter and the Deathly Hallows"}, "Antonin_Dolohov": {"name": "Antonin Dolohov", "series": "harry potter", "big_five": [-0.33, 0.57, 0.31, 0.08, -0.04], "url": "https://harrypotter.fandom.com/wiki/Antonin_Dolohov", "description": "Antonin Dolohov was a Dark wizard and one of the original Death Eaters of Lord Voldemort. Dolohov was a powerful wizard, and among all the Death Eaters, only Bellatrix Lestrange and Severus Snape could equal him in magical ability. He fought in the First Wizarding War, during which he tortured many Muggles, and wizards and witches who were not supporters of the Dark Lord. Along with four other Death Eaters, he participated in the murders of Fabian and Gideon Prewett. Dolohov was caught, convicted of these crimes, and sentenced to life imprisonment in Azkaban.", "quote": ["There was Antonin Dolohov. I — I saw him torture countless Muggles and — and non-supporters of the Dark Lord.", "―Dolohov's sadistic nature"], "movie": "Harry Potter and the Goblet of Fire"}, "Sybill_Trelawney": {"name": "Sybill Trelawney", "series": "harry potter", "big_five": [-0.08, -0.13, -0.03, 0.76, 0.16], "url": "https://harrypotter.fandom.com/wiki/Sybill_Trelawney", "description": "Professor Sybill Patricia Trelawney (b. 9 March, pre 1962) was a half-blood witch and professor of Divination at Hogwarts School of Witchcraft and Wizardry. She is the great-great-granddaughter of the celebrated Cassandra Trelawney, who was also a Seer.", "quote": ["Trelawney: \"Certainly I knew, Minerva. But one does not parade the fact that one is All-Knowing. I frequently act as though I am not possessed of the Inner Eye, so as not to make others nervous.\"\nMinerva McGonagall: \"That explains a great deal.\"", "―Professor Trelawney's dubious gift"], "movie": ""}, "Albert_Runcorn": {"name": "Albert Runcorn", "series": "harry potter", "big_five": [-0.47, 0.37, -0.47, -0.29, -0.64], "url": "https://harrypotter.fandom.com/wiki/Albert_Runcorn", "description": "It is unknown where Runcorn was born, but it is expected that he joined the Ministry of Magic and eventually attained a position of power.", "quote": ["Apparently the man whom Harry was impersonating, Runcorn, was intimidating.  ", "―Runcorn's physical appearance"], "movie": "Harry Potter and the Deathly Hallows"}, "Severus_Snape": {"name": "Severus Snape", "series": "harry potter", "big_five": [-0.32, -0.64, 0.55, 0.29, 0.26], "url": "https://harrypotter.fandom.com/wiki/Severus_Snape", "description": "Professor Severus Snape (9 January, 1960 – 2 May, 1998) was a half-blood wizard serving as Potions Master (1981-1996), Defence Against the Dark Arts professor (1996-1997), and Headmaster (1997-1998) of the Hogwarts School of Witchcraft and Wizardry as well as a member of the Order of the Phoenix and a Death Eater. His double life played an extremely important role in both of the Wizarding Wars against Voldemort. The only child of Muggle Tobias Snape and Gobstones witch Eileen Snape (née Prince), Severus was raised in the Muggle dwelling of Spinner's End, which was in close proximity to the home of the Evans family, though in a poorer area. He met Lily and Petunia Evans when he was nine and fell deeply in love with Lily, becoming a close friend of hers. ", "quote": ["Albus Dumbledore: \"After all this time?\"\nSeverus Snape: \"Always.\"", "―Severus Snape's love for Lily Evans"], "movie": ""}, "Mundungus_Fletcher": {"name": "Mundungus Fletcher", "series": "harry potter", "big_five": [0.12, -0.88, -0.55, 0.65, -0.49], "url": "https://harrypotter.fandom.com/wiki/Mundungus_Fletcher", "description": "Mundungus \"Dung\" Fletcher was a British half-blood wizard who was involved in many illegal activities, having a notoriously disreputable reputation as a petty criminal. However, despite his illicit dealings, he was one of the original members of the Order of the Phoenix, a group dedicated to fighting Lord Voldemort and the Death Eaters. Despite this, many members of the Order had mixed feelings about him; however, he was very loyal to the Order's head, Albus Dumbledore, who once got Fletcher out of serious trouble. ", "quote": ["The so-called Inferius was nothing but a smelly sneak thief by the name of Mundungus Fletcher.", "―Severus Snape's low opinion of Mundungus"], "movie": "Harry Potter and the Half-Blood Prince"}, "Kingsley_Shacklebolt": {"name": "Kingsley Shacklebolt", "series": "harry potter", "big_five": [0.66, 0.13, 0.59, -0.83, 0.54], "url": "https://harrypotter.fandom.com/wiki/Kingsley_Shacklebolt", "description": "Minister Kingsley Shacklebolt was a pure-blood wizard in the employment of the Ministry of Magic. He worked for the Ministry as an Auror, but joined the reconstituted Order of the Phoenix in 1995 after being convinced of the return of Lord Voldemort. Working undercover within the Ministry, he fed the Order with information, and misdirected the Ministry's efforts to locate Sirius Black by saying he was spotted in Tibet.  ", "quote": ["I'm not getting rid of Kingsley Shacklebolt, if that's what you're suggesting! He's highly efficient, gets through twice the work of the rest of them —", "―British Prime Minister in 1996"], "movie": "Harry Potter and the Half-Blood Prince"}, "Rubeus_Hagrid": {"name": "Rubeus Hagrid", "series": "harry potter", "big_five": [0.92, -0.43, -0.86, -0.16, 0.49], "url": "https://harrypotter.fandom.com/wiki/Rubeus_Hagrid", "description": "Professor Rubeus Hagrid (b. 6 December 1928) was a half-giant wizard, son of Mr Hagrid and the giantess Fridwulfa, and elder half-brother of the giant Grawp.", "quote": ["I would trust Hagrid with my life.", "―Albus Dumbledore's trust in Hagrid"], "movie": "Harry Potter and the Philosopher's Stone"}, "Frank_Longbottom": {"name": "Frank Longbottom", "series": "harry potter", "big_five": [-0.47, 0.49, 0.12, -0.53, 0.72], "url": "https://harrypotter.fandom.com/wiki/Frank_Longbottom", "description": "Frank Longbottom was a pure-blood wizard, an Auror for the Ministry of Magic during Lord Voldemort's first rise to power. He was the son of Augusta Longbottom and the husband of Auror Alice Longbottom. At some point Frank attended Hogwarts School of Witchcraft and Wizardry. ", "quote": ["My son and his wife were tortured into insanity by You-Know-Who's followers. They were Aurors, you know, and very well respected within the wizarding community. Highly gifted, the pair of them.", "―Description of Frank and Alice"], "movie": "Harry Potter and the Order of the Phoenix"}, "Igor_Karkaroff": {"name": "Igor Karkaroff", "series": "harry potter", "big_five": [-0.7, 0.28, 0.25, -0.06, 0.12], "url": "https://harrypotter.fandom.com/wiki/Igor_Karkaroff", "description": "Professor Igor Karkaroff (d. 24 June – 31 July, 1996) was a wizard and Headmaster of Durmstrang Institute. During the First Wizarding War, he was a Death Eater who served Lord Voldemort. After being captured and briefly imprisoned in Azkaban following his master's defeat, Karkaroff turned in several of his fellow Death Eaters to the Wizengamot in exchange for his crimes being pardoned. ", "quote": ["Karkaroff: \"It's happening again, like before, and soon neither you nor anyone else will be able to deny it... You don't fool me, Severus. You are scared. Admit it!\"\nSeverus Snape: \"I have nothing to be scared of, Igor. Can you say the same?\"", "―Igor's fear after his Dark Mark begins to burn"], "movie": ""}, "Narcissa_Malfoy": {"name": "Narcissa Malfoy", "series": "harry potter", "big_five": [-0.12, 0.39, 0.5, -0.18, -0.26], "url": "https://harrypotter.fandom.com/wiki/Narcissa_Malfoy", "description": "Narcissa Malfoy (née Black), (b. 1955) was a pure-blood witch, the youngest daughter of Cygnus and Druella Black (née Rosier), younger sister of Bellatrix Lestrange and Andromeda Tonks, wife of Lucius Malfoy, mother of Draco Malfoy and the grandmother of Scorpius Malfoy. ", "quote": ["There is nothing I wouldn't do any more!", "―Narcissa after her son is put in danger"], "movie": "Harry Potter and the Half-Blood Prince"}, "Bathilda_Bagshot": {"name": "Bathilda Bagshot", "series": "harry potter", "big_five": [0.85, 0.83, -0.32, -0.73, 0.32], "url": "https://harrypotter.fandom.com/wiki/Bathilda_Bagshot", "description": "Professor Bathilda Bagshot (d. 1997) was a British witch, magical historian and the author of A History of Magic and approximately ten other books. A History of Magic is used in the Hogwarts School of Witchcraft and Wizardry class of the same name, taught by Professor Binns. She lived in Godric's Hollow, and was murdered around December, 1997, after which her corpse was animated by Lord Voldemort to contain his snake Nagini.", "quote": ["Harry Potter: \"Bathilda Bagshot? The author of A History of Magic?\"\nElphias Doge: \"Yes. A most gifted magical historian and an old friend of Albus's.\"\nMuriel: \"Quite gaga these days, I've heard.\"", "―A discussion regarding Bathilda"], "movie": ""}, "Gellert_Grindelwald": {"name": "Gellert Grindelwald", "series": "harry potter", "big_five": [-0.2, 0.28, 0.27, 0.15, 0.76], "url": "https://harrypotter.fandom.com/wiki/Gellert_Grindelwald", "description": "Gellert Grindelwald (c. 1883 – March 1998) was a pure or half-blood wizard who is considered to be one of the most powerful and dangerous Dark Wizards of all time, his only superior being Tom Riddle. A student at Durmstrang Institute, Grindelwald was expelled for twisted, dark experiments and near-fatal attacks on students.  ", "quote": ["A law that has us scuttling like rats in the gutter. A law that demands that we conceal our true nature. A law that directs those under its dominion to cower in fear, lest we risk discovery. I ask you, Madam President, I ask all of you — who does this law protect? Us, or them? I refuse to bow down any longer.", "―Gellert Grindelwald"], "movie": "Fantastic Beasts and Where to Find Them "}, "Porpentina_Goldstein": {"name": "Porpentina Goldstein", "series": "harry potter", "big_five": [0.17, -0.17, 0.37, -0.38, 0.29], "url": "https://harrypotter.fandom.com/wiki/Porpentina_Goldstein", "description": "Porpentina Esther \"Tina\" Scamander (née Goldstein) (b. 19 August, 1901) was a half-blood American witch. She attended Ilvermorny School of Witchcraft and Wizardry, where she was sorted into Thunderbird house. After graduating from IIvermorny, she became an Auror for the Magical Congress of the United States of America.", "quote": ["I know what that woman did to you... I know that you’ve suffered... you need to stop this now... Newt and I will protect you.", "―Tina's sympathy towards Credence Barebone"], "movie": "Fantastic Beasts and Where to Find Them "}, "Silvanus_Kettleburn": {"name": "Silvanus Kettleburn", "series": "harry potter", "big_five": [0.42, 0.76, -0.58, -0.06, -0.72], "url": "https://harrypotter.fandom.com/wiki/Silvanus_Kettleburn", "description": "Professor Silvanus Kettleburn (b. 22 November, (pre- 1927[citation needed]) was a wizard who, after graduating from Hogwarts School of Witchcraft and Wizardry, served as professor of Care of Magical Creatures. His recklessness and the nature of his subject resulted in him losing all his limbs but one arm and half of one leg. He retired in 1993 but still made visits to dragon sanctuaries.", "quote": ["Professor Kettleburn survived no fewer than sixty-two periods of probation during his employment as Care of Magical Creatures teacher.", "―Kettleburn's extreme recklessness"], "movie": "The Tales of Beedle the Bard "}, "Justin_Finch-Fletchley": {"name": "Justin Finch-Fletchley", "series": "harry potter", "big_five": [0.67, 0.83, -0.12, 0.11, -0.3], "url": "https://harrypotter.fandom.com/wiki/Justin_Finch-Fletchley", "description": "Justin Finch-Fletchley (b. 1979/1980) was a Muggle-born wizard. He was in the same year as the famous Harry Potter at Hogwarts School of Witchcraft and Wizardry and was sorted into Hufflepuff House in 1991. Justin was a member of Dumbledore's Army, an organisation taught and led by Harry Potter and was good friends with housemates Ernie Macmillan and Hannah Abbott.", "quote": ["My name was down for Eton, you know. I can't tell you how glad I am I came here instead. Of course, Mother was slightly disappointed, but since I made her read Lockhart's books I think she's begun to see how useful it'll be to have a fully trained wizard in the family....", "―Justin introduces himself to Harry Potter"], "movie": "Harry Potter and the Chamber of Secrets"}, "Irma_Pince": {"name": "Irma Pince", "series": "harry potter", "big_five": [-0.28, -0.06, 0.38, 0.38, -0.66], "url": "https://harrypotter.fandom.com/wiki/Irma_Pince", "description": "Madam Irma Pince (fl. 1971 – 1997) was a witch and librarian at the library of Hogwarts School of Witchcraft and Wizardry. She was highly possessive and protective of the school's books and was deemed highly unpleasant by most of the student body. ", "quote": ["A warning: If you rip, tear, shred, bend, fold, deface, disfigure, smear, smudge, throw, drop, or in any other manner damage, mistreat, or show lack of respect towards this book, the consequences will be as awful as it is within my power to make them.", "―Pince's note in a library book"], "movie": "Quidditch Through the Ages "}, "Oliver_Wood": {"name": "Oliver Wood", "series": "harry potter", "big_five": [-0.81, 0.76, 0.39, -0.24, 0.23], "url": "https://harrypotter.fandom.com/wiki/Oliver_Wood", "description": "Oliver Wood (born c. 1975 or 1976) was a Scottish wizard who was the Keeper and Captain for the Gryffindor Quidditch team. He attended Hogwarts School of Witchcraft and Wizardry from 1987 to 1994. Oliver was known for his determination and skill on the playing field, and his long lectures before practises. He led the Gryffindor team to victory in the Quidditch Cup in his seventh year.", "quote": ["Bad news, Harry. I've just been to see Professor McGonagall about the Firebolt. She — er — got a bit shirty with me. Told me I'd got my priorities wrong. Seemed to think I cared more about winning the Cup than I do about you staying alive. Just because I told her I didn't care if it threw you off, as long as you caught the Snitch on it first. Honestly, the way she was yelling at me... you'd think I'd said something terrible.", "―Wood's intense devotion to Quidditch"], "movie": "Harry Potter and the Prisoner of Azkaban"}, "Mafalda_Hopkirk": {"name": "Mafalda Hopkirk", "series": "harry potter", "big_five": [0.32, 0.1, 0.18, -0.31, -0.35], "url": "https://harrypotter.fandom.com/wiki/Mafalda_Hopkirk", "description": "Madam Mafalda Hopkirk (b. February 19 - March 20, in or before 1975) was a witch and an assistant in the Improper Use of Magic Office at the Ministry of Magic. She issued notices to many of those who violated the International Statute of Wizarding Secrecy or the Decree for the Reasonable Restriction of Underage Sorcery. This included Harry Potter on two occasions.", "quote": ["Dear Mr Potter, We have received intelligence that a Hover Charm was used at your place of residence this evening at twelve minutes past nine. As you know, under age wizards are not permitted to perform spells outside school, and further spell work on your part may lead to expulsion from said school (Decree for the Reasonable Restriction of Under age Sorcery, 1875, Paragraph C). We would also ask you to remember that any magical activity that risks notice by members of the non-magical community (Muggles) is a serious offence under section 13 of the International Confederation of Warlocks' Statute of Secrecy. Enjoy your Holidays! Yours sincerely, Mafalda Hopkirk", "―Hopkirk's warning to Harry Potter"], "movie": "Harry Potter and the Chamber of Secrets"}, "Seamus_Finnigan": {"name": "Seamus Finnigan", "series": "harry potter", "big_five": [0.27, 0.14, -0.12, -0.18, -0.16], "url": "https://harrypotter.fandom.com/wiki/Seamus_Finnigan", "description": "Seamus Finnigan (b. 1979/1980) was a half-blood wizard, son of Muggle Mr Finnigan and Irish witch Mrs Finnigan. Mr Finnigan did not learn this until after they were married and it gave him a \"nasty shock\" when he first learned it.", "quote": ["Professor McGonagall: \"Why don't you confer with Mr Finnigan? As I recall, he has a particular proclivity for pyrotechnics.\"\nSeamus: \"I can bring it down!\"", "―Plans regarding Seamus blowing up the Wooden Bridge"], "movie": ""}, "Dobby": {"name": "Dobby", "series": "harry potter", "big_five": [0.33, 0.56, 0.27, 0.84, 0.41], "url": "https://harrypotter.fandom.com/wiki/Dobby", "description": "Dobby (28 June (year unknown) – March, 1998) was a male house-elf who served the Malfoy family. His masters were Dark Wizards who treated him cruelly. In 1992 he disobeyed his masters and tried to warn Harry Potter of the plot to have the Chamber of Secrets reopened. He came to know this via the contact between his masters and Lord Voldemort.  At the end of that school year, after Harry had vanquished the memory of Tom Riddle and slayed the basilisk in the Chamber of Secrets, he tricked Lucius Malfoy into freeing Dobby. Harry accomplished this by placing the Diary of Tom Riddle inside his own sock. Lucius disgustedly ripped the sock off the book and threw the sock into the air, where Dobby caught it.", "quote": ["Dobby has no master. Dobby is a free elf!", "―Dobby proud of being a free elf"], "movie": "Harry Potter and the Deathly Hallows"}, "Fred_Weasley": {"name": "Fred Weasley", "series": "harry potter", "big_five": [0.88, 0.91, -0.36, -0.38, 0.77], "url": "https://harrypotter.fandom.com/wiki/Fred_Weasley", "description": "Fred Weasley (1 April, 1978 – 2 May, 1998) was a pure-blood wizard, a son of Arthur Weasley and Molly Weasley (née Prewett), brother to Bill, Charlie, Percy, Ron, and Ginny Weasley, and twin brother to George Weasley. Fred's first few years were marked by the height of the First Wizarding War and when Lord Voldemort fell for the first time. ", "quote": ["The thing about growing up with Fred and George, is that you sort of start thinking anything's possible if you've got enough nerve.", "―The twins' audacity and boldness"], "movie": "Harry Potter and the Order of the Phoenix"}, "James_Potter": {"name": "James Potter", "series": "harry potter", "big_five": [0.31, 0.48, -0.18, -0.43, 0.23], "url": "https://harrypotter.fandom.com/wiki/James_Potter_I", "description": "James Potter (27 March, 1960 – 31 October, 1981), also known as Prongs, was a pure-blood wizard and the only son of Fleamont and Euphemia Potter. He attended Hogwarts School of Witchcraft and Wizardry from 1971-1978, and was sorted into Gryffindor. When James started at Hogwarts, he met and became best friends with three fellow Gryffindor students: Remus Lupin, Sirius Black, and Peter Pettigrew. He also met Severus Snape, a Slytherin student with whom he became bitter rivals. During his seventh year, James was appointed Head Boy and began dating Lily Evans. ", "quote": ["Lily, take Harry and go! It’s him! Go! Run! I’ll hold him off —", "―James stands between Lord Voldemort and his family"], "movie": "Harry Potter and the Deathly Hallows"}, "Cornelius_Fudge": {"name": "Cornelius Fudge", "series": "harry potter", "big_five": [0.29, 0.17, -0.37, -0.08, -0.4], "url": "https://harrypotter.fandom.com/wiki/Cornelius_Fudge", "description": "Minister Cornelius Oswald Fudge, O.M. (First Class), was a British wizard who was the Minister for Magic from 1990-1996. He thus had complete control of the Ministry of Magic, the main governing body of the British wizarding world. Fudge began his career in the Ministry as Junior Minister in the Department of Magical Accidents and Catastrophes. He then succeeded Millicent Bagnold as Minister for Magic, and thus had the responsibility of meeting with the Muggle Prime Minister when necessary.", "quote": ["You are blinded by the love of your office, Cornelius! You place too much importance, and you always have done, on the so-called purity of blood! You fail to recognise that it matters not what someone is born, but what they grow to be!", "―Fudge's faulty and inaccurate values"], "movie": "Harry Potter and the Goblet of Fire"}, "Rolanda_Hooch": {"name": "Rolanda Hooch", "series": "harry potter", "big_five": [0.2, 0.14, 0.05, 0.23, 0.03], "url": "https://harrypotter.fandom.com/wiki/Rolanda_Hooch", "description": "Madam Rolanda Hooch (b. before 1918) was a British witch who worked as the Flying instructor, Quidditch referee, and coach at Hogwarts School of Witchcraft and Wizardry. She learnt to fly on her own Silver Arrow broomstick sometime before or during the Great War and returned to Hogwarts for a job. While on staff at Hogwarts, Hooch worked under Headmasters Albus Dumbledore, Dolores Umbridge, and Minerva McGonagall.", "quote": ["Now I want a nice clean game… from all of you.", "―Madam Hooch before a Quidditch match"], "movie": "Harry Potter and the Philosopher's Stone "}, "Alastor_Moody": {"name": "Alastor Moody", "series": "harry potter", "big_five": [0.33, 0.15, 0.49, 0.05, 0.57], "url": "https://harrypotter.fandom.com/wiki/Alastor_Moody", "description": "Alastor \"Mad-Eye\" Moody (d. 27 July, 1997) was a pure-blood Scottish wizard, considered to be the most famous Auror of all times. He was also a pivotal member of the Order of the Phoenix during the First and Second Wizarding Wars. Moody served with distinction during the first conflict, gaining a considerable reputation, as well as losing an eye, leg, and part of his nose while fighting the Dark Arts. He was also responsible for many of the inhabited cells in Azkaban, having caught innumerable Dark Wizards. As a result, Moody became overly-cautious and paranoid about his security.", "quote": ["You need to know what you're up against! You need to be prepared!", "―Moody's famous quote"], "movie": "Harry Potter and the Goblet of Fire"}, "Rufus_Scrimgeour": {"name": "Rufus Scrimgeour", "series": "harry potter", "big_five": [-0.89, 0.38, 0.07, 0.6, 0.49], "url": "https://harrypotter.fandom.com/wiki/Rufus_Scrimgeour", "description": "Minister Rufus Scrimgeour (d. 1 August, 1997) was a British wizard who was a powerful ranking official in the Ministry of Magic. He originally joined the Ministry of Magic as an Auror, where he became a hardened veteran, spending most of his life fighting Dark Wizards. Eventually he rose to become Head of the Auror Office. During the Second Wizarding War, Scrimgeour was appointed in 1996 to succeed Cornelius Fudge as Minister for Magic. While he appeared to provide a much tougher and resolute stance against Lord Voldemort and his Death Eaters, he made the same mistake of creating the appearance of safety and security, while in truth Scrimgeour's efforts were waning in progress in the war.", "quote": ["The Prime Minister's first, foolish thought was that Rufus Scrimgeour looked rather like an old lion. There were streaks of grey in his mane of tawny hair and his bushy eyebrows, he had keen yellowish eyes behind a pair of wire-rimmed spectacles and a certain rangy, loping grace even though he walked with a slight limp. There was an immediate impression of shrewdness and toughness; the Prime Minister thought he understood why the wizarding community preferred Scrimgeour to Fudge as a leader in these dangerous times.", "―Scrimgeour's outward disposition"], "movie": "Harry Potter and the Half-Blood Prince"}, "Remus_Lupin": {"name": "Remus Lupin", "series": "harry potter", "big_five": [0.78, -0.27, 0.74, -0.4, 0.59], "url": "https://harrypotter.fandom.com/wiki/Remus_Lupin", "description": "Professor Remus John Lupin, O.M. (First Class), (10 March, 1960 – 2 May, 1998), also known as Moony, was a half-blood wizard and the only son of Lyall and Hope Lupin (née Howell). He was afflicted with lycanthropy during his childhood, as a result of Fenrir Greyback's revenge against Lyall. He attended Hogwarts School of Witchcraft and Wizardry from 1971-1978 and was Sorted into Gryffindor House. During his school years he was one of the Marauders, best friends with Sirius Black, James Potter, and Peter Pettigrew. Together they created the Marauder's Map.", "quote": ["It is the quality of one's convictions that determines success, not the number of followers.", "―Remus regarding the importance of belief"], "movie": "Harry Potter and the Deathly Hallows: Part 2"}, "Cedric_Diggory": {"name": "Cedric Diggory", "series": "harry potter", "big_five": [0.82, 0.46, 0.81, -0.45, 0.55], "url": "https://harrypotter.fandom.com/wiki/Cedric_Diggory", "description": "Cedric Diggory (September/October, 1977 – 24 June, 1995) was a British wizard who was the son of Amos Diggory and his wife. He started attending Hogwarts School of Witchcraft and Wizardry in 1989, and was sorted into the  Hufflepuff House. During his time at school he was a prefect and captained the Hufflepuff Quidditch team, playing as Seeker. In his sixth year Cedric put his name forward to compete in the Triwizard Tournament.", "quote": ["Remember, if the time should come, when you have to make a choice between what is right and what is easy, remember what happened to a boy who was good, and kind, and brave, because he strayed across the path of Lord Voldemort. Remember Cedric Diggory.", "―Albus Dumbledore's eulogy to Cedric"], "movie": "Harry Potter and the Goblet of Fire"}, "Gregory_Goyle": {"name": "Gregory Goyle", "series": "harry potter", "big_five": [-0.82, -0.34, -0.11, -0.56, 0.46], "url": "https://harrypotter.fandom.com/wiki/Gregory_Goyle", "description": "Gregory Goyle (b. 1979/1980) was a pure-blood Dark Wizard in the same year as Harry Potter at Hogwarts School of Witchcraft and Wizardry. He was sorted into Slytherin House. Goyle was the son of a Death Eater and his wife. It is unknown if he was a Death Eater as well.", "quote": ["We're supposed to practise the Cruciatus Curse on people who've earned detentions... I refused to do it. Some people are into it, though; Crabbe and Goyle love it. First time they've ever been top in anything, I expect.", "―Neville describing Crabbe and Goyle's cruelty"], "movie": "Harry Potter and the Deathly Hallows"}, "Arthur_Weasley": {"name": "Arthur Weasley", "series": "harry potter", "big_five": [0.77, 0.45, -0.31, -0.08, 0.46], "url": "https://harrypotter.fandom.com/wiki/Arthur_Weasley", "description": "Arthur Weasley (b. 6 February, 1950) was a pure-blood wizard in the employ of the Ministry of Magic, as well as a member of the second Order of the Phoenix. He was a staunch believer in the equality of all magical and Muggle folk and was the head of the Weasley family.", "quote": ["Molly Weasley: \"Your sons flew that enchanted car of yours to Surrey and back last night.\"\nArthur: \"Did you really? How did it go?\"", "―Arthur's laid-back personality"], "movie": ""}, "Amelia_Bones": {"name": "Amelia Bones", "series": "harry potter", "big_five": [0.56, 0.38, 0.47, -0.64, 0.47], "url": "https://harrypotter.fandom.com/wiki/Amelia_Bones", "description": "Madam Amelia Susan Bones (d. mid-July, 1996) was a witch and celebrated Head of the Department of Magical Law Enforcement. Born to Mr. and Mrs Bones, she likely attended Hogwarts School of Witchcraft and Wizardry before joining the Ministry of Magic.", "quote": ["Amelia Bones is okay... she's fair, she'll hear you out", "―Nymphadora Tonks regarding Amelia's nature"], "movie": "Harry Potter and the Order of the Phoenix"}, "Myrtle_Warren": {"name": "Myrtle Warren", "series": "harry potter", "big_five": [0.33, -0.82, -0.38, 0.77, 0.1], "url": "https://harrypotter.fandom.com/wiki/Myrtle_Warren", "description": "Myrtle Elizabeth Warren (1928/1929 – 13 June, 1943), more commonly known after her death as Moaning Myrtle, was a Muggle-born witch who attended Hogwarts School of Witchcraft and Wizardry from 1940 – 1943 and was sorted into Ravenclaw house. She was killed in 1943 by Salazar Slytherin's Basilisk, under Lord Voldemort's (Tom Riddle) orders. After the incident, she became a ghost who haunted the second-floor girls' bathroom (and occasionally other bathroom facilities) at Hogwarts.", "quote": ["No one wants to upset me! That's a good one! My life was nothing but misery at this place and now people come along ruining my death!", "―Myrtle's outlook on her life and death at Hogwarts"], "movie": "Harry Potter and the Chamber of Secrets"}, "Lucius_Malfoy": {"name": "Lucius Malfoy", "series": "harry potter", "big_five": [-0.63, 0.65, 0.26, -0.03, 0.05], "url": "https://harrypotter.fandom.com/wiki/Lucius_Malfoy", "description": "Lucius Malfoy (b. 1953/1954) was a pure-blood wizard, and son of Abraxas Malfoy, husband of Narcissa Black, the father of Draco Malfoy and the grandfather of Scorpius Malfoy. Lucius was educated at Hogwarts, where he was made a prefect in Slytherin House. As an adult, Lucius was an aristocratic wizard and patriarch of the Malfoy family, believing strongly in notions of blood purity and the superiority of pure-blood wizards. He joined the Death Eaters, who shared his views on blood purity, and participated in the First Wizarding War.", "quote": ["Malfoy's been giving generously to all sorts of things for years...  Gets him in with the right people... then he can ask for favours...  delay laws he doesn't want passed... Oh, he's very well connected, Lucius Malfoy....", "―Lucius' former position in the wizarding community"], "movie": "Harry Potter and the Half-Blood Prince"}, "Cho_Chang": {"name": "Cho Chang", "series": "harry potter", "big_five": [0.56, 0.64, 0.33, 0.34, 0.27], "url": "https://harrypotter.fandom.com/wiki/Cho_Chang", "description": "Cho Chang (b. 1978/1979) was a witch who attended Hogwarts School of Witchcraft and Wizardry from 1990-1997 and was sorted into Ravenclaw House. She was a Seeker for the Ravenclaw Quidditch team and a popular student. In Cho's fifth year, she began dating Cedric Diggory while he was a Champion in the Triwizard Tournament. Cedric became one of the first casualties of the Second Wizarding War. He was murdered by Peter Pettigrew on Lord Voldemort's order in June of 1995. His death greatly upset Cho and made her determined to fight against the recently returned Dark Lord.", "quote": ["Obviously, she is feeling very sad, because of Cedric dying. Then I expect she's feeling confused because she liked Cedric and now she likes Harry, and she can't work out who she likes best. Then she'll be feeling guilty, thinking it's an insult to Cedric's memory to be kissing Harry at all... And she probably can't work out what her feelings are towards Harry anyway, because he was the one who was with Cedric when Cedric died, so that's all very mixed up and painful.", "―Cho's grief, confusion, and guilt"], "movie": "Harry Potter and the Order of the Phoenix"}, "Poppy_Pomfrey": {"name": "Poppy Pomfrey", "series": "harry potter", "big_five": [0.72, -0.19, 0.21, 0.58, -0.16], "url": "https://harrypotter.fandom.com/wiki/Poppy_Pomfrey", "description": "Madam Poppy Pomfrey was a British witch and the matron at Hogwarts School of Witchcraft and Wizardry. She was a very competent nurse, having been in the position for, at least, the last quarter of the 20th century.", "quote": ["Madam Pomfrey, the matron, was a nice woman, but very strict.", "―Description"], "movie": "Harry Potter and the Philosopher's Stone"}, "Marge_Dursley": {"name": "Marge Dursley", "series": "harry potter", "big_five": [-0.76, 0.26, -0.32, 0.34, -0.09], "url": "https://harrypotter.fandom.com/wiki/Marge_Dursley", "description": "Marjorie \"Marge\" Eileen Dursley was Vernon Dursley's elder sister, sister-in-law to Petunia Dursley, and the aunt of Dudley Dursley. She had a career in breeding bulldogs. Ripper, a particularly ferocious bulldog, was her favourite.", "quote": ["I still don't like your tone, boy. If you can speak of your beatings in that casual way, they clearly aren't hitting you hard enough. Petunia, I'd write to them if I were you. Make it clear that you approve the use of extreme force in this boy's case.", "―Marge's cruelty towards Harry Potter"], "movie": "Harry Potter and the Prisoner of Azkaban"}, "Minerva_McGonagall": {"name": "Minerva McGonagall", "series": "harry potter", "big_five": [0.04, -0.01, 0.77, -0.62, 0.49], "url": "https://harrypotter.fandom.com/wiki/Minerva_McGonagall", "description": "Professor/Headmistress Minerva McGonagall, O.M. (First Class), was a Scottish half-blood witch, the only daughter of Muggle Robert McGonagall and witch Isobel Ross. She had two younger brothers, Malcolm and Robert Jr. Minerva was a registered Animagus who attended Hogwarts School of Witchcraft and Wizardry and was Sorted into Gryffindor House (but it took the sorting hat five and a half minutes to decide if she was Gryffindor or Ravenclaw, which made her a Hatstall).   ", "quote": ["Hogwarts is threatened! Man the boundaries. Protect us! Do your duty to our school!...I've always wanted to use that spell.", "―McGonagall prepares for the Battle of Hogwarts"], "movie": "Harry Potter and the Deathly Hallows: Part 2"}, "Nymphadora_Tonks": {"name": "Nymphadora Tonks", "series": "harry potter", "big_five": [0.64, 0.86, 0.56, 0.23, 0.68], "url": "https://harrypotter.fandom.com/wiki/Nymphadora_Tonks", "description": "Nymphadora Tonks  (c. 1973 – 2 May, 1998) more commonly known as Tonks, occasionally Dora, was a half-blood witch and the only child of Ted and Andromeda Tonks (née Black). She was a Metamorphmagus and attended Hogwarts School of Witchcraft and Wizardry from 1984-1991. She was Sorted into Hufflepuff House and was in the same year at Hogwarts as Gryffindor Charlie Weasley. ", "quote": ["Don't call me Nymphadora, Remus. It's Tonks.", "―Tonks' intense dislike of her first name"], "movie": "Harry Potter and the Order of the Phoenix"}, "Molly_Weasley": {"name": "Molly Weasley", "series": "harry potter", "big_five": [0.84, 0.82, 0.48, -0.18, 0.11], "url": "https://harrypotter.fandom.com/wiki/Molly_Weasley", "description": "Molly Weasley (née Prewett) (b. 30 October, 1949 or 1950) was an English pure-blood witch and matriarch of the Weasley family after marrying Arthur Weasley. She was born into the Prewett family and was sister to Fabian and Gideon Prewett, members of the original Order of the Phoenix. ", "quote": [" ", "―Molly's incredible protectiveness of her children"], "movie": "Harry Potter and the Deathly Hallows"}, "Fleur_Delacour": {"name": "Fleur Delacour", "series": "harry potter", "big_five": [0.52, 0.32, -0.34, 0.58, -0.12], "url": "https://harrypotter.fandom.com/wiki/Fleur_Delacour", "description": "Fleur Isabelle Weasley (née Delacour) (b. c. 1976-1977) was a French, quarter-Veela witch daughter of Apolline Delacour and her husband, and elder sister of Gabrielle. Fleur attended Beauxbatons Academy of Magic. During the 1994–1995 school year, she was Beauxbatons' champion in the Triwizard Tournament. Fleur competed bravely, but the Tournament ended in tragedy with the murder of Cedric Diggory and the return of Lord Voldemort.", "quote": ["Arry, you saved my sister's life. I do not forget.", "―Fleur's fierce loyalty to Harry Potter"], "movie": "Harry Potter and the Deathly Hallows"}, "Elphias_Doge": {"name": "Elphias Doge", "series": "harry potter", "big_five": [0.76, 0.71, 0.56, -0.62, 0.27], "url": "https://harrypotter.fandom.com/wiki/Elphias_Doge", "description": "Elphias Doge (b. between 1 September 1880 and 31 August 1881) was a pure-blood wizard, a Ministry of Magic jurist, a member of the Order of the Phoenix in both the First and Second Wizarding Wars, and also a close friend of Albus Dumbledore. ", "quote": ["That old berk. Thought the sun shone out of my brother's every orifice, he did.", "―Aberforth Dumbledore regarding Doge"], "movie": "Harry Potter and the Deathly Hallows"}, "Ron_Weasley": {"name": "Ron Weasley", "series": "harry potter", "big_five": [0.65, 0.19, -0.19, 0.38, -0.07], "url": "https://harrypotter.fandom.com/wiki/Ron_Weasley", "description": "Ronald Bilius \"Ron\" Weasley (b. 1 March, 1980) was a pure-blood wizard, the sixth and youngest son of Arthur and Molly Weasley (née Prewett). He was also the younger brother of Bill, Charlie, Percy, Fred, George, and the elder brother of Ginny. Ron and his brothers and sister lived at the Burrow, on the outskirts of Ottery St Catchpole. ", "quote": ["I'm the sixth in our family to go to Hogwarts. You could say I got a lot to live up to. Bill and Charlie have already left — Bill was Head Boy and Charlie was captain of Quidditch. Now Percy's a prefect. Fred and George mess around a lot, but they still get really good marks and everyone thinks they're really funny. Everyone expects me to do as well as the others, but if I do, it's no big deal, because they did it first.", "―Ron's family and other's expectations"], "movie": "Harry Potter and the Philosopher's Stone"}, "Zacharias_Smith": {"name": "Zacharias Smith", "series": "harry potter", "big_five": [-0.48, -0.3, -0.53, 0.82, 0.0], "url": "https://harrypotter.fandom.com/wiki/Zacharias_Smith", "description": "Zacharias Smith (b. c. 1979/1981) was a British wizard who attended Hogwarts School of Witchcraft and Wizardry, who was sorted into and a member of Hufflepuff House. He was a Chaser on the Hufflepuff Quidditch team and a member of Dumbledore's Army, an organisation taught and led by Harry Potter. In 1998 he abandoned the D.A. instead of fighting with them during the Battle of Hogwarts. ", "quote": ["I don’t think ", "―Zacharias' overly critical nature"], "movie": "Harry Potter and the Order of the Phoenix"}, "Alicia_Spinnet": {"name": "Alicia Spinnet", "series": "harry potter", "big_five": [0.47, 0.86, -0.18, -0.24, -0.02], "url": "https://harrypotter.fandom.com/wiki/Alicia_Spinnet", "description": "Alicia Spinnet (b. 1977/1978) was a witch and a Gryffindor student at Hogwarts School of Witchcraft and Wizardry from 1989-1996. She played as a reserve Chaser and later Chaser on the Gryffindor Quidditch team. During her Hogwarts years, she became close friends with Hermione Granger, Cho Chang, Katie Bell, and Angelina Johnson. In her seventh year, she joined Dumbledore's Army, an organisation taught and led by Harry Potter. In 1998, she returned at Hogwarts in order to fight in the Battle of Hogwarts against Lord Voldemort and his Death Eaters.", "quote": ["Draco Malfoy: \"No one asked your opinion, you filthy little Mudblood!\"\nAlicia Spinnet: \" HOW DARE YOU!\"", "―Alicia's reaction to Draco Malfoy insulting Hermione Granger"], "movie": ""}, "Dolores_Jane_Umbridge": {"name": "Dolores Jane Umbridge", "series": "harry potter", "big_five": [-0.3, -0.3, 0.2, -0.31, -0.03], "url": "https://harrypotter.fandom.com/wiki/Dolores_Jane_Umbridge", "description": "Madam Undersecretary Professor Dolores Jane Umbridge (b. 26 August, year unknown) was a half-blood witch and Ministry of Magic bureaucrat who served as Senior Undersecretary to the Minister for Magic under Ministers Cornelius Fudge, Rufus Scrimgeour, and Pius Thicknesse.", "quote": ["When they entered the Defence Against the Dark Arts classroom they found Professor Umbridge already seated at the teacher’s desk, wearing the fluffy pink cardigan of the night before and the black velvet bow on top of her head. Harry was again reminded forcibly of a large fly perched unwisely on top of an even larger toad.", "―A negative impression of Dolores"], "movie": "Harry Potter and the Order of the Phoenix"}, "The_Bloody_Baron": {"name": "The Bloody Baron", "series": "harry potter", "big_five": [0.27, 0.37, 0.04, 0.25, -0.16], "url": "https://harrypotter.fandom.com/wiki/The_Bloody_Baron", "description": "The Bloody Baron (d. 11th century) was a wizard who attended Hogwarts School of Witchcraft and Wizardry in the Founders' time and was Sorted into Slytherin House.", "quote": ["Seamus Finnigan: \"How did he get covered in blood?\"\nNicholas de Mimsy-Porpington: \"I've never asked.\"", "―Seamus asking Sir Nicholas about the Bloody Baron"], "movie": ""}, "Walden_Macnair": {"name": "Walden Macnair", "series": "harry potter", "big_five": [-0.87, -0.23, 0.0, 0.21, -0.15], "url": "https://harrypotter.fandom.com/wiki/Walden_Macnair", "description": "Walden Macnair was a Dark wizard and one of Lord Voldemort's early Death Eaters, who fought in the First Wizarding War. Macnair did not search for Voldemort after his first downfall, but this was forgiven after Voldemort's return. He managed to avoid Azkaban, and worked for the Ministry of Magic as Executioner. ", "quote": ["Macnair, remember him? Bloke they sent ter kill Buckbeak? Maniac, he is. Likes killin' as much as Golgomath; no wonder they were gettin' on so well.", "―Rubeus Hagrid tells the trio of his mission to the Giant colony"], "movie": "Harry Potter and the Order of the Phoenix"}, "Horace_Slughorn": {"name": "Horace Slughorn", "series": "harry potter", "big_five": [0.46, 0.78, 0.11, 0.03, 0.13], "url": "https://harrypotter.fandom.com/wiki/Horace_Slughorn", "description": "Professor Horace Eugene Flaccus Slughorn (b. 28 April, between 1882 and 1913) was a pure-blood or half-blood wizard. He attended Hogwarts School of Witchcraft and Wizardry as a member of Slytherin before returning in 1931 as Potions Master. He also served as Head of Slytherin House, before retiring in 1981 due to a fear that Albus Dumbledore would discover that he had told Tom Riddle about Horcruxes.", "quote": ["Horace likes his comfort. He also likes the company of the famous, the successful, and the powerful. He enjoys the feeling that he influences these people. He has never wanted to occupy the throne himself. He prefers the back-seat; there is more room to spread out.", "―Slughorn's preference for \"famous\" friends"], "movie": "Harry Potter and the Half-Blood Prince"}, "Viktor_Krum": {"name": "Viktor Krum", "series": "harry potter", "big_five": [0.3, -0.37, 0.54, -0.63, -0.33], "url": "https://harrypotter.fandom.com/wiki/Viktor_Krum", "description": "Viktor Krum (Bulgarian: Виктор Крум; born April-August, 1976) was a Bulgarian wizard. He attended the Durmstrang Institute, and was also the Seeker for the Bulgarian National Quidditch team at the age of eighteen while still at school.", "quote": ["He's unbelievable. He's really young too. Only just eighteen or something. He's a genius, you wait until tonight, you'll see.", "―Ron Weasley on Krum's flying"], "movie": "Harry Potter and the Goblet of Fire"}, "Harry_Potter": {"name": "Harry Potter", "series": "harry potter", "big_five": [0.33, -0.16, 0.23, 0.27, 0.43], "url": "https://harrypotter.fandom.com/wiki/Harry_Potter", "description": "Harry James Potter (b. 31 July, 1980) was an English half-blood wizard, one of the most famous wizards of modern times. He was the only child and son of James and Lily Potter (née Evans), both members of the original Order of the Phoenix. Harry's birth was overshadowed by a prophecy, naming either himself or Neville Longbottom as the one with the power to vanquish Lord Voldemort. After half of the prophecy was reported to Voldemort courtesy of Severus Snape, Harry was chosen as the target due to his many similarities with the Dark Lord. This caused the Potter family to go into hiding. Voldemort made his first vain attempt to circumvent the prophecy when Harry was a year and three months old. During this attempt he murdered Harry's parents as they tried to protect him, but this unsuccessful attempt to kill Harry led to Voldemort's first downfall. This downfall marked the end of the First Wizarding War, and to Harry henceforth being known as the \"Boy Who Lived\".", "quote": ["You are protected, in short, by your ability to love! The only protection that can possibly work against the lure of power like Voldemort's! In spite of all the temptation you have endured, all the suffering, you remain pure of heart, just as pure as you were at the age of eleven, when you stared into a mirror that reflected your heart's desire, and it showed you only the way to thwart Lord Voldemort, and not immortality or riches. Harry, have you any idea how few wizards could have seen what you saw in that mirror?", "―Description of Harry's rare nature"], "movie": "Harry Potter and the Half-Blood Prince"}, "Augustus_Rookwood": {"name": "Augustus Rookwood", "series": "harry potter", "big_five": [-0.8, 0.33, 0.14, 0.19, -0.16], "url": "https://harrypotter.fandom.com/wiki/Augustus_Rookwood", "description": "Augustus Rookwood was a Dark wizard and a Death Eater loyal to Lord Voldemort. During the First Wizarding War he was a spy who worked as an Unspeakable in the Department of Mysteries. After the height of the first war he was named by his comrade Igor Karkaroff, Rookwood was arrested and imprisoned in Azkaban. ", "quote": ["Rookwood: a spy. He gave valuable information through the Ministry to He-Who-Must-Not-Be-Named!", "―Rookwood's loyalty revealed"], "movie": "Harry Potter and the Goblet of Fire"}, "Pomona_Sprout": {"name": "Pomona Sprout", "series": "harry potter", "big_five": [0.58, -0.6, 0.09, 0.47, -0.56], "url": "https://harrypotter.fandom.com/wiki/Pomona_Sprout", "description": "Professor Pomona Sprout (b. 15 May) was a British witch who worked as Head of Hufflepuff House and Head of the Herbology department at Hogwarts School of Witchcraft and Wizardry. She attended the school in her youth, where she was Sorted into Hufflepuff and excelled at Herbology. Some time after her graduation, Sprout returned to Hogwarts to teach.", "quote": ["I feel that if a single pupil wants to come, then the school ought to remain open for that pupil.", "―Sprout's view on Hogwarts and education"], "movie": "Harry Potter and the Half-Blood Prince"}, "Gilderoy_Lockhart": {"name": "Gilderoy Lockhart", "series": "harry potter", "big_five": [-0.16, 0.95, -0.53, 0.12, -0.26], "url": "https://harrypotter.fandom.com/wiki/Gilderoy_Lockhart", "description": "Professor Gilderoy Lockhart, O.M. (Third Class), (b. 26 January, 1964) was a half-blood wizard, a Ravenclaw student at Hogwarts School of Witchcraft and Wizardry, and later a famous wizarding celebrity who authored many books on dark creatures and his supposed encounters with them.", "quote": ["Celebrity is as celebrity does.", "―Lockhart's dubious advice to Harry Potter"], "movie": "Harry Potter and the Chamber of Secrets"}, "Percy_Weasley": {"name": "Percy Weasley", "series": "harry potter", "big_five": [-0.46, 0.03, 0.68, -0.06, 0.36], "url": "https://harrypotter.fandom.com/wiki/Percy_Weasley", "description": "Percy Ignatius Weasley (b. 22 August, 1976) was an English pure-blood wizard, the third child of Arthur and Molly Weasley (née Prewett). He was the younger brother of Bill and Charlie and the older brother of Ron, Ginny, George, and the late Fred Weasley. He attended Hogwarts School of Witchcraft and Wizardry from 1987-1994, and was both a prefect and Head Boy. ", "quote": ["Course, he's very ambitious, Percy, he's got it all planned out... he wants to be Minister for Magic...", "―Percy's long-term goal"], "movie": "Harry Potter and the Chamber of Secrets"}, "Fawkes": {"name": "Fawkes", "series": "harry potter", "big_five": [0.74, 0.62, 0.66, -0.69, 0.59], "url": "https://harrypotter.fandom.com/wiki/Fawkes", "description": "Fawkes was a highly intelligent male phoenix and Albus Dumbledore's animal companion and defender. It is unknown how long Fawkes had been in Dumbledore's service. He had been Dumbledore's loyal champion for many years prior to the Headmaster's death.", "quote": ["About time, too. He's been looking dreadful for days; I've been telling him to get a move on.", "―After Fawkes burst into flames"], "movie": "Harry Potter and the Chamber of Secrets"}, "Filius_Flitwick": {"name": "Filius Flitwick", "series": "harry potter", "big_five": [0.19, 0.35, -0.1, 0.35, 0.41], "url": "https://harrypotter.fandom.com/wiki/Filius_Flitwick", "description": "Professor Filius Flitwick (b. 17 October 1958 or earlier) was a part-goblin wizard who attended Hogwarts School of Witchcraft and Wizardry and was sorted into Ravenclaw House, being an intelligent young man and a model student. Some time after his graduation, Flitwick returned to Hogwarts and became the Charms Master, as well as the Head of Ravenclaw House.", "quote": ["Speaking of eccentrics, you'll like our Head of house, Professor Filius Flitwick. People often underestimate him, because he's really tiny (we think he's part elf, but we've never been rude enough to ask) and he's got a squeaky voice, but he's the best and most knowledgeable Charms master alive in the world today. His office door is always open to any Ravenclaw with a problem, and if you're in a real state he'll get out these delicious little cupcakes he keeps in a tin in his desk drawer and make them do a little dance for you. In fact, it's worth pretending you're in a real state just to see them jive.", "―Description of Professor Flitwick"], "movie": "Pottermore"}, "Bellatrix_Lestrange": {"name": "Bellatrix Lestrange", "series": "harry potter", "big_five": [-0.83, -0.06, 0.37, -0.29, -0.11], "url": "https://harrypotter.fandom.com/wiki/Bellatrix_Lestrange", "description": "Bellatrix Lestrange (née Black) (1951 – 2 May, 1998) was an English pure-blood Dark witch, the eldest daughter of Cygnus and Druella Black (née Rosier) and elder sister of Andromeda Tonks and Narcissa Malfoy. She was a member of the House of Black, an old wizarding family and one of the Sacred Twenty-Eight. Bellatrix started her education at Hogwarts School of Witchcraft and Wizardry in 1962 and was Sorted into Slytherin House.", "quote": ["Potter, you cannot win against me! I was and am the Dark Lord's most loyal servant. I learned the Dark Arts from him, and I know spells of such power that you, pathetic little boy, can never hope to compete!", "―Bellatrix regarding her own loyalty and skill"], "movie": "Harry Potter and the Order of the Phoenix"}, "Dudley_Dursley": {"name": "Dudley Dursley", "series": "harry potter", "big_five": [-0.63, 0.22, -0.48, 0.68, -0.56], "url": "https://harrypotter.fandom.com/wiki/Dudley_Dursley", "description": "Dudley Dursley (born c. 23 June, 1980) was the Muggle son of Vernon and Petunia Dursley and cousin of Harry Potter. He was obese and insolent as a result of his parents spoiling him throughout his childhood, although he became muscular in his teens. He and his gang often tormented Harry, taking after the example set by his parents, as well as other weaker and younger children in their neighbourhood and at school.", "quote": ["I don't think you're a waste of space.", "―Dudley's farewell to his cousin Harry Potter"], "movie": "Harry Potter and the Deathly Hallows"}, "Grawp": {"name": "Grawp", "series": "harry potter", "big_five": [0.27, 0.44, -0.35, 0.26, 0.61], "url": "https://harrypotter.fandom.com/wiki/Grawp", "description": "Grawp (b. post 1931) was a giant that was known, despite standing a full sixteen feet tall, for his small stature and short height. He was the son of Fridwulfa and an unnamed giant and, therefore, the maternal half-brother of Rubeus Hagrid.", "quote": ["HERMY! WHERE HAGGER?", "―Grawp to Hermione"], "movie": "Harry Potter and the Order of the Phoenix"}, "Neville_Longbottom": {"name": "Neville Longbottom", "series": "harry potter", "big_five": [0.73, -0.85, 0.31, -0.03, -0.25], "url": "https://harrypotter.fandom.com/wiki/Neville_Longbottom", "description": "Professor Neville Longbottom (b. 30 July, 1980) was a pure-blood wizard, the only child and son of Frank and Alice Longbottom. Neville's parents were well-respected Aurors and members of the original Order of the Phoenix, until they were tortured into insanity by Bellatrix Lestrange and three other Death Eaters with the Cruciatus Curse when he was about sixteen months old. They were placed in the Janus Thickey Ward at St Mungo's Hospital for Magical Maladies and Injuries, leaving Neville to be raised by his grandmother, Augusta Longbottom. ", "quote": ["I'll join you when hell freezes over! Dumbledore's Army! ", "―Neville bravely rejects Voldemort's offer to join him"], "movie": "Harry Potter and the Deathly Hallows"}, "Parvati_Patil": {"name": "Parvati Patil", "series": "harry potter", "big_five": [0.34, 0.3, 0.24, -0.16, 0.29], "url": "https://harrypotter.fandom.com/wiki/Parvati_Patil", "description": "Parvati Patil (b. 1979/1980), was the daughter of Mr and Mrs Patil, and the identical twin sister of Padma. She was sorted into Gryffindor at Hogwarts School of Witchcraft and Wizardry, but her sister Padma was sorted into Ravenclaw. Parvati became best friends with Lavender Brown, with whom she shared many interests, such as a love for Divination. Parvati attended the Yule Ball with Harry Potter in 1994, and a year later she joined Dumbledore's Army, an organisation taught and led by Harry Potter. ", "quote": ["She says I've got all the makings of a true Seer. I saw ", "―Parvati's interest in Divination"], "movie": "Harry Potter and the Prisoner of Azkaban"}, "Hannah_Abbott": {"name": "Hannah Abbott", "series": "harry potter", "big_five": [0.22, 0.11, 0.23, 0.26, 0.26], "url": "https://harrypotter.fandom.com/wiki/Hannah_Abbott", "description": "Hannah Longbottom (née Abbott) (b. 1979/1980) was a half-blood witch and a member of the Abbott family. In 1991 she started attending Hogwarts School of Witchcraft and Wizardry and was sorted into Hufflepuff House. Hannah was in the same year as the famous Harry Potter.", "quote": ["And you definitely think Potter's the Heir of Slytherin?", "―Hannah's easily swayed opinions"], "movie": "Harry Potter and the Chamber of Secrets "}, "Sirius_Black": {"name": "Sirius Black", "series": "harry potter", "big_five": [0.14, 0.9, -0.47, 0.59, 0.6], "url": "https://harrypotter.fandom.com/wiki/Sirius_Black", "description": "Sirius Black (3 November, 1959 – 18 June, 1996), also known as Padfoot or Snuffles (in his Animagus form) was a pure-blood wizard, the older son of Orion and Walburga Black, and the brother of Regulus Black. Although he was the heir of the House of Black, Sirius disagreed with his family's belief in blood purity and defied tradition when he was Sorted into Gryffindor House instead of Slytherin at Hogwarts School of Witchcraft and Wizardry, which he attended from 1971-1978. As the rest of his family had been in Slytherin, he was the odd one out.", "quote": ["We've all got both light and dark inside us. What matters is the part we choose to act on. That's who we really are.", "―Sirius' words of advice and wisdom"], "movie": "Harry Potter and the Order of the Phoenix "}, "Dedalus_Diggle": {"name": "Dedalus Diggle", "series": "harry potter", "big_five": [0.28, 0.31, -0.26, -0.38, -0.03], "url": "https://harrypotter.fandom.com/wiki/Dedalus_Diggle", "description": "Dedalus Diggle (fl. 1964 – 1997) was a British wizard and a member of the Order of the Phoenix who fought in the First and the Second Wizarding War against Lord Voldemort and the Death Eaters. He was a member of the Advance Guard in 1995 and he fought in several battles of both wars. He also escorted the Dursleys to a safe place in 1997.", "quote": ["Shooting stars down in Kent — I’ll bet that was Dedalus Diggle. He never had much sense.", "―Dedalus's excitable personality"], "movie": "Harry Potter and the Philosopher's Stone"}, "Olympe_Maxime": {"name": "Olympe Maxime", "series": "harry potter", "big_five": [0.53, 0.53, 0.42, -0.36, -0.3], "url": "https://harrypotter.fandom.com/wiki/Olympe_Maxime", "description": "Madame Olympe Maxime was a French half-giant witch and was the headmistress of Beauxbatons Academy of Magic. Maxime's preferred mode of transportation was to travel with her students in a powder-blue carriage drawn by twelve winged Abraxan horses, which are bred at Beauxbatons Academy of Magic. Madame Maxime was a half-giantess, although she claims merely to have \"big bones.\" This was a necessity, however, as the approach to giants (or part-giants) is generally hostile in the wizarding world. ", "quote": ["I 'ave nevair been more insulted in my life! 'Alf-giant? Moi? I 'ave — I 'ave big bones!", "―Olympe Maxime to Rubeus Hagrid after he states that she is half-giant"], "movie": "Harry Potter and the Goblet of Fire"}, "Draco_Malfoy": {"name": "Draco Malfoy", "series": "harry potter", "big_five": [-0.43, 0.35, 0.16, 0.28, 0.15], "url": "https://harrypotter.fandom.com/wiki/Draco_Malfoy", "description": "Draco Lucius Malfoy (b. 5 June, 1980) was a pure-blood wizard and the only son of Lucius and Narcissa Malfoy (née Black). The son of a Death Eater, Draco was raised to strongly believe in the importance of blood purity. He attended Hogwarts School of Witchcraft and Wizardry from 1991-1998 and was sorted into Slytherin House. During his years at Hogwarts, he became friends with Vincent Crabbe, Gregory Goyle, Pansy Parkinson, and other fellow Slytherins, but he quickly developed a rivalry with Harry Potter.", "quote": ["I really don't think they should let the other sort in, do you? They're just not the same, they've never been brought up to know our ways. Some of them have never even heard of Hogwarts until they get the letter, I imagine. I think they should keep it in the old wizarding families.", "―Draco shows his prejudice at a young age"], "movie": "Harry Potter and the Philosopher's Stone"}, "Antioch_Peverell": {"name": "Antioch Peverell", "series": "harry potter", "big_five": [-0.35, 0.3, -0.24, 0.13, -0.04], "url": "https://harrypotter.fandom.com/wiki/Antioch_Peverell", "description": "Antioch Peverell (fl. 1214) was a pure-blood wizard, the eldest of the Peverell brothers. Antioch, like his brothers, was skilled in the magical arts, but personally was described as being a \"combative man\". Antioch and his brothers were the inspiration for the The Tale of the Three Brothers and thus the original masters of the Deathly Hallows. Antioch was said to have possessed the Elder Wand, though the exact circumstances of this are unknown.", "quote": ["So the oldest brother, who was a combative man, asked for a wand more powerful than any in existence: a wand that must always win duels for its owner, a wand worthy of a wizard who had conquered Death!", "―The Tale of the Three Brothers by Beedle the Bard"], "movie": "The Tales of Beedle the Bard"}, "Regulus_Black": {"name": "Regulus Black", "series": "harry potter", "big_five": [-0.61, 0.17, 0.3, 0.24, -0.28], "url": "https://harrypotter.fandom.com/wiki/Regulus_Black", "description": "Regulus Arcturus Black (1961 – 1979) was a pure-blood wizard, born to Orion and Walburga Black, and the younger brother of Sirius Black. He was a member of the House of Black, an old wizarding family, which probably started around the Middle Ages.He attended Hogwarts School of Witchcraft and Wizardry in 1972 and was sorted into the Slytherin house. Regulus became a Death Eater in his youth, but defected when he found what Lord Voldemort would do in order to reach his aims. Regulus also learned about one of Voldemort's Horcruxes and decided to destroy it. He was killed after acquiring Salazar Slytherin's locket in 1979.", "quote": ["I have stolen the real Horcrux and intend to destroy it as soon as I can. I face death in the hope that when you meet your match, you will be mortal once more...", "―Regulus' parting letter to Voldemort"], "movie": "Harry Potter and the Deathly Hallows"}, "Petunia_Dursley": {"name": "Petunia Dursley", "series": "harry potter", "big_five": [-0.61, -0.11, -0.31, 0.59, -0.49], "url": "https://harrypotter.fandom.com/wiki/Petunia_Dursley", "description": "Petunia Dursley (née Evans) (c. 1960 – c. 2020) was a Muggle, the elder daughter of Mr. and Mrs Evans and the sister of the Muggle-born witch Lily. During her childhood, she broke off contact with her sister and refused to have any contact with the wizarding world.", "quote": ["Mrs Dursley pretended she didn't have a sister, because her sister and her good-for-nothing husband were as unDursleyish as it was possible to be.", "―Petunia's aversion to anything magical"], "movie": "Harry Potter and the Philosopher's Stone"}, "The_Waif": {"name": "The Waif", "series": "game of thrones", "big_five": [-0.85, 0.04, 0.26, -0.85, 0.06], "url": "https://gameofthrones.fandom.com/wiki/The_Waif", "description": "The Waif was an acolyte of the Faceless Men serving in the House of Black and White in Braavos.", "quote": ["The Waif: \"You, who walk in here with a coin you never earned, whose value you do not respect. Who are you?\"\nArya Stark: \"No one.\"\nThe Waif: \"A lie. A sad, little lie. Who are you?\"", "―The Waif interrogates Arya Stark"], "movie": ""}, "Eddard_Stark": {"name": "Eddard Stark", "series": "game of thrones", "big_five": [-0.05, -0.24, 0.8, -0.36, -0.27], "url": "https://gameofthrones.fandom.com/wiki/Eddard_Stark", "description": "Lord Eddard Stark, also known as Ned Stark, was the head of House Stark, the Lord of Winterfell, Lord Paramount and Warden of the North, and later Hand of the King to King Robert I Baratheon. He was the older brother of Benjen, Lyanna and the younger brother of Brandon Stark. He is the father of Robb, Sansa, Arya, Bran, and Rickon by his wife, Catelyn Tully, and uncle of Jon Snow, who he raised as his bastard son. He was a dedicated husband and father, a loyal friend, and an honorable lord.", "quote": ["When the snows fall and the white winds blow, the lone wolf dies, but the pack survives.", "―Eddard Stark"], "movie": "The Dragon and the Wolf"}, "Petyr_Baelish": {"name": "Petyr Baelish", "series": "game of thrones", "big_five": [-0.29, 0.14, 0.28, -0.55, 0.59], "url": "https://gameofthrones.fandom.com/wiki/Petyr_Baelish", "description": "Lord Petyr Baelish, popularly called Littlefinger, was the Master of Coin on the Small Council under King Robert Baratheon and King Joffrey Baratheon. He was a skilled manipulator and used his ownership of brothels in King's Landing to both accrue intelligence on political rivals and acquire vast wealth. Baelish's spy network is eclipsed only by that of his arch-rival Varys.", "quote": ["Chaos isn’t a pit. Chaos is a ladder. Many who try to climb it fail, and never get to try again. The fall breaks them. And some are given a chance to climb, but refuse. They cling to the realm, or the gods, or love... illusions. Only the ladder is real. The climb is all there is. ", "―Petyr Baelish to Varys"], "movie": "The Climb"}, "Tywin_Lannister": {"name": "Tywin Lannister", "series": "game of thrones", "big_five": [-0.45, 0.16, 0.89, -0.63, 0.35], "url": "https://gameofthrones.fandom.com/wiki/Tywin_Lannister", "description": "Lord Tywin Lannister was the head of House Lannister, Lord of Casterly Rock, Warden of the West, Lord Paramount of the Westerlands, Hand of the King for three different kings, and Protector of the Realm. He was the father of Cersei, Jaime, and Tyrion Lannister, and sole grandfather of the incest-born Joffrey, Myrcella, and Tommen Baratheon.", "quote": ["Before long I'll be dead, and you and your brother and your sister and all of her children, all of us dead, all of us rotting in the ground. It's the family name that lives on. It's all that lives on. Not your personal glory, not your honor... but family.", "―Tywin Lannister to his eldest son, Jaime"], "movie": "You Win or You Die"}, "Joffrey_Baratheon": {"name": "Joffrey Baratheon", "series": "game of thrones", "big_five": [-0.72, 0.29, -0.53, 0.6, -0.39], "url": "https://gameofthrones.fandom.com/wiki/Joffrey_Baratheon", "description": "King Joffrey I Baratheon was the eighteenth king to rule from the Iron Throne. He was formally styled as Joffrey of Houses Baratheon and Lannister, the First of His Name, King of the Andals and the First Men, Lord of the Seven Kingdoms, and Protector of the Realm. Though believed by most to be the eldest son of King Robert Baratheon and Queen Cersei Lannister, Joffrey is actually a bastard born from Cersei's incestuous relationship with her twin brother, Ser Jaime Lannister of the Kingsguard. He is the older brother of Myrcella and Tommen Baratheon, both of whom share the same parentage. Joffrey's actions during his rule sparked the War of the Five Kings and ended when he was poisoned at his own wedding feast by Olenna Tyrell and Petyr Baelish.", "quote": ["Everyone is mine to torment!", "―Joffrey Baratheon"], "movie": "Mhysa"}, "Euron_Greyjoy": {"name": "Euron Greyjoy", "series": "game of thrones", "big_five": [-0.85, 0.35, -0.43, 0.04, 0.25], "url": "https://gameofthrones.fandom.com/wiki/Euron_Greyjoy", "description": "King Euron Greyjoy is the brother of Balon Greyjoy, the Lord Reaper of Pyke and later King of the Iron Islands, and Aeron Greyjoy, a Drowned Man. He is also the uncle to Balon's children, Rodrik, Maron, Yara, and Theon Greyjoy. After murdering his brother Balon, Euron takes control of the Salt Throne with the support of many ironborn and seeks to hunt down Yara and Theon, who oppose Euron and have allied with Daenerys Targaryen.", "quote": ["I don't mock the Drowned God - I am the Drowned God. From Oldtown to Qarth, when men see my sails, they pray.", "―Euron Greyjoy to Balon Greyjoy"], "movie": "Home"}, "Rhaegar_Targaryen": {"name": "Rhaegar Targaryen", "series": "game of thrones", "big_five": [0.3, -0.02, -0.06, -0.26, 0.64], "url": "https://gameofthrones.fandom.com/wiki/Rhaegar_Targaryen", "description": "Prince Rhaegar Targaryen, the last Prince of Dragonstone, was the eldest son and heir to King Aerys II Targaryen, the Mad King. He was the older brother of Viserys and Daenerys Targaryen and the husband of Elia Martell, with whom he had two children: Rhaenys and Aegon Targaryen.", "quote": ["Rhaegar fought valiantly, Rhaegar fought nobly. And Rhaegar died.", "―Jorah Mormont"], "movie": "Walk of Punishment"}, "Renly_Baratheon": {"name": "Renly Baratheon", "series": "game of thrones", "big_five": [0.54, 0.62, -0.13, -0.21, 0.25], "url": "https://gameofthrones.fandom.com/wiki/Renly_Baratheon", "description": "King Renly Baratheon was the youngest of three brothers and thus fourth in line to inherit the throne after Joffrey, Tommen, and Stannis. He was granted the title of Lord Paramount of the Stormlands by his brother Robert, whose small council he also served on as Master of Laws, but abandoned the latter position when laying claim to the Iron Throne, styling himself as Renly of the House Baratheon, First of His Name, King of the Andals and the First Men, Lord of the Seven Kingdoms, and Protector of the Realm. Margaery Tyrell became Renly's queen when she married him in an alliance; however, it was her brother Loras whom he truly loved. During talks of an alliance with the Starks, his reign abruptly ended when a Shadow with the face of Stannis Baratheon killed Renly inside his tent. This led most of his bannermen from the Stormlands and some of the Reach to submit to his older brother Stannis as their new king.", "quote": ["He inspires no love or loyalty. He's not a king. I am.", "―Renly Baratheon declares he would be a better king than his brother, Stannis."], "movie": ""}, "Qyburn": {"name": "Qyburn", "series": "game of thrones", "big_five": [-0.34, -0.23, 0.36, -0.08, 0.57], "url": "https://gameofthrones.fandom.com/wiki/Qyburn", "description": "Qyburn is an unethical former maester who was thrown out of the order for conducting illegal human experimentation. After coming into Cersei Lannister's service, he becomes Varys's replacement as Master of Whisperers on the small council. Following the destruction of the Great Sept of Baelor, Qyburn becomes Hand of the Queen to Cersei I, the new Queen of the Andals and the First Men.", "quote": ["Jaime: \"You're no maester. Where's your chain?\"\nQyburn: \"The Citadel stripped me of it. They found some of my... experiments... too bold.\"", "―Jaime Lannister and Qyburn"], "movie": ""}, "Tormund": {"name": "Tormund", "series": "game of thrones", "big_five": [0.09, 0.46, -0.16, -0.16, -0.07], "url": "https://gameofthrones.fandom.com/wiki/Tormund", "description": "Tormund, often called Tormund Giantsbane, is a renowned warrior and raider among the Free Folk and one of the key leaders behind Mance Rayder. Tormund respected Mance as the King-Beyond-the-Wall and suspected he was the man to lead them through the Long Night. As time passes and Mance is killed on the orders of Stannis Baratheon, he believes the prophesied warrior is his enemy-turned-friend Jon Snow.", "quote": ["Plenty of little men tried to put their swords through my heart. And there's plenty of little skeletons buried in the woods.", "―Tormund to Jon Snow"], "movie": "Valar Dohaeris"}, "Lord_Varys": {"name": "Lord Varys", "series": "game of thrones", "big_five": [-0.6, -0.42, 0.35, -0.53, 0.5], "url": "https://gameofthrones.fandom.com/wiki/Lord_Varys", "description": "Varys, sometimes called the Spider, is a eunuch and was the Master of Whisperers on the King's Small Council until he is forced to flee King's Landing with Tyrion Lannister. He is a skilled manipulator and commands a network of informants across two continents.  ", "quote": ["Storms come and go, the big fish eat the little fish, and I keep on paddling.", "―Varys"], "movie": "The Night Lands"}, "Jon_Snow": {"name": "Jon Snow", "series": "game of thrones", "big_five": [0.14, -0.57, 0.72, 0.24, 0.22], "url": "https://gameofthrones.fandom.com/wiki/Jon_Snow", "description": "Jon Snow, born Aegon Targaryen, is the son of Lyanna Stark and Rhaegar Targaryen, the late Prince of Dragonstone. From infancy, Jon is presented as the bastard son of Lord Eddard Stark, Lyanna's brother, and raised by Eddard alongside his lawful children at Winterfell but his true parentage is kept secret from everyone, including Jon himself. In order to escape his bastard status, Jon joins the Night's Watch and is eventually chosen as Lord Commander. However, he is later murdered in a mutiny and resurrected by the Red Priestess Melisandre. Freed from his Night's Watch vows, Jon joins his cousin, Sansa Stark, in building an army and together they retake Winterfell from House Bolton, restoring House Stark's dominion over the North with Jon being declared the new King in the North. However, after successfully capturing a wight and presenting it to the Lannisters as proof that the Army of the Dead is real, Jon pledges himself and his army to Daenerys Targaryen, Rhaegar's sister, and steps down as King in the North.", "quote": ["Bran Stark: \"And Jon's real name...\"\nLyanna Stark: \"His name is Aegon Targaryen. You have to protect him. Promise me, Ned.\"\nBran Stark: \"He's never been a bastard. He's the heir to the Iron Throne.\"", "―Bran and Lyanna Stark"], "movie": ""}, "Olenna_Tyrell": {"name": "Olenna Tyrell", "series": "game of thrones", "big_five": [0.01, 0.32, 0.62, -0.21, 0.87], "url": "https://gameofthrones.fandom.com/wiki/Olenna_Tyrell", "description": "Lady Olenna Tyrell, née Redwyne, was the elderly matriarch of House Tyrell. Lady Olenna had been a mistress of court politics, plotting and intrigue par excellence throughout her life. She was also known for her wit and sarcasm. As a result, Lady Olenna was popularly nicknamed the Queen of Thorns, in reference to the Tyrell sigil - a rose - and her cutting, barbed comments. In many ways she was the de facto head of House Tyrell at the time of the War of the Five Kings and appeared to hold a great deal of influence over the Reach.", "quote": ["I did unspeakable things to protect my family. Or watched them being done on my orders. I never lost a night's sleep over them. They were necessary. And whatever I imagined necessary for the safety of House Tyrell, I did.", "―Olenna Tyrell to Jaime Lannister"], "movie": "The Queen's Justice"}, "Catelyn_Stark": {"name": "Catelyn Stark", "series": "game of thrones", "big_five": [0.34, 0.14, 0.48, 0.24, -0.03], "url": "https://gameofthrones.fandom.com/wiki/Catelyn_Stark", "description": "Catelyn Stark, née Tully, was born into House Tully as the daughter of Hoster Tully, the Lord Paramount of the Trident, and sister of Lysa and Edmure Tully. She married into House Stark through her marriage to Eddard Stark, though she was originally intended for Brandon Stark. Together, she and Eddard had five children: Robb, Sansa, Arya, Bran, and Rickon. Catelyn was a devoted mother and was fiercely protective of her children.", "quote": ["Show them how it feels to lose what they love.", "―Catelyn Stark to her eldest son, Robb Stark"], "movie": "The Rains of Castamere "}, "Jaime_Lannister": {"name": "Jaime Lannister", "series": "game of thrones", "big_five": [0.02, 0.43, 0.15, 0.02, 0.24], "url": "https://gameofthrones.fandom.com/wiki/Jaime_Lannister", "description": "Ser Jaime Lannister is the eldest son of Tywin, younger twin brother of Cersei, and older brother of Tyrion Lannister. He was involved in an incestuous relationship with Cersei, and unknown to most, he is the biological father of her three children, Joffrey, Myrcella, and Tommen.", "quote": ["There are no men like me. Only me.", "―Jaime Lannister to Catelyn Stark"], "movie": "Fire and Blood"}, "Alliser_Thorne": {"name": "Alliser Thorne", "series": "game of thrones", "big_five": [-0.69, -0.28, 0.27, 0.09, -0.52], "url": "https://gameofthrones.fandom.com/wiki/Alliser_Thorne", "description": "Ser Alliser Thorne was the Master-at-Arms at Castle Black and is responsible for training new recruits to the Night's Watch.", "quote": ["Do you know what leadership means, Lord Snow? It means that the person in charge gets second guessed by every clever little twat with a mouth. But if he starts second guessing himself, that’s the end. For him, for the clever little twats, for everyone. This is not the end. Not for us. Not if you lot do your duty for however long it takes to beat them back. And then you get to go on hating me, and I get to go on wishing your wildling whore had finished the job.", "―Ser Alliser Thorne to Jon Snow"], "movie": "The Watchers on the Wall"}, "Maester_Luwin": {"name": "Maester Luwin", "series": "game of thrones", "big_five": [0.69, -0.48, 0.87, -0.53, 0.35], "url": "https://gameofthrones.fandom.com/wiki/Maester_Luwin", "description": "Luwin was the Maester of Winterfell and a loyal servant to House Stark. He acted as a surrogate parent to Bran Stark and Rickon Stark in the absence of their family.", "quote": ["I pulled you into the world. Both of you. I've seen both your faces almost every day since, and for that I consider myself very, very lucky.", "―Maester Luwin to Bran and Rickon Stark"], "movie": ""}, "Meryn_Trant": {"name": "Meryn Trant", "series": "game of thrones", "big_five": [-0.82, -0.19, -0.09, 0.06, -0.27], "url": "https://gameofthrones.fandom.com/wiki/Meryn_Trant", "description": "Ser Meryn Trant is a member of House Trant, a vassal house to House Baratheon. He becomes a knight of the Kingsguard of Robert Baratheon after Robert's Rebellion. He is a successful tourney knight, though Sandor Clegane is scornful of Trant's skills, remarking that \"any boy whore with a sword could beat three Meryn Trants.\"", "quote": ["Meryn: \"You're an up-jumped cutthroat, nothing more.\"\nBronn: \"That's exactly who I am. And you're a grub in fancy armor who's better at beating little girls than fighting men.\"", "―Meryn and Bronn discuss their statuses"], "movie": ""}, "Bran_Stark": {"name": "Bran Stark", "series": "game of thrones", "big_five": [0.15, -0.27, 0.0, -0.58, 0.94], "url": "https://gameofthrones.fandom.com/wiki/Bran_Stark", "description": "Brandon Stark, commonly called Bran, is the fourth child and second son of Eddard and Catelyn Stark. Bran is a warg and a greenseer serving as the new Three-Eyed Raven, using his supernatural gifts in the war against the Night King and the White Walkers.", "quote": ["I need to learn to see better. When the Long Night comes again...I need to be ready.", "―Bran Stark"], "movie": "The Queen's Justice"}, "Shae": {"name": "Shae", "series": "game of thrones", "big_five": [0.38, 0.64, -0.18, 0.37, -0.2], "url": "https://gameofthrones.fandom.com/wiki/Shae", "description": "Shae was a prostitute who had begun an exclusive relationship with Tyrion Lannister during the time when he was fighting in the Lannister army as part of the Vanguard during the Battle of the Green Fork. When he is sent to King's Landing to be acting Hand of the King, he takes Shae with him as his mistress in defiance of his father's orders, and she lives with him at the Tower of the Hand. The only person who knows she is there is Varys the Master of Whisperers, who while not completely trusted, was an advisor to Tyrion and did keep their secret.", "quote": ["Tyrion Lannister: \"You can't fuck your way out of everything.\"\nShae: \"I have so far.\"", "―Tyrion Lannister and Shae, before the Battle of Blackwater Bay"], "movie": ""}, "Bronn": {"name": "Bronn", "series": "game of thrones", "big_five": [0.17, 0.52, -0.44, 0.32, 0.29], "url": "https://gameofthrones.fandom.com/wiki/Bronn", "description": "Ser Bronn of the Blackwater is a skilled and dangerous sellsword who comes to prominence when he champions for Tyrion Lannister in his trial by combat at the Eyrie. Bronn subsequently enters Tyrion's service as his personal bodyguard, assassin, and enforcer and in return was given knighthood, power, and wealth.", "quote": ["Lysa Arryn: \"You don't fight with honor!\"\nBronn: \"No... he did.\"", "―Lysa Arryn and Bronn, indicating Ser Vardis Egen, whom he'd just killed in single combat."], "movie": ""}, "Lancel_Lannister": {"name": "Lancel Lannister", "series": "game of thrones", "big_five": [0.05, -0.06, -0.19, 0.48, -0.19], "url": "https://gameofthrones.fandom.com/wiki/Lancel_Lannister", "description": "Lancel Lannister was the eldest son of Kevan Lannister and a nephew of Tywin Lannister. He served as a squire for King Robert Baratheon until Robert's death. Soon afterwards, he was elevated to knighthood but sustained an arrow wound during the Battle of the Blackwater that required a prolonged convalescence. During his recovery, he embraced religion and joined the movement known as the Sparrows and abandoned his family name, after which he was simply known as Brother Lancel.", "quote": ["I'm a different person now. I've found peace in the light of the Seven. You can, too. They watch over all of us, ready to dole out mercy or justice. Their world is at hand.", "―Lancel to his cousin Cersei Lannister."], "movie": "The Wars to Come"}, "Janos_Slynt": {"name": "Janos Slynt", "series": "game of thrones", "big_five": [-0.49, -0.38, -0.28, -0.04, -0.21], "url": "https://gameofthrones.fandom.com/wiki/Janos_Slynt", "description": "Lord Janos Slynt was the commander of the City Watch in King's Landing and founder of House Slynt.", "quote": ["Janos Slynt: \"Are you drunk?! I'll not have my honor questioned by an imp!\"\nTyrion Lannister: \"I'm not questioning your honor, Lord Janos. I'm denying its existence.\"", "―Tyrion Lannister to Janos Slynt"], "movie": ""}, "Ellaria_Sand": {"name": "Ellaria Sand", "series": "game of thrones", "big_five": [-0.03, 0.81, -0.03, 0.62, 0.26], "url": "https://gameofthrones.fandom.com/wiki/Ellaria_Sand", "description": "Ellaria Sand was the paramour of Prince Oberyn Martell of Dorne and a bastard of House Uller, carrying the bastard surname \"Sand\" like all bastards in Dorne.", "quote": ["Cersei Lannister: \"Can't say I've ever met a Sand before.\"\nEllaria Sand: \"We are everywhere in Dorne. I have ten thousand brothers and sisters.\"", "―Ellaria spars with Queen Cersei."], "movie": ""}, "Hodor": {"name": "Hodor", "series": "game of thrones", "big_five": [0.38, -0.77, 0.32, -0.34, -0.29], "url": "https://gameofthrones.fandom.com/wiki/Hodor", "description": "Hodor, originally named Wylis, was a simpleminded servant of House Stark at Winterfell working in the stables.", "quote": ["Hodor.", "―Hodor"], "movie": "A Man Without Honor"}, "Tyrion_Lannister": {"name": "Tyrion Lannister", "series": "game of thrones", "big_five": [0.21, 0.24, 0.65, -0.38, 0.77], "url": "https://gameofthrones.fandom.com/wiki/Tyrion_Lannister", "description": "Lord Tyrion Lannister is the youngest child of Lord Tywin Lannister and younger brother of Cersei and Jaime Lannister. A dwarf, he uses his wit and intellect to overcome the prejudice he faces.", "quote": ["Tyrion Lannister: \"I'm guilty of a far more monstrous crime: I'm guilty of being a dwarf!\"\nTywin Lannister: \"You are not on trial for being a dwarf.\"\nTyrion Lannister: \"Oh, yes I am! I've been on trial for that my entire life!\"", "―Tyrion at his trial, falsely accused of killing his nephew King Joffrey."], "movie": ""}, "Kevan_Lannister": {"name": "Kevan Lannister", "series": "game of thrones", "big_five": [-0.17, -0.08, 0.27, -0.19, 0.01], "url": "https://gameofthrones.fandom.com/wiki/Kevan_Lannister", "description": "Ser Kevan Lannister was the younger brother of Lord Tywin Lannister and one of his most loyal and trusted officers in the Lannister armies during the War of the Five Kings.", "quote": ["I do not recognize your authority to dictate what is and is not my concern. You are the Queen Mother. Nothing more!", "―Kevan to his niece, Cersei"], "movie": "The House of Black and White"}, "Edmure_Tully": {"name": "Edmure Tully", "series": "game of thrones", "big_five": [0.18, 0.28, -0.14, 0.25, -0.18], "url": "https://gameofthrones.fandom.com/wiki/Edmure_Tully", "description": "Lord Edmure Tully is the former Lord of Riverrun and Lord Paramount of the Trident, and is the son and heir of the late Lord Hoster Tully of Riverrun. He is the younger brother of Catelyn and Lysa, nephew of Brynden Tully, and maternal uncle of Robb Stark, Sansa Stark, Arya Stark, Bran Stark, Rickon Stark, and Robin Arryn. He fought for his nephew, King Robb Stark, during the War of the Five Kings.", "quote": ["Tell me, I want to know. I truly do. How do you live with yourself? All of us have to believe that we're decent, don't we? You have to sleep at night. How do you tell yourself that you're decent after everything that you've done?", "―Edmure to Jaime Lannister"], "movie": "No One"}, "Samwell_Tarly": {"name": "Samwell Tarly", "series": "game of thrones", "big_five": [0.47, -0.52, 0.69, -0.25, 0.79], "url": "https://gameofthrones.fandom.com/wiki/Samwell_Tarly", "description": "Samwell Tarly, or simply Sam, is a steward in the Night's Watch and Jon Snow's closest friend. He is the eldest son of Lord Randyll Tarly and Lady Melessa Tarly of Horn Hill and older brother of Dickon and Talla Tarly. He was forced to join the Night's Watch by his father under the threat of death, putting him out of the line of inheritance for House Tarly. Though he is overweight and neither the bravest nor the most skilled of warriors, he is intelligent, well-educated, and insightful, his vast knowledge serving the Night's Watch well in their battles with the forces beyond the Wall.", "quote": ["I saw it with my own eyes on our way down to Castle Black. He drove a dagger into the walker’s heart. He risked his own life to save mine more than once. He’s a greater warrior than either of you will ever be.", "―Gilly to Randyll Tarly and Dickon Tarly"], "movie": "Blood of My Blood"}, "Stannis_Baratheon": {"name": "Stannis Baratheon", "series": "game of thrones", "big_five": [-0.65, -0.22, 0.62, -0.28, -0.36], "url": "https://gameofthrones.fandom.com/wiki/Stannis_Baratheon", "description": "King Stannis Baratheon was the Lord of Dragonstone, the younger brother of King Robert Baratheon, and older brother of Renly Baratheon.", "quote": ["The Iron Throne is mine by right. All those that deny that are my foes.", "―Stannis Baratheon to his brother Renly"], "movie": "Garden of Bones"}, "Robb_Stark": {"name": "Robb Stark", "series": "game of thrones", "big_five": [0.34, 0.66, 0.31, 0.18, 0.37], "url": "https://gameofthrones.fandom.com/wiki/Robb_Stark", "description": "King Robb Stark was the eldest son of Lord Eddard Stark of Winterfell and his wife, Lady Catelyn. He was the older brother of Sansa, Arya, Bran, and Rickon Stark, and cousin (believed to be half-brother) of Jon Snow. He also adopted a direwolf, whom he named Grey Wind. Robb was declared King in the North, the first since his ancestor Torrhen Stark bent the knee three centuries before, during the War of the Five Kings after the execution of his father by King Joffrey Baratheon.", "quote": ["All men should keep their word, kings most of all.", "―Robb Stark"], "movie": "The Rains of Castamere "}, "Viserys_Targaryen": {"name": "Viserys Targaryen", "series": "game of thrones", "big_five": [-0.41, 0.37, -0.51, 0.55, -0.55], "url": "https://gameofthrones.fandom.com/wiki/Viserys_Targaryen", "description": "King Viserys Targaryen was the younger brother of the late Rhaegar Targaryen and the older brother of Daenerys Targaryen. Viserys and Daenerys are the remnants of the exiled House Targaryen following Robert's Rebellion against their father Aerys II Targaryen, the Mad King. He claimed the Iron Throne as King Viserys III after his father was overthrown and killed in Robert's Rebellion but never sat on the Iron Throne before being killed by Khal Drogo.", "quote": ["I want us both to go home, but they took it from us. So tell me, sweet sister, how do we go home? ...We go home with an army.", "―Viserys to his sister, Daenerys"], "movie": "Winter is Coming"}, "Tommen_Baratheon": {"name": "Tommen Baratheon", "series": "game of thrones", "big_five": [0.74, 0.34, 0.16, -0.03, -0.21], "url": "https://gameofthrones.fandom.com/wiki/Tommen_Baratheon", "description": "King Tommen I Baratheon was the younger brother of King Joffrey and Princess Myrcella. Though legally the son of the late King Robert Baratheon and Queen Cersei Lannister, his true father is Ser Jaime Lannister, the Queen's twin brother, and is thus a bastard born of incest. His sole biological grandparents, Tywin and Joanna Lannister, were also first cousins.", "quote": ["Wisdom. Wisdom is what makes a good king.", "―Tommen to his grandfather, Tywin Lannister"], "movie": "Breaker of Chains"}, "Lyanna_Mormont": {"name": "Lyanna Mormont", "series": "game of thrones", "big_five": [-0.26, -0.21, 0.86, -0.21, 0.51], "url": "https://gameofthrones.fandom.com/wiki/Lyanna_Mormont", "description": "Lady Lyanna Mormont is the young Lady of Bear Island and thus the head of House Mormont of Bear Island ever since the death of her mother, Maege Mormont. She is the niece of Lord Commander Jeor Mormont of the Night's Watch and the first cousin of Ser Jorah Mormont. She pledges House Mormont's forces to House Stark upon meeting Jon Snow, Sansa Stark, and Davos Seaworth, making her house one of the few loyalists to fight for the Starks against House Bolton at the Battle of the Bastards. Afterwards, she is the first to declare Jon Snow the King in the North during a gathering of the Northern lords at Winterfell.", "quote": ["Lyanna Mormont: \"We are not a large house, but we are a proud one, and every man from Bear Island fights with the strength of ten mainlanders.\"\nDavos Seaworth: \"If they're half as ferocious as their lady, the Boltons are doomed.\"", "―Lyanna Mormont impresses Davos Seaworth."], "movie": ""}, "Daenerys_Targaryen": {"name": "Daenerys Targaryen", "series": "game of thrones", "big_five": [0.16, 0.32, 0.43, -0.25, 0.52], "url": "https://gameofthrones.fandom.com/wiki/Daenerys_Targaryen", "description": "Queen Daenerys Targaryen, also known as Dany and Daenerys Stormborn, is the younger sister of Rhaegar Targaryen and Viserys Targaryen and only daughter of King Aerys II Targaryen and Queen Rhaella Targaryen, who were both ousted from the Iron Throne during Robert Baratheon's rebellion.", "quote": ["I spent my life in foreign lands. So many men have tried to kill me, I don't remember all their names. I have been sold like a broodmare. I've been chained and betrayed, raped and defiled. Do you know what kept me standing through all those years in exile? Faith. Not in any gods. Not in myths and legends. In myself. In Daenerys Targaryen. The world hadn't seen a dragon in centuries until my children were born. The Dothraki hadn't crossed the sea. Any sea. They did for me. I was born to rule the Seven Kingdoms, and I will.", "―Daenerys Targaryen to Jon Snow"], "movie": "The Queen's Justice"}, "Cersei_Lannister": {"name": "Cersei Lannister", "series": "game of thrones", "big_five": [-0.36, 0.35, 0.33, 0.45, -0.17], "url": "https://gameofthrones.fandom.com/wiki/Cersei_Lannister", "description": "Queen Cersei I Lannister is the widow of King Robert Baratheon, with whom she had her sole trueborn child, and Queen of the Seven Kingdoms. She is the daughter of Lord Tywin Lannister, twin sister of Jaime Lannister and elder sister of Tyrion Lannister. She had an incestuous relationship with Jaime, who is secretly the father of her three bastard children, Joffrey, Myrcella and Tommen.", "quote": ["When you play the game of thrones, you win or you die. There is no middle ground.", "―Cersei Lannister to Eddard Stark"], "movie": "You Win or You Die"}, "Rast": {"name": "Rast", "series": "game of thrones", "big_five": [-0.67, 0.0, -0.23, 0.35, -0.35], "url": "https://gameofthrones.fandom.com/wiki/Rast", "description": "Rast was a ranger in the Night's Watch, and takes part in the Great Ranging beyond the Wall. Though he is disliked for bullying and his past as a raper, he is generally treated patiently by Jon Snow, Grenn, Pyp and Eddison Tollett, until he betrays the Night's Watch in the Mutiny at Craster's Keep. Instead of helping defend Craster's Keep with the rest of the Mutineers, Rast instead flees the ongoing battle, allowing his former brothers to be massacred by the Night's Watch before being mauled to death by Ghost, the same animal he tormented.", "quote": ["Run fast, Piggy! And sleep well! I'll be cutting your throat one of these nights!", "―Rast to Samwell Tarly"], "movie": "And Now His Watch is Ended"}, "Lyanna_Stark": {"name": "Lyanna Stark", "series": "game of thrones", "big_five": [0.23, 0.18, -0.18, 0.28, 0.33], "url": "https://gameofthrones.fandom.com/wiki/Lyanna_Stark", "description": "Princess Lyanna Stark was the daughter of Lord Rickard Stark and sister of Brandon, Eddard, and Benjen Stark. She went on to be the wife of Rhaegar Targaryen, the Prince of Dragonstone, and mother to his son.", "quote": ["His name is Aegon Targaryen. If Robert finds out, he'll kill him. You know he will. You have to protect him. Promise me, Ned. Promise me.", "―Lyanna's final wish for her son, Jon Snow, to her brother Ned."], "movie": "The Winds of Winter"}, "Barristan_Selmy": {"name": "Barristan Selmy", "series": "game of thrones", "big_five": [0.06, 0.08, 0.69, -0.64, 0.22], "url": "https://gameofthrones.fandom.com/wiki/Barristan_Selmy", "description": "Ser Barristan Selmy was a knight who served in the Kingsguard with distinction for almost forty years. Nicknamed Barristan the Bold, he was considered by many to be one of the best swordsmen and most honorable men in all the Seven Kingdoms.", "quote": ["I've burned away my years fighting for terrible kings...a man of honor keeps his vows - even if he's serving a drunk or a lunatic. Just once in my life, before it's over, I want to know what it's like to serve with pride, to fight for someone I believe in.", "―Barristan Selmy to Jorah Mormont"], "movie": "Kissed by Fire"}, "Davos_Seaworth": {"name": "Davos Seaworth", "series": "game of thrones", "big_five": [0.28, 0.33, 0.76, -0.38, 0.04], "url": "https://gameofthrones.fandom.com/wiki/Davos_Seaworth", "description": "Ser Davos Seaworth, also known as the Onion Knight, is a landed knight, and a former smuggler who was in the service of Stannis Baratheon, Lord of Dragonstone and claimant to the Iron Throne, whom he served as Hand of the King.", "quote": ["If we don't put aside our enmities and band together, we will die. And then it doesn't matter whose skeleton sits on the Iron Throne.", "―Davos Seaworth on the Great War"], "movie": "The Queen's Justice"}, "Margaery_Tyrell": {"name": "Margaery Tyrell", "series": "game of thrones", "big_five": [0.67, 0.92, 0.36, -0.35, 0.55], "url": "https://gameofthrones.fandom.com/wiki/Margaery_Tyrell", "description": "Queen Margaery Tyrell was the only daughter of Lord Mace Tyrell and Lady Alerie Tyrell, granddaughter of Lady Olenna Tyrell and sister of Ser Loras Tyrell. Margaery became Queen Consort through her marriage to King Joffrey Baratheon, and later his younger brother, King Tommen Baratheon, following Joffrey's death. However, her desire to become Queen ultimately proved to be her downfall as she was eventually killed along with her brother and father when the Great Sept of Baelor was destroyed with wildfire as orchestrated by Cersei Lannister to reclaim her lost power.", "quote": ["Petyr Baelish: \"Do you want to be a Queen?\"\nMargaery Tyrell: \"No. I want to be the Queen.\"", "―Petyr Baelish and Margaery Tyrell"], "movie": ""}, "Gendry": {"name": "Gendry", "series": "game of thrones", "big_five": [0.26, 0.48, 0.48, -0.08, 0.14], "url": "https://gameofthrones.fandom.com/wiki/Gendry", "description": "Gendry is a skilled blacksmith and an unacknowledged bastard son of King Robert Baratheon. After escaping the massacre of Robert's other bastards in King's Landing, Gendry is slated to join the Night's Watch before being captured and traded multiple times- first to Tywin Lannister at Harrenhal, then to the Brotherhood Without Banners, and finally to Stannis Baratheon on Dragonstone. After escaping from Dragonstone with the help of Ser Davos Seaworth, Gendry returns to King's Landing and remains in hiding until Davos returns for him. He later accompanies Jon Snow north of the Wall on a mission to capture a wight to use as a bargaining chip at the Parley in King's Landing.", "quote": ["Davos: \"Don't be a fool. You're not a soldier.\"\nGendry: \"No, but I'm a fighter.\"", "―Davos Seaworth and Gendry"], "movie": ""}, "Maester_Aemon": {"name": "Maester Aemon", "series": "game of thrones", "big_five": [0.89, 0.22, 0.88, -0.33, 0.94], "url": "https://gameofthrones.fandom.com/wiki/Maester_Aemon", "description": "Aemon was the maester at Castle Black and one of Lord Commander Jeor Mormont's closest advisors in the Night's Watch.", "quote": ["Jon Snow: \"You're Aemon Targaryen?\"\nAemon: \"I am a maester of the Citadel, bound in service to Castle Black and the Night's Watch. I will not tell you to stay or go. You must make that choice yourself, and live with it for the rest of your days — as I have.\"", "―Aemon reveals his true identity to Jon Snow."], "movie": ""}, "Arya_Stark": {"name": "Arya Stark", "series": "game of thrones", "big_five": [0.04, -0.34, 0.16, -0.22, 0.72], "url": "https://gameofthrones.fandom.com/wiki/Arya_Stark", "description": "Arya Stark is the third child and second daughter of Lord Eddard Stark and his wife, Lady Catelyn Stark. After narrowly escaping the persecution of House Stark by House Lannister, Arya is trained as a Faceless Man at the House of Black and White in Braavos, and uses her new skills to bring those who have wronged her family to justice.", "quote": ["A girl is Arya Stark of Winterfell, and I'm going home.", "―Arya Stark re-asserts her identity to Jaqen H'ghar"], "movie": "No One"}, "Theon_Greyjoy": {"name": "Theon Greyjoy", "series": "game of thrones", "big_five": [0.17, -0.04, 0.18, 0.58, -0.18], "url": "https://gameofthrones.fandom.com/wiki/Theon_Greyjoy", "description": "Prince Theon Greyjoy is the only living son and heir of Lord Balon Greyjoy of the Iron Islands, and younger brother of Yara Greyjoy.", "quote": ["I always wanted to do the right thing. Be the right kind of person. But I never knew what that meant. It always seemed that there was an impossible choice I had to make. Stark or Greyjoy.", "―Theon Greyjoy to Jon Snow"], "movie": "The Dragon and the Wolf"}, "Sansa_Stark": {"name": "Sansa Stark", "series": "game of thrones", "big_five": [0.59, -0.06, 0.49, -0.16, 0.04], "url": "https://gameofthrones.fandom.com/wiki/Sansa_Stark", "description": "Lady Sansa Stark is the eldest daughter of Lord Eddard Stark of Winterfell and his wife Lady Catelyn, sister of Robb, Arya, Bran, and Rickon Stark, and \"half-sister\" of Jon Snow. Sansa becomes well versed in politics and court intrigue under the tutelage of Cersei Lannister and Petyr Baelish, suffering but learning from her traumatic experiences as a hostage of House Lannister in King's Landing and House Bolton at Winterfell. Alongside Jon Snow, Sansa takes back Winterfell from House Bolton at the Battle of the Bastards, becoming the new Lady of Winterfell.", "quote": ["I did what I had to do to survive, my lady. But I am a Stark, I will always be a Stark.", "―Sansa to Lyanna Mormont."], "movie": "The Broken Man"}, "Yara_Greyjoy": {"name": "Yara Greyjoy", "series": "game of thrones", "big_five": [-0.09, 0.5, 0.28, -0.03, 0.39], "url": "https://gameofthrones.fandom.com/wiki/Yara_Greyjoy", "description": "Queen Yara Greyjoy is the daughter of Balon Greyjoy and older sister and only surviving sibling of Theon Greyjoy. She was raised at Pyke, the stronghold of House Greyjoy. Yara is a fierce warrior and commands her own longship, the Black Wind.", "quote": ["And she is your rightful ruler. Those of you that have sailed under her, and there are many of you here, you know what she is! She is a reaver! She is a warrior! She is Ironborn! We will find no better leader! This is our queen!", "―Theon Greyjoy declaring Yara as the rightful Queen of the Iron Islands."], "movie": "The Door"}, "Roose_Bolton": {"name": "Roose Bolton", "series": "game of thrones", "big_five": [-0.63, -0.11, 0.65, -0.18, 0.53], "url": "https://gameofthrones.fandom.com/wiki/Roose_Bolton", "description": "Lord Roose Bolton was the Lord of the Dreadfort and the head of House Bolton, the former ruling Great House of the North after usurping the position from House Stark. He was the father of Ramsay Bolton – his legitimized bastard – and an unnamed newborn baby from his wife, Walda Frey.", "quote": ["In my family we say, 'A naked man has few secrets, a flayed man, none.'", "―Roose Bolton"], "movie": "Garden of Bones"}, "Sandor_Clegane": {"name": "Sandor Clegane", "series": "game of thrones", "big_five": [-0.46, -0.39, 0.37, 0.59, -0.28], "url": "https://gameofthrones.fandom.com/wiki/Sandor_Clegane", "description": "Sandor Clegane, nicknamed the Hound, is the younger brother of Ser Gregor Clegane and was the personal bodyguard of Prince Joffrey Baratheon. When Joffrey ascended the Iron Throne as King Joffrey I, Sandor was named into his Kingsguard despite not being a knight himself, but deserted from his post at the Battle of the Blackwater. After traveling as a fugitive with Arya Stark and having a close brush with death, he reluctantly travels with the Brotherhood Without Banners in hope of having a greater purpose. Upon the discovery of the return of the White Walkers and the army of the dead, Sandor now fights alongside the armies of Jon Snow and Daenerys Targaryen in order to prevent another Long Night.", "quote": ["You didn't know me back in my time. You don't know the things I've done.", "―Sandor Clegane to Ray"], "movie": "The Broken Man"}, "Loras_Tyrell": {"name": "Loras Tyrell", "series": "game of thrones", "big_five": [0.54, 0.82, -0.02, 0.27, 0.1], "url": "https://gameofthrones.fandom.com/wiki/Loras_Tyrell", "description": "Ser Loras Tyrell was a popular tourney knight and was regarded as one of the most skilled knights in Westeros. He was the heir to Highgarden, as well as being the younger brother of Margaery Tyrell, who would later become Queen of the Seven Kingdoms. He also had a long-term romantic relationship with Renly Baratheon and was devastated when Renly was murdered; following this, Loras fought at Blackwater to avenge his death, and helped to win the battle to save King's Landing. Afterwards he stayed in the city to support his sister in the new alliance between the Tyrells and House Lannister. However, following the Faith Militant's subsequent takeover in the capital, he was arrested and sent to prison. Informed that his only hope of getting out was to confess and give up his inheritance, he abdicated his titles and became known as Brother Loras. However, he died only a few minutes later along with his father and sister when the Great Sept of Baelor was destroyed in a plot orchestrated by Cersei Lannister.", "quote": ["Where is it written that power is the sole province of the worst? That thrones are only made for the hated and the feared? You would be a wonderful king.", "―Loras Tyrell to Renly Baratheon"], "movie": "The Wolf and the Lion"}, "Ramsay_Bolton": {"name": "Ramsay Bolton", "series": "game of thrones", "big_five": [-0.93, 0.01, 0.16, -0.34, 0.59], "url": "https://gameofthrones.fandom.com/wiki/Ramsay_Bolton", "description": "Lord Ramsay Bolton, born Ramsay Snow, was the legitimized bastard son of Roose Bolton, Lord of the Dreadfort, and the unidentified wife of a miller.", "quote": ["If you think this has a happy ending, you haven't been paying attention.", "―Ramsay to Theon Greyjoy"], "movie": "The Climb"}, "Brienne_of_Tarth": {"name": "Brienne of Tarth", "series": "game of thrones", "big_five": [0.25, -0.47, 0.69, -0.29, -0.12], "url": "https://gameofthrones.fandom.com/wiki/Brienne_of_Tarth", "description": "Brienne Tarth, commonly known as Brienne of Tarth, is a warrior of House Tarth, and the only daughter of Lord Selwyn Tarth.", "quote": ["All my life men like you've sneered at me, and all my life I've been knocking men like you into the dust.", "―Brienne to Jaime Lannister"], "movie": "The Prince of Winterfell"}, "Melisandre": {"name": "Melisandre", "series": "game of thrones", "big_five": [-0.15, 0.02, 0.29, -0.27, 0.39], "url": "https://gameofthrones.fandom.com/wiki/Melisandre", "description": "Melisandre, often referred to as the Red Woman, is a Red Priestess in the religion of R'hllor, the Lord of Light, and a close counselor to Stannis Baratheon in his campaign to take the Iron Throne. After Stannis Baratheon's death at the Battle of Winterfell, she revives Jon Snow after he is murdered by various members of the Night's Watch, believing him to be The Prince That Was Promised, and serves Jon as an adviser until she is banished from the North after the Battle of the Bastards when Jon learns that she sacrificed Shireen Baratheon and countless innocent people while in Stannis's service. However, she later unites the newly crowned King in the North with Daenerys Targaryen, believing they both have an important part to play in the Great War.", "quote": ["The night is dark and full of terrors, old man, but the fire burns them all away.", "―Melisandre to Cressen"], "movie": "The North Remembers"}, "Jorah_Mormont": {"name": "Jorah Mormont", "series": "game of thrones", "big_five": [0.22, -0.37, 0.37, -0.2, -0.14], "url": "https://gameofthrones.fandom.com/wiki/Jorah_Mormont", "description": "Ser Jorah Mormont is a formerly exiled Northern lord from Westeros previously living in Essos. He has sworn fealty to his fellow exile Daenerys Targaryen and was the first to help her adapt to life as a khaleesi of the Dothraki.", "quote": ["There is a beast in every man, and it stirs when you put a sword in his hand.", "―Jorah Mormont"], "movie": "Walk of Punishment"}, "Myrcella_Baratheon": {"name": "Myrcella Baratheon", "series": "game of thrones", "big_five": [0.73, 0.51, 0.17, 0.06, 0.17], "url": "https://gameofthrones.fandom.com/wiki/Myrcella_Baratheon", "description": "Princess Myrcella Baratheon was commonly thought to be the only daughter of King Robert Baratheon and Queen Cersei Lannister. However, like her brothers, her real father is Jaime Lannister, making her a bastard born out of incest.", "quote": ["Myrcella's a sweet, innocent girl and I don't blame her at all for you.", "―Tyrion to Myrcella's mother, Cersei Lannister"], "movie": "The Ghost of Harrenhal"}, "Robert_Baratheon": {"name": "Robert Baratheon", "series": "game of thrones", "big_five": [-0.14, 0.42, -0.41, 0.42, -0.12], "url": "https://gameofthrones.fandom.com/wiki/Robert_Baratheon", "description": "King Robert I Baratheon was the seventeenth ruler of the Seven Kingdoms, formally styled as Robert of the House Baratheon, the First of His Name, King of the Andals and the First Men, Lord of the Seven Kingdoms, and Protector of the Realm.", "quote": ["I'm not trying to honor you. I'm trying to get you to run my kingdom while I eat, drink, and whore my way to an early grave.", "―Robert Baratheon to Eddard Stark"], "movie": "Winter is Coming"}, "Iron_Man": {"name": "Iron Man", "series": "marvel cinematic universe", "big_five": [-0.18, 0.51, 0.47, -0.63, 0.52], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Iron_Man", "description": "Anthony Edward \"Tony\" Stark is a billionaire industrialist, inventor, a founding member of the Avengers, and the former CEO of Stark Industries, a company originally started by his father, Howard Stark. Stark was self-described as a genius, billionaire, playboy and philanthropist. With his great wealth and exceptional technical knowledge, Stark was one of the world's most powerful men, and enjoyed the playboy lifestyle for many years until he was kidnapped by the Ten Rings in Afghanistan. With his life on the line, Stark created an armored suit which he used to escape his captors, returning home and becoming the armored superhero known as Iron Man, battling against terrorists as well as his former business partner Obadiah Stane. Stark enjoyed the fame that came with his new secret identity and decided to share it with the world, publicly announcing himself as Iron Man.", "quote": ["\"My armor was never a distraction or a hobby. It was a cocoon. And now I'm a changed man. You can take away my house, all my tricks and toys. But one thing you can't take away... I am Iron Man.\"", "―Tony Stark"], "movie": "Iron Man 3"}, "Karen_Page": {"name": "Karen Page", "series": "marvel cinematic universe", "big_five": [-0.07, 0.08, 0.38, -0.5, 0.43], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Karen_Page", "description": "Karen Page is the former office manager for Nelson and Murdock and, along with Foggy Nelson, Matt Murdock and Ben Urich, was instrumental in the effort to bring Wilson Fisk to justice. While working for Nelson and Murdock, Page came into contact with Frank Castle, who she helped defend in court. When Nelson and Murdock fell apart, Page joined the New York Bulletin with the intention of writing Castle's true story, however during her investigation she was kidnapped by Ray Schoonover and saved by Castle. Later the Hand also kidnapped Page and she was rescued by Daredevil before Murdock revealed to her that he was Daredevil.", "quote": ["\"A hero is not a god or an idea. A hero lives here on the street. Among us. With us. Always here but rarely recognized. Look in the mirror and see yourself for what you truly are. You're a New Yorker. You're a hero. This is your Hell's Kitchen. Welcome home.\"", "―Karen Page"], "movie": "A Cold Day in Hell's Kitchen"}, "Thaddeus_Ross": {"name": "Thaddeus Ross", "series": "marvel cinematic universe", "big_five": [-0.55, -0.11, 0.17, -0.47, -0.25], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Thaddeus_Ross", "description": "Thaddeus E. \"Thunderbolt\" Ross is a former Lieutenant General of the United States Army. During his career, he was put in charge of the military project called the Bio-Tech Force Enhancement Project, aiming to recreate the Super Soldier Serum. However, the experiment led to an accident which transformed the scientist Bruce Banner into Hulk. After a long hunt, Banner was captured, only for Ross' subordinate officer Emil Blonsky to transform into the monstrous Abomination which forced Ross to accept Hulk as an ally and allow him to escape after the battle in Harlem.", "quote": ["\"Tell me, Captain, do you know where Thor and Banner are right now? If I misplaced a couple of thirty megaton nukes, you can bet there'd be consequences. Compromise. Reassurance. That's how the world works.\"", "―Thaddeus Ross to Captain America"], "movie": ""}, "Groot": {"name": "Groot", "series": "marvel cinematic universe", "big_five": [0.22, 0.02, 0.0, 0.0, 0.19], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Groot", "description": "Groot was a sentient, tree-like individual and the accomplice of Rocket Raccoon. Together, the pair had traveled the galaxy picking up bounties until they met Star-Lord and Gamora just before the four of them were captured and put into the Kyln, where they also met Drax the Destroyer. There, they agreed to work together to escape and sell the Orb for a massive profit. However, when it was discovered that the Orb contained one of the Infinity Stones which was being sought out by Ronan the Accuser, Groot convinced his friends to risk everything to stop Ronan's diabolical plans. During the Final Battle, Groot sacrificed his own life to save his new friends. However, part of his destroyed body was planted by Rocket to birth a new Groot, as they joined the Guardians of the Galaxy.", "quote": ["\"I am Groot!\"", "―Groot"], "movie": "Guardians of the Galaxy "}, "Ultron": {"name": "Ultron", "series": "marvel cinematic universe", "big_five": [-0.6, -0.38, 0.77, -0.52, 0.11], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Ultron", "description": "Ultron was an artificial intelligence peacekeeping program created by Tony Stark from the decrypted code derived from the Mind Stone encased within Loki's own Scepter, retooled by himself with the help of Bruce Banner with the intent being to protect Earth from any and all domestic and extraterrestrial threats coming within the future. Possessing multiple of host bodies under his control as well as a variant of Stark's own personality, Ultron however had soon deemed humanity itself as the greatest threat to peace on the Earth and attempted to create his technological singularity by committing genocide against them, leaving only his own doubles left in his wake.", "quote": ["\"Do you see the beauty of it? The inevitability? You rise, only to fall. You Avengers, you are my meteor. My swift and terrible sword, and the Earth will crack with the weight of your failure. Purge me from your computers, turn my own flesh against me; it means nothing. When the dust settles, the only thing living in this world... will be metal.\"", "―Ultron"], "movie": "Avengers: Age of Ultron"}, "Obadiah_Stane": {"name": "Obadiah Stane", "series": "marvel cinematic universe", "big_five": [-0.84, 0.23, 0.2, 0.12, -0.02], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Obadiah_Stane", "description": "Obadiah Stane was the business partner of Tony Stark and a good friend of his father, Howard Stark. After Howard Stark's death, Stane became interim CEO of Stark Industries until Tony Stark took over officially shortly after. Stane's jealousy of the younger Stark led him to join forces with the Ten Rings to organize a failed attempt to assassinate him so Stane could become CEO once again. When this failed Stane created the Iron Monger Armor and attempted to kill Stark himself, leading to his own death.", "quote": ["\"Gentlemen, what is at stake here? I want you to think about this. Civilization has been preserved because the right people have had the right idea at the right time! This technology, it comes along once in a generation, and it's a gift that has been put in our hands. And why is that? It's because we have a vision, a vision for the future of this company, of this nation, of the world order! Because, make no mistake, this tool that you are creating in the wrong hands would end civilization as we know it.\"", "―Obadiah Stane"], "movie": "Iron Man "}, "Loki": {"name": "Loki", "series": "marvel cinematic universe", "big_five": [-0.36, 0.46, 0.23, 0.08, -0.21], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Loki", "description": "Loki Laufeyson was the biological son of King Laufey, the ruler of the Frost Giants in Jotunheim. Shortly after his birth, Loki was then abandoned and left to die. Found by the Asgardian King Odin, he was taken to Asgard and raised by Odin and his wife Frigga as an Asgardian prince, along with their true biological son Thor. When he grew up, he became known as the \"God of Mischief\". When Thor was to be crowned King, Loki had sabotaged the coronation by letting the Frost Giants attack Asgard, thus leading Thor to seek vengeance on Jotunheim, which resulted in Thor's banishment to Earth and Loki finding out the truth about his heritage. Frigga gave Loki the throne when Odin had fallen into the Odinsleep, however when the Warriors Three and Sif attempted to return Thor home, Loki was forced to try to stop them. Regardless, Thor returned from his exile on Earth and ended Loki's reign. With Odin disapproving of his actions, Loki allowed himself to fall through the deep abyss of space, entering a wormhole created by the sudden termination of the Bifrost Bridge.", "quote": ["\"I, Loki, Prince of Asgard, Odinson, the rightful King of Jotunheim, God of Mischief, do hereby pledge to you, my undying fidelity.\"", "―Loki to Thanos"], "movie": "Avengers: Infinity War"}, "Black_Widow": {"name": "Black Widow", "series": "marvel cinematic universe", "big_five": [-0.08, 0.36, 0.46, -0.2, 0.56], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Black_Widow", "description": "Natalia Alianovna \"Natasha\" Romanoff, also known as Black Widow, is one of the most talented spies and assassins in the entire world and a founding member of the Avengers. Originally an agent of the Soviet agency for foreign intelligence, the KGB, she later became a member of S.H.I.E.L.D., the international counter-intelligence agency. Having extensive mastery in martial arts and armed with her Widow's Bite, Black Widow became one of S.H.I.E.L.D.'s most efficient agents. During one mission, she was sent undercover into Stark Industries to watch Tony Stark due to fears that he was dying. During this mission, Romanoff had assisted Stark with defeating Ivan Vanko's terrorist plots against him.", "quote": ["\"I had this dream. The kind that seems normal at the time, but when you wake...\"\"What did you dream?\"\"That I was an Avenger. That I was anything more than the assassin they made me.\"", "―Natasha Romanoff and Bruce Banner"], "movie": "Avengers: Age of Ultron"}, "Valkyrie": {"name": "Valkyrie", "series": "marvel cinematic universe", "big_five": [0.2, 0.58, -0.15, -0.16, 0.52], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Valkyrie", "description": "Brunnhilde is an Asgardian Valkyrie who was part of an elite group of warriors called the Valkyrie. She resided on Sakaar as a bounty hunter named Scrapper 142 after her defeat at the hands of Hela. Years into her self-imposed exile, Valkyrie found the Asgardian prince Thor and sold him to the Grandmaster, only to grow towards him when he told her of Hela's new invasion of Asgard. Joining the Revengers, Valkyrie escaped from Sakaar and assisted Thor to defeat Hela, witnessing the destruction of Asgard as a result before she then joined all of the remaining survivors traveling towards Earth, only for the Statesman to be attacked by the Black Order. She was one of the few survivors from Thanos's attack, helping lead the remaining Asgardians to safety before the Mad Titan destroyed the ship and killed the remaining forces, and ultimately survived the Decimation.", "quote": ["\"I've spent years, in a haze, trying to forget my past. Sakaar seemed like the best place to drink, and to forget, and to die. One day.\"\"Well, I was thinking that you drink too much and it was probably gonna kill you.\"\"I don't plan to stop drinking. But... I don't wanna forget. I can't turn away anymore. So... if I'm gonna die, well... it might as well be driving my sword through the heart of that murderous hag.\"", "―Valkyrie and Thor"], "movie": ""}, "Black_Panther": {"name": "Black Panther", "series": "marvel cinematic universe", "big_five": [0.38, -0.12, 0.64, -0.03, 0.06], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Black_Panther", "description": "T'Challa was the King of the African nation of Wakanda, and the son of T'Chaka and Ramonda. As the Wakandan monarch, he was also the former holder of the Black Panther mantle. After his father was killed in a bombing attack orchestrated by Helmut Zemo, the new monarch set out to kill the Winter Soldier, who was widely believed to be responsible for the attack. After being drawn into the Avengers Civil War and siding with Iron Man, T'Challa learned the truth about Zemo's deception and decided to help the Winter Soldier by granting him asylum in Wakanda and helping him get a cure for his HYDRA mental programming. ", "quote": ["\"My name is King T'Challa, son of King T'Chaka. I am the sovereign ruler of the nation of Wakanda. And for the first time in our history, we will be sharing our knowledge and resources with the outside world. Wakanda will no longer watch from the shadows. We cannot. We must not. We will work to be an example of how we, as brothers and sisters on this Earth, should treat each other. Now, more than ever, the illusions of division threaten out very existence. We all know the truth. More connects us than separates us. But in times of crisis, the wise build bridges while the foolish build barriers. We must find a way to look after one another as if we were one single tribe.\"", "―T'Challa"], "movie": "Black Panther "}, "Daredevil": {"name": "Daredevil", "series": "marvel cinematic universe", "big_five": [-0.12, -0.6, 0.55, 0.0, 0.36], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Daredevil", "description": "Matthew Michael \"Matt\" Murdock is a man who had been blinded as a young boy by a radioactive substance that fell into his eyes from a crashed vehicle, and even though he lost his sight, his other four remaining senses were heightened to superhuman levels. After his father was killed by mobsters, Murdock was trained by Stick to become a warrior, using his disability as an advantage to fight for the Chaste. However Murdock's compassion with Elektra led him to be rejected by Stick, as he then returned to Columbia University with Foggy Nelson to gain his law degree and dedicated his life to fight injustice where he could find it in New York City as a lawyer by day with his law firm Nelson and Murdock, and by night as a vigilante known as Daredevil. Murdock's actions as a crime fighter had eventually put him into conflict with a crime lord named Wilson Fisk. Murdock used his skills to expose Fisk's criminal activities and then have him taken to prison.", "quote": ["\"I'm Daredevil. Not even God can stop that now.\"", "―Matt Murdock"], "movie": "Please"}, "Nick_Fury": {"name": "Nick Fury", "series": "marvel cinematic universe", "big_five": [0.12, 0.71, 0.74, -0.5, 0.74], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Nick_Fury", "description": "Nicholas \"Nick\" Joseph Fury was a former Colonel who had served with the United States Army and an espionage veteran of the CIA during the Cold War. Continuing to serve the world, Fury joined S.H.I.E.L.D., a covert international peacekeeping organization which operates as humanity's first line of defense against Earth's most dangerous enemies. The great scope of enemies widened as Fury met Kree warrior Vers. Fury helped her uncover her human heritage as Carol Danvers, as the two fought off the Kree Starforce, which was led by Yon-Rogg, as they targeted refugee Skrull families. Fury took a liking to Mar-Vell's pet Flerken, Goose, who proceeded to scratch him and permanently blinded his left eye. Fury has kept the reason for this injury his secret while Captain Marvel had left the Earth.", "quote": ["\"I'm trading in my bird's eye view for two solid feet on the ground. This is the last time you'll be seeing me for a stretch.\"\"You're going to disappear. Nowhere to be found.\"\"Nowhere? You know me better than that, Phil. I'll be everywhere.\"", "―Nick Fury and Phil Coulson"], "movie": "Beginning of the End"}, "Vision": {"name": "Vision", "series": "marvel cinematic universe", "big_five": [0.12, -0.17, 0.78, -0.86, 0.83], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Vision", "description": "Vision was an android who possessed a synthetic vibranium body created by Ultron and Helen Cho, along with the powerful space gem known as the Mind Stone. Originally conceived as the perfect form for Ultron, the body was stolen by the Avengers, after which it was repurposed by Tony Stark and Bruce Banner, who uploaded the remnants of Stark's personal A.I. J.A.R.V.I.S. into it. Upon his birth, Vision declared he was a mixture of Ultron and J.A.R.V.I.S., one that would fight to protect humanity at all costs. Vision then joined the Avengers in the Battle of Sokovia, using his powers to prevent Ultron from transferring his consciousness into the internet and allowing the Avengers to successfully put an end to him.", "quote": ["\"I don't know what this is. Not really. I know it's not of this world, that it powered Loki's staff, gave you your abilities. But its true nature is a mystery and yet it is part of me.\"\"Are you afraid of it?\"\"I wish to understand it. The more I do, the less it controls me. One day, who knows? I may even control it.\"", "―Vision and Scarlet Witch"], "movie": "Captain America: Civil War"}, "Hela": {"name": "Hela", "series": "marvel cinematic universe", "big_five": [-0.57, 0.17, 0.12, 0.04, 0.04], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Hela", "description": "Hela Odinsdottir was the Asgardian Goddess of Death and the former Executioner of Asgard. Imprisoned in Hel for millennia by her father Odin, Hela was released from her prison following his death and went to restore her power over Asgard, while simultaneously engaging in a series of encounters with her younger brothers Thor and Loki. Gaining power from Asgard, Hela planned to rule Asgard and create an Asgardian Empire. When the people of Asgard refused to bow to her, Hela set about massacring Odin's armies and enslaving the people, while recruiting Skurge to be her own Executioner in the process. Eventually however, Thor returned with the newly formed Revengers and then reengaged Hela, which had resulted in Loki unleashing Surtur, who then destroyed Asgard by finally causing Ragnarök and killed Hela as a result. ", "quote": ["\"We were once the seat of absolute power in the cosmos. Our supremacy was unchallenged. Yet Odin stopped at Nine Realms. Our destiny is to rule over all others. And I am here to restore that power. Kneel before me and rise into the ranks of my great conquest!\"", "―Hela"], "movie": ""}, "Howard_Stark": {"name": "Howard Stark", "series": "marvel cinematic universe", "big_five": [-0.05, 0.18, 0.68, -0.56, 0.63], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Howard_Stark", "description": "Howard Anthony Walter Stark was an inventor, scientist, engineer, businessman and movie director. The founder of Stark Industries, Stark worked on various government projects during World War II, including the Manhattan Project and Project Rebirth, the latter of which resulted in using the Super Soldier Serum to create Captain America. Presenting the superhero with his vibranium shield, Stark aided Captain America and the Strategic Scientific Reserve in their fight against HYDRA.", "quote": ["\"You're too young to understand this right now, so I thought I would put it on film for you. I built this for you, and some day you'll realize that it represents a whole lot more than just people's inventions. It represents my life's work. This is the key to the future. I'm limited by the technology of my time, but one day you'll figure this out. And when you do, you will change the world. What is, and always will be my greatest creation... is you.\"", "―Howard Stark"], "movie": "Iron Man 2"}, "Arnim_Zola": {"name": "Arnim Zola", "series": "marvel cinematic universe", "big_five": [-0.88, -0.21, 0.09, 0.25, 0.59], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Arnim_Zola", "description": "Doctor Arnim Zola was a Swiss scientist working for HYDRA before, during, and after World War II. Originally an employee of the Nazi Sturmabteilung, in 1934 he was recruited by Johann Schmidt to become a lead scientist for Schmidt's HYDRA organization. During the war, he designed many advanced weapons to aid HYDRA in its quest for world domination. Despite being captured by the Allies shortly before Schmidt's defeat in 1945, he was offered a position in S.H.I.E.L.D., the newly formed peacekeeping organization, and he used that opportunity to secretly rebuild HYDRA.", "quote": ["\"I am not a recording, fräulein. I may not be the man I was when the Captain took me prisoner in 1945, but I am.\"", "―Arnim Zola to Black Widow"], "movie": "Captain America: The Winter Soldier"}, "Spider-Man": {"name": "Spider-Man", "series": "marvel cinematic universe", "big_five": [0.57, 0.83, 0.2, 0.13, 0.43], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Spider-Man", "description": "Peter Benjamin Parker was a high school student who, upon gaining spider-like abilities, had then fought crime across New York City as his alter ego of Spider-Man, hoping to live up to his heroes in the Avengers. While Parker juggled all his continued superhero duties with the demands of his high-school life, he was approached by Tony Stark who recruited Spider-Man to join the Avengers Civil War, putting Spider-Man into the brief conflict with his personal hero, Captain America. Parker agreed and was given a new suit as well as brand new Stark technology in exchange for his help, although Stark still did not make him an official member of the Avengers and had returned Parker back home to continue his own hero work.", "quote": ["\"You can't be a friendly neighborhood Spider-Man if there's no neighborhood.\"", "―Spider-Man"], "movie": "Avengers: Infinity War"}, "Nebula": {"name": "Nebula", "series": "marvel cinematic universe", "big_five": [-0.24, -0.18, 0.15, 0.24, -0.26], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Nebula", "description": "Nebula is a Luphomoid assassin, an adopted daughter of the intergalactic warlord Thanos and adopted sister of Gamora. As the right-hand woman of Ronan the Accuser during his and Thanos' quest to retrieve the Orb, she helped him fight the Guardians of the Galaxy during the Battle of Xandar. Fleeting the battle after a fight with Gamora, Nebula was soon captured by the Sovereign and handed back to the Guardians. She escaped and helped Taserface lead the other Ravagers in a mutiny against their former leader Yondu Udonta before leaving to find and kill Gamora. After forgiving and helping her sister alongside the Guardians during the Battle on Ego's Planet, she left in a ship to pursue a revenge mission against Thanos.", "quote": ["\"Nebula... I was a child like you. I was concerned with staying alive until the next day, every day. And I never considered what Thanos was doing to you. I'm trying to make it right. There are little girls like you across the universe who are in danger. You can stay with us and help them.\"\"I will help them by killing Thanos.\"", "―Gamora and Nebula"], "movie": "Guardians of the Galaxy Vol. 2"}, "Pepper_Potts": {"name": "Pepper Potts", "series": "marvel cinematic universe", "big_five": [0.34, 0.44, 0.62, -0.44, 0.45], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Pepper_Potts", "description": "Virginia \"Pepper\" Potts is the Chief Executive Officer of Stark Industries. Originally working as Tony Stark's personal assistant, she would take care of his schedule and perform any task he wished. During this time, she became good friends with Stark; however, both she and Stark had begun developing romantic feelings for each other. Neither was able to act on these feelings, as they each feared that the other would not accept them.", "quote": ["\"I am trying to do the job that you were meant to do.\"", "―Pepper Potts to Tony Stark"], "movie": "Iron Man 2"}, "Malekith": {"name": "Malekith", "series": "marvel cinematic universe", "big_five": [-0.87, 0.53, 0.06, -0.41, -0.34], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Malekith", "description": "Malekith (Mälekith in Shiväisith) was the utterly cruel and malevolent leader of the Dark Elves, a race of beings said to be older than the universe itself. Born in a realm of complete darkness, Malekith had led his people in a War against the Asgardians, using an ancient weapon known as the Aether, but they were thought to have been destroyed thousands of years ago during a final battle against the Asgardian King Bor. Malekith had survived, however, and after going into hiding for thousands of years, he returned during the Convergence and sought to retake the Aether and use its power to transform the universe by plunging it back into eternal darkness. Before his attempt could succeed, however, Malekith and his armies were finally defeated by Bor's grandson, Thor, in the Battle of Greenwich, resulting in the eventual death of Malekith.", "quote": ["\"You needn't have come so far, Asgardian, death would have come to you soon enough.\"\"Not by your hand!\"\"Your universe was never meant to be. Your world and your family will be extinguished!\"", "―Malekith and Thor"], "movie": "Thor: The Dark World"}, "Hawkeye": {"name": "Hawkeye", "series": "marvel cinematic universe", "big_five": [0.11, 0.13, 0.45, -0.29, 0.31], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Hawkeye", "description": "Clinton Francis \"Clint\" Barton, better known as Hawkeye, is a skilled marksman, a former special agent of S.H.I.E.L.D. and one of the founding members of the Avengers. Known for his use of the bow and arrow as his primary weapon, Barton had become one of the best agents of S.H.I.E.L.D., responsible for the recruitment of Black Widow, whom he developed a strong friendship with. Assigned by Nick Fury into watching over the Tesseract, he was brainwashed by Loki and used as a pawn for all his evil schemes. However, following their Attack on the Helicarrier, he was freed from Loki's mental control by Black Widow and joined the Avengers to fight against Loki's Chitauri army in the Battle of New York, ending Loki's Invasion before Hawkeye returned to his work as an agent of S.H.I.E.L.D..", "quote": ["\"Just can't seem to miss.\"", "―Hawkeye"], "movie": "Captain America: Civil War"}, "Scarlet_Witch": {"name": "Scarlet Witch", "series": "marvel cinematic universe", "big_five": [0.27, 0.4, 0.25, -0.15, 0.67], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Scarlet_Witch", "description": "Wanda Maximoff was a native of the Eastern European country of Sokovia who grew up with her twin brother, Pietro. In an effort to help purge their country of strife, the twins agreed to undergo experiments with the Scepter under the supervision of Wolfgang von Strucker's HYDRA cell, and received superpowers as a result, with Wanda attaining various abilities including telekinesis, telepathy, and energy manipulation. When HYDRA fell, the twins joined the robot Ultron to get their revenge on Tony Stark, but eventually switched sides and joined the Avengers when they discovered Ultron's true intentions. Although Pietro was killed during the ensuing Ultron Offensive, Wanda survived and became a member of the Avengers. During the Avengers Civil War, she sided with Captain America and was briefly imprisoned in the Raft before Rogers freed her along with his teammates.", "quote": ["\"I used to think of myself one way. But, after this. I am something else. And still me, I think. But... that's not what everyone else sees.\"", "―Wanda Maximoff to Vision"], "movie": "Captain America: Civil War"}, "Hulk": {"name": "Hulk", "series": "marvel cinematic universe", "big_five": [-0.34, -0.39, -0.39, 0.84, 0.74], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Hulk", "description": "Robert Bruce Banner, M.D., Ph.D., is a renowned scientist and a founding member of the Avengers. As someone who was highly respected for his work regarding biochemistry, nuclear physics, and gamma radiation, he was commissioned by Thaddeus Ross to recreate the Super Soldier Serum which created Captain America, although Ross elected not to inform Banner what he was creating. However, when an exposure to high levels of gamma radiation instead of vita radiation went awry, the mild-mannered scientist had found that when angered, provoked or excited, he would transform into the huge, rage-fueled, nearly mindless creature known as Hulk.", "quote": ["\"Hulk, we got a lot to figure out, pal.\"", "―Bruce Banner"], "movie": "Avengers: Infinity War"}, "Yondu_Udonta": {"name": "Yondu Udonta", "series": "marvel cinematic universe", "big_five": [-0.33, 0.33, -0.17, -0.09, 0.18], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Yondu_Udonta", "description": "Captain Yondu Udonta was a Centaurian, leader of an exiled faction of the Ravagers and adoptive father to Peter Quill. When Quill betrayed the Ravagers and stole the Orb for himself, Udonta led the hunt for his former ally. Eventually Udonta caught up with Quill but he was convinced to help him in the war against Ronan the Accuser, who was threatening to use the Power Stone within the Orb to destroy Xandar, with Quill ensuring Udonta did not get the Infinity Stone at the end. Despite losing the stone, Udonta chose not to get revenge against Quill, leading to mistrust among all of his own men.", "quote": ["\"I may be as pretty as an angel, but I sure as hell ain't one.\"", "―Yondu Udonta"], "movie": ""}, "Thanos": {"name": "Thanos", "series": "marvel cinematic universe", "big_five": [-0.78, 0.31, 0.92, -0.87, 0.55], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Thanos", "description": "Thanos is the genocidal warlord from Titan, whose own main objective was to bring stability to the universe, as he believed its massive population would inevitably use up the universe's entire supply of resources and condemn it. To complete this goal, Thanos set about tracking down the Infinity Stones, as the combined might could wipe out half the universe. Thanos forged alliances with Loki and Ronan the Accuser in order to track down some of the Stones, however both alliances cost Thanos much of his resources, including the Mind Stone and the loyalty of his daughters, Gamora and Nebula. Fed up with all his subordinates' continued failures, Thanos forced Eitri to create the Infinity Gauntlet for him, while Thanos then opted to seek out the location of the six Infinity Stones himself.", "quote": ["\"I know what it's like to lose. To feel so desperately that you're right... yet to fail, nonetheless. It's frightening. Turns the legs to jelly. But I ask you, to what end?  Dread it, run from it... destiny arrives all the same. And now, it's here. Or should I say... I am.\"", "―Thanos"], "movie": "Avengers: Infinity War"}, "Phil_Coulson": {"name": "Phil Coulson", "series": "marvel cinematic universe", "big_five": [0.68, 0.37, 0.68, -0.35, -0.03], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Phil_Coulson", "description": "Phillip J. \"Phil\" Coulson is a former Director of S.H.I.E.L.D., before that one of its best agents and Nick Fury's right-hand man for many important missions. He served as the primary operative in Fury's Avengers Initiative following a Skrull Invasion on Earth in the 1990s, which led to the resurfacing of Captain Marvel. Agent Coulson also ran ground interference, surveillance and tactical operations in Puente Antiguo, New Mexico as part of S.H.I.E.L.D.'s investigation surrounding the incident with Thor and the Destroyer. He was also the primary S.H.I.E.L.D. operative in the investigation into Stark Industries.", "quote": ["\"You want a symbol? You are the symbol. There's no S.H.I.E.L.D. without you. There's nothing without you.\"", "―Daisy Johnson to Phil Coulson"], "movie": "The Real Deal"}, "Falcon": {"name": "Falcon", "series": "marvel cinematic universe", "big_five": [0.59, 0.87, 0.32, -0.08, 0.5], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Falcon", "description": "Samuel Thomas \"Sam\" Wilson, better known as Falcon, was a former United States Air Force pararescue airman who left active duty when his wing-man Riley died in combat, choosing instead to begin helping any of his fellow veterans who were suffering from post-traumatic stress disorder at Veterans Affairs. During this time, Wilson met and soon became an ally of Captain America during the beginning of the HYDRA Uprising, assisting him in bringing down Alexander Pierce's schemes for Project Insight before then choosing to remain with Captain America for future missions.", "quote": ["\"I just want to make sure we considered all our options. The people that shoot at you usually wind up shooting at me.\"", "―Falcon to Captain America"], "movie": "Captain America: Civil War"}, "Hank_Pym": {"name": "Hank Pym", "series": "marvel cinematic universe", "big_five": [-0.11, 0.33, 0.69, 0.17, 0.25], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Hank_Pym", "description": "Doctor Henry Jonathan \"Hank\" Pym was an entomologist and physicist who developed the Ant-Man Suit after discovering the Pym Particles. For a time, he worked for S.H.I.E.L.D. as a consultant and became the first Ant-Man. Later he formed his own company, Pym Technologies, and passed the title of Ant-Man down to Scott Lang when his own former protégé Darren Cross replicated the Pym Particle and attempted to sell his technology, the new Yellowjacket Suit, to the notorious paramilitary terrorist organization known as HYDRA. Thanks to his recruitment of Lang to stop Cross, and Lang’s successful escape from the Quantum Realm, Pym came to terms with losing his wife Janet van Dyne to the said realm years earlier, because he thought she could be alive in there.", "quote": ["\"This is your chance. To earn that look in your daughter's eyes. To become the hero that she already thinks you are. It's not about saving our world, it's about saving theirs. Scott, I need you to be the Ant-Man.\"", "―Hank Pym to Scott Lang"], "movie": ""}, "Maria_Hill": {"name": "Maria Hill", "series": "marvel cinematic universe", "big_five": [0.5, -0.2, 0.57, -0.36, 0.16], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Maria__Hill", "description": "Maria Hill was the former Deputy Director of S.H.I.E.L.D., and also held the title of \"Commander\". She enjoyed a well-deserved reputation as tough-minded and by the book. Her clearheaded pragmatism was a valued source of reason during the critical discourse surrounding the Avengers Initiative. After Nick Fury faked his death, she worked with him and was a part of the assault team that took down the Helicarriers from Project Insight.", "quote": ["\"Most of the intelligence community would like to drop me into a dark hole, but even they can't mess with Tony's army of lawyers. So for now, we're privatizing global security.\"", "―Maria Hill"], "movie": "Nothing Personal"}, "Punisher": {"name": "Punisher", "series": "marvel cinematic universe", "big_five": [-0.52, -0.23, 0.48, 0.18, -0.17], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Punisher", "description": "Francis David \"Frank\" Castle Sr. is a violent vigilante and former member of the United States Marine Corps, who had joined Cerberus Squad while he was serving in Afghanistan. Fearing he was slowly losing his honor under the command of Agent Orange, Castle returned to his family, only to lose them all during a brutal shooting. Castle became the Punisher, as he aimed to clean up New York City of all crime by any means necessary. While seeking to avenge his own family's deaths, Castle also came in conflict with Daredevil. Castle was soon arrested and, despite the efforts of Nelson and Murdock, was sentenced to life in prison. However, Castle was freed with the help of Wilson Fisk and discovered the Blacksmith was in fact the one who was responsible for his family's murder. ", "quote": ["\"I'm not the one that dies, kid. I'm the one that does the killing. Thing is, every time I try to be someone different, that's when the wrong people get hurt.\"", "―Punisher to Amy Bendix"], "movie": ""}, "Jarvis": {"name": "Jarvis", "series": "marvel cinematic universe", "big_five": [0.32, -0.08, 0.82, -0.83, 0.94], "url": "https://marvelcinematicuniverse.fandom.com/wiki/J.A.R.V.I.S.", "description": "Just A Rather Very Intelligent System (J.A.R.V.I.S.) was originally Tony Stark's natural-language user interface computer system, named after Edwin Jarvis, the butler who worked for Howard Stark. Over time, he was upgraded into an artificially intelligent system, tasked with running business for Stark Industries as well as security for Tony Stark's Mansion and Stark Tower. After creating the Mark II armor, Stark uploaded J.A.R.V.I.S. into all of the Iron Man Armors, as well as allowing him to interact with the other Avengers, giving them valuable information during combat. During the Ultron Offensive, J.A.R.V.I.S. was destroyed by Ultron, although his remaining programming codes unknowingly continued to thwart Ultron's plans of gaining access to nuclear missiles. His remains were found by Stark, who uploaded them into a synthetic body made of vibranium and, in conjunction with Ultron's personality and an Infinity Stone, an entirely new being was made: Vision. J.A.R.V.I.S.' duties were then taken over by F.R.I.D.A.Y.", "quote": ["\"Started out, J.A.R.V.I.S. was just a natural language UI. Now he runs the Iron Legion. He runs more of the business than anyone besides Pepper.\"", "―Tony Stark to Bruce Banner"], "movie": ""}, "Peggy_Carter": {"name": "Peggy Carter", "series": "marvel cinematic universe", "big_five": [0.65, 0.18, 0.61, -0.62, 0.69], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Peggy_Carter", "description": "Margaret Elizabeth \"Peggy\" Carter was one of the most prominent agents of the Strategic Scientific Reserve during and after World War II and one of the founders of S.H.I.E.L.D.. Originally a code-breaker working at Bletchley Park, she joined the Special Operations Executive following her brother's death. Carter later joined the SSR, formed to fight HYDRA. On the mission in Germany she saved Abraham Erskine from Johann Schmidt. The success of her mission enabled the SSR to start Project Rebirth and develop their Super Soldier Serum to make the army of Super Soldiers. During the project she had befriended Steve Rogers, one of the project's candidates.", "quote": ["\"The world has changed, and none of us can go back. All we can do is our best. And sometimes... the best that we can do is to start over.\"", "―Peggy Carter to Steve Rogers"], "movie": "Captain America: The Winter Soldier"}, "Sif": {"name": "Sif", "series": "marvel cinematic universe", "big_five": [-0.17, 0.63, 0.12, 0.15, 0.37], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Sif", "description": "Lady Sif was a feared Asgardian warrior and a good friend of the Thor and the Warriors Three. When Thor almost provoked a war with the Frost Giants and ended up powerless on Earth, Sif and her friends disobeyed the orders of their new king Loki and went to Earth to save their friend. Thanks to them, Thor returned to Asgard and Loki's reign of terror ended.", "quote": ["\"It must've been hard for you, after everything she's did, to move past it, to let it go.\"\"Odin ordered her back alive. As one of his warriors, I bow to his will.\"\"Regardless of what it cost you?\"\"Much like your S.H.I.E.L.D., we are bound by our code.\"", "―Phil Coulson and Sif"], "movie": "Yes Men"}, "Quicksilver": {"name": "Quicksilver", "series": "marvel cinematic universe", "big_five": [0.63, 0.56, -0.06, 0.23, 0.29], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Quicksilver", "description": "Pietro Maximoff was a native of the Eastern European country of Sokovia who grew up with his fraternal twin sister, Wanda. The country, which was embroiled in constant war and strife, became the base of operations for a HYDRA cell operated by Wolfgang von Strucker, who recruited Pietro and Wanda to take part in a series of tests involving the Scepter, giving the twins superpowers. While his sister received a number of mental abilities, Pietro acquired the ability to move at supersonic speeds and other physical features. ", "quote": ["\"You didn't see that coming?\"", "―Pietro Maximoff to Hawkeye"], "movie": "Avengers: Age of Ultron"}, "Ulysses_Klaue": {"name": "Ulysses Klaue", "series": "marvel cinematic universe", "big_five": [-0.86, 0.39, -0.28, 0.36, -0.16], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Ulysses_Klaue", "description": "Ulysses Klaue was a black-market arms dealer, gangster, and international criminal who had worked alongside N'Jobu in order to steal a stockpile of vibranium from Wakanda in 1992. While he managed to escape with the stockpile, he received a branding on his neck from the Wakandans. During an encounter with Ultron in 2015, Klaue sold all of his vibranium to the A.I. before losing his arm during an argument. ", "quote": ["\"I stole... all of it? I took a tiny piece of it. They have a mountain full of it. They've been mining it for thousands of years and they still haven't scratched the surface. I'm the only outsider who's seen it and got out of there alive.\"", "―Ulysses Klaue and Everett Ross"], "movie": ""}, "Collector": {"name": "Collector", "series": "marvel cinematic universe", "big_five": [-0.64, -0.7, -0.29, 0.65, -0.35], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Collector", "description": "Taneleer Tivan, also known as the Collector, is the keeper of the largest collection of interstellar fauna, relics and species in the galaxy, operating from the Knowhere port installation. Through his dealings with Asgardians and the Guardians of the Galaxy, he was in possession of one of the Infinity Stones and was nearly able to obtain a second stone. However, this caused Thanos to attack his museum seeking the Aether.", "quote": ["\"I present to you, Taneleer Tivan, the Collector!\"", "―Carina"], "movie": "Guardians of the Galaxy "}, "Carol_Danvers": {"name": "Carol Danvers", "series": "marvel cinematic universe", "big_five": [0.12, 0.88, -0.21, -0.14, 0.85], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Carol_Danvers", "description": "Captain Carol Danvers, also known as Captain Marvel, is a former United States Air Force pilot who, upon being exposed to the energy of the Tesseract, obtained cosmic powers. She was made into a Kree-Human hybrid via a blood transfusion from Yon-Rogg, while having her memories removed, turning her into the Kree's weapon and a member of Starforce. During the the Kree's war with the Skrulls, Danvers returned to Earth and began recalling her past, with help from Nick Fury as well as Maria Rambeau. Danvers also discovered that Yon-Rogg had been manipulating her for years, learning from Talos that the Skrulls were merely seeking to find a new home. With this information, Danvers unlocked her true powers and defeated the Kree invasion onto Earth that was being led by Ronan the Accuser, before setting off out to the far reaches of the galaxy to finish what her late mentor Mar-Vell had once started.", "quote": ["\"I'm coming to end it. The war, the lies, all of it.\"", "―Captain Marvel to Yon-Rogg"], "movie": "Captain Marvel "}, "Kingpin": {"name": "Kingpin", "series": "marvel cinematic universe", "big_five": [-0.81, -0.24, 0.12, 0.36, 0.16], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Kingpin", "description": "Wilson Grant Fisk is a powerful businessman with interests in the future of New York City by controlling the crime waves which brought him into conflict with some of his partners who betrayed him, as well as fighting the new vigilante Daredevil. His attempt to destroy and rebuild Hell's Kitchen was ruined when his criminal activities were leaked to the FBI, leading to his arrest. Fisk's own criminal career did not end at his arrest. Within Ryker's Island, Fisk began building up a loyal band of criminals and came to run the prison. Seeking to destroy the crime competition in New York by the time he got free, Fisk assisted in the Punisher's escape, as he desired to eliminate competing criminal empires as the new Kingpin. This put Fisk in conflict with Nelson and Murdock who incarcerated him.", "quote": ["\"I've spent much of my life alone. And for many years, I pretended that this was the source of my strength. I told myself I had free will. And in that time, I achieved a great deal. But I was not fulfilled. I was longing for a connection that I could imagine but I could not achieve. Searching and not finding.\"", "―Wilson Fisk"], "movie": "Please"}, "Alexander_Pierce": {"name": "Alexander Pierce", "series": "marvel cinematic universe", "big_five": [-0.86, 0.31, 0.06, -0.25, -0.35], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Alexander_Pierce", "description": "Alexander Goodwin Pierce was one of HYDRA's leaders and its top undercover operative inside the United States Government, S.H.I.E.L.D., and the World Security Council. He commanded the HYDRA forces within S.H.I.E.L.D., working to create the Project Insight that would have given HYDRA absolute control over the world, inciting the HYDRA Uprising. His plan was stopped by Captain America, Black Widow, Falcon, Maria Hill, and Nick Fury during the Battle at the Triskelion, in which Pierce was killed by Fury.", "quote": ["\"See, I took a seat on the Council not because I wanted to, but because Nick asked me to, because we were both realists. We knew, that despite all diplomacy and the handshaking and the rhetoric, to build a better world sometimes means tearing the old one down. And that makes enemies.\"", "―Alexander Pierce to Steve Rogers"], "movie": "Captain America: The Winter Soldier"}, "Red_Skull": {"name": "Red Skull", "series": "marvel cinematic universe", "big_five": [-0.88, -0.15, 0.04, 0.11, -0.29], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Red_Skull", "description": "Johann Schmidt is the former head of HYDRA-Abteilung, a special weapons division of the Nazi Schutzstaffel and the modern-day incarnation of the ancient HYDRA society. A brilliant scientist in his own right, he fought his way through the ranks of Nazi elite to become a confidant of Adolf Hitler himself. However, his ambition to become the superior man led him to test an imperfect version of the Super Soldier Serum on himself which transformed him into the horrifying Red Skull. ", "quote": ["\"A lifetime ago, I, too, sought the stones... I even held one in my hand. But it cast me out, banished me here, guiding others to a treasure I cannot possess.\"", "―Red Skull to Thanos"], "movie": "Avengers: Infinity War"}, "Foggy_Nelson": {"name": "Foggy Nelson", "series": "marvel cinematic universe", "big_five": [0.91, 0.63, 0.63, -0.23, 0.11], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Foggy_Nelson", "description": "Franklin Percy \"Foggy\" Nelson is a lawyer and the best friend of Matt Murdock. He co-founded the law firm Nelson and Murdock with his best friend and worked on cases with a passion for getting justice for the innocent including Karen Page and Elena Cardenas. Nelson remained loyal to Murdock even after discovering that Murdock had been living a secret life as a masked vigilante known as Daredevil. However, the revelation continued to have an impact on Nelson and Murdock as Nelson became more frustrated with his friend as Murdock's double life began to interfere with their case defending Frank Castle. Eventually, Nelson decided to leave their law firm and took a job at Hogarth, Chao and Benowitz. Upon learning of Matt's survival and Wilson Fisk's release from prison, he decided to run for District Attorney to help keep Fisk behind bars.", "quote": ["\"People have bailed on Matt his whole life, and I'm not gonna be one of 'em. You do what you want, but that's not the kind of friend I wanna be.\"", "―Foggy Nelson to Karen Page"], "movie": "The Devil You Know"}, "Heimdall": {"name": "Heimdall", "series": "marvel cinematic universe", "big_five": [0.45, 0.36, 0.35, -0.65, 0.4], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Heimdall", "description": "Heimdall was the all-seeing and all-hearing Asgardian and former guard of Asgard's Bifrost Bridge. He could see and hear nearly everything that happens in the Nine Realms. Despite vowing to obey the orders of Odin, Heimdall was prepared to commit treason if it meant protecting the Realms, as he allowed the Warriors Three to return Thor from Midgard to defeat Loki. ", "quote": ["\"Be warned, I will honor my sworn oath to protect this realm as its gatekeeper.\"", "―Heimdall"], "movie": "Thor "}, "War_Machine": {"name": "War Machine", "series": "marvel cinematic universe", "big_five": [0.42, 0.24, 0.44, -0.6, 0.11], "url": "https://marvelcinematicuniverse.fandom.com/wiki/War_Machine", "description": "Colonel James Rupert \"Rhodey\" Rhodes is an officer with the United States Air Force and liaison between the military in the Department of Acquisitions and Stark Industries, where he became close friends with Tony Stark. When Stark had been kidnapped by the Ten Rings, Rhodes personally led a mission to rescue his best friend. However, upon their return, Rhodes saw Stark moving away from developing his weapons for the military and soon discovered that he was instead focusing on becoming a hero known as Iron Man. Despite all of his fears for his friend's safety, Rhodes still joined Iron Man in bringing down Obadiah Stane's schemes, while trying to keep Stark's secrets, only for Stark to reveal them to the media himself.", "quote": ["\"138 combat missions. That's how many I've flown, Tony. Every one of them could've been my last, but I flew 'em. Because the fight needed to be fought.\"", "―James Rhodes to Tony Stark"], "movie": "Captain America: Civil War"}, "Odin": {"name": "Odin", "series": "marvel cinematic universe", "big_five": [-0.15, -0.22, 0.14, -0.12, -0.28], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Odin", "description": "Odin Borson was the former King of Asgard, protector of the Nine Realms, father of Hela and Thor, the adoptive father of Loki, and husband of Frigga. During the ancient times, he was worshiped as the god of wisdom by the inhabitants of Earth. Once the greatest warrior in all the Nine Realms, over the centuries he learned how to appreciate peace, eventually banishing his own daughter to Hel when she attempted to subjugate the entire universe. When Thor almost provoked a new war with the Frost Giants of Jotunheim, Odin stripped him of his powers and exiled him to Earth, leaving Loki to take the throne. Around this time, Odin unexpectedly fell into the Odinsleep, and when Thor had returned and saved the Frost Giants from extinction at the hands of Loki, who seemingly lost his life during the conflict, Odin realized that Thor had proven that he would be worthy enough to take the throne of Asgard.", "quote": ["\"I have sacrificed much to achieve peace. So, too, must a new generation sacrifice to maintain that peace. Responsibility, duty, honor. These are not merely virtues to which we must aspire. They are essential to every soldier and to every king.\"", "―Odin"], "movie": "Thor "}, "Captain_America": {"name": "Captain America", "series": "marvel cinematic universe", "big_five": [0.45, 0.01, 0.89, -0.25, 0.03], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Captain_America", "description": "Captain Steven Grant \"Steve\" Rogers is a World War II veteran, a founding member of the Avengers, and the world's first superhero. Rogers had suffered from numerous health problems, and upon America's entry into World War II, was rejected from military service despite several attempts to enlist. Rogers was the only recipient of the Super Soldier Serum developed by Abraham Erskine under the Strategic Scientific Reserve. Determined to serve, Rogers ultimately volunteered for the Project Rebirth, which enhanced the frail Rogers' body to the peak of human physicality. Mistrusted by Colonel Chester Phillips, the head of the SSR, Rogers was relegated to propaganda campaigns, and was given the new moniker of Captain America. Rogers later joined the war with a combat role after he single-handedly liberated captured Allied prisoners of war. ", "quote": ["\"I'm not looking for forgiveness. And I'm way past asking permission. Earth just lost her best defender. So we're here to fight. And if you wanna stand in our way... we'll fight you, too.\"", "―Steve Rogers to Thaddeus Ross"], "movie": "Avengers: Infinity War"}, "Star-Lord": {"name": "Star-Lord", "series": "marvel cinematic universe", "big_five": [0.28, 0.88, -0.38, 0.24, 0.48], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Star-Lord", "description": "Peter Jason Quill was a half-human, half-Celestial who was abducted from Earth by the Yondu Ravager Clan in 1988. After his abduction, he began building fame as the legendary outlaw Star-Lord. In 2014, he decided to leave the Ravagers and operate individually, starting by stealing a precious artifact known as the Orb, unintentionally becoming a key player in the Quest for the Orb. Following his arrest, he forged an uneasy alliance with fellow inmates Gamora, Drax the Destroyer, Rocket Raccoon, and Groot, and formed the Guardians of the Galaxy team with them a short while later in order to stop Ronan the Accuser from destroying Xandar. After the Battle of Xandar, he left with the other Guardians to do \"a little bit of good and a little bit of bad.\"", "quote": ["\"We're getting no help from Flash Gordon here.\"\"Flash Gordon? By the way, that's a compliment. Don't forget, I'm half-human. So that 50% of me that's stupid? That's 100% you.\"", "―Iron Man and Star-Lord"], "movie": "Avengers: Infinity War"}, "Wasp": {"name": "Wasp", "series": "marvel cinematic universe", "big_five": [-0.03, 0.17, 0.22, -0.03, 0.22], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Wasp", "description": "Hope van Dyne was the daughter of Hank Pym and Janet van Dyne, and a board member of the company founded by her father, Pym Technologies. When the CEO of Pym Technologies, Darren Cross, attempted to create and sell a new weapon based on her father's Ant-Man Suit, van Dyne reunited with her father and, along with an ex-con named Scott Lang as the new Ant-Man, was able to defeat Cross. After these events, Hank found the possibility of saving his wife due to Lang's first experience in the Quantum Realm, from which van Dyne was finally being offered by her father a suit that belonged her mother, to become the new holder of the mantle of Wasp.", "quote": ["\"If I had asked, would you have come?\"\"I guess we’ll never know. But I do know one thing. If I had, you’d never been caught.\"", "―Scott Lang and Hope van Dyne"], "movie": "Ant-Man and the Wasp"}, "Ant-Man": {"name": "Ant-Man", "series": "marvel cinematic universe", "big_five": [0.46, 0.87, -0.55, 0.3, 0.23], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Ant-Man", "description": "Scott Edward Harris Lang is a former criminal who was convinced by Pym Technologies CEO Hank Pym to take up his mantle as the new Ant-Man. As Ant-Man, Lang fought against Darren Cross, Pym's protégé who became obsessed with Pym Particles and intended to recreate and sell the technology to terrorist organizations such as HYDRA and the Ten Rings. After his daughter, Cassie Lang, was taken hostage by Cross, Lang was able to send both of them into the Quantum Realm, where he saw Pym's wife Janet van Dyne, before successfully returning. Cross was presumably killed. Lang then began a romantic relationship with Pym's daughter, Hope van Dyne.", "quote": ["\"I do some dumb things and the people that I love the most pay the price. Mainly you.\"", "―Scott Lang to Cassie Lang"], "movie": "Ant-Man and the Wasp"}, "Doctor_Strange": {"name": "Doctor Strange", "series": "marvel cinematic universe", "big_five": [-0.13, 0.19, 0.25, -0.59, 0.58], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Doctor_Strange", "description": "Stephen Vincent Strange M.D., Ph.D was a powerful sorcerer and Master of the Mystic Arts. Originally a brilliant yet arrogant neurosurgeon, Strange had suffered a car accident, resulting in his hands becoming crippled. When Western medicine failed him, Strange embarked on a journey that led him to Kamar-Taj where Strange had made the discovery of magic and alternate dimensions, being trained by the Ancient One. Though focused on healing his hands, Strange learned more of the mystic arts and helped the Masters prevent Kaecilius from merging Earth with their Dark Dimension, but not before witnessing the Ancient One's death. With the demise of his mentor, Strange became the protector of the New York Sanctum within New York City as well as Earth's protector from any inter-dimensional threats.", "quote": ["\"What is your job exactly, besides making balloon animals?\"\"Protecting your reality, douchebag.\"", "―Iron Man and Doctor Strange"], "movie": "Avengers: Infinity War"}, "Thor": {"name": "Thor", "series": "marvel cinematic universe", "big_five": [-0.13, 0.28, -0.33, 0.18, -0.14], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Thor", "description": "Thor Odinson is the current king of Asgard, a founding member of the Avengers, and the God of Thunder. When his irresponsible and impetuous behavior reignited a conflict between Asgard and Jotunheim, Thor was denied the right to become king, stripped of his power, and banished by his father Odin to Earth. While exiled on Earth, Thor learned humility, finding love with Jane Foster, and helping to save his new friends from a destructive threat sent by his adoptive brother Loki. Due to his selfless act of sacrifice, Thor redeemed himself in his father's eyes and was granted his power once more, which he then used to defeat Loki's schemes of genocide.", "quote": ["\"I’m only alive because fate wants me alive. Thanos is just the latest in a long line of bastards, and he’ll be the latest to feel my vengeance. Fate wills it so.\"", "―Thor to Rocket Raccoon"], "movie": "Avengers: Infinity War"}, "Gamora": {"name": "Gamora", "series": "marvel cinematic universe", "big_five": [-0.17, 0.38, 0.35, -0.06, 0.15], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Gamora", "description": "Gamora was a Zehoberei former assassin and a member of the Guardians of the Galaxy. She became the adopted daughter of Thanos and adopted sister of Nebula after he killed half of her race. She served him for years before betraying him in an attempt to free herself from his ways. She was hired to steal the Orb, and became caught up in the Quest for the Orb, becoming friends with the other members of the Guardians of the Galaxy. After the Battle of Xandar, she left to work with them all. Having made a deal with the Sovereign to kill the Abilisk, Gamora was able to take back custody of Nebula with the intention of finally bringing her to justice in Xandar.", "quote": ["\"I’m not your daughter. Everything I hate about myself, you taught me.\"\"And in doing so, made you the fiercest woman in the Galaxy.\"", "―Gamora and Thanos"], "movie": "Avengers: Infinity War"}, "Sharon_Carter": {"name": "Sharon Carter", "series": "marvel cinematic universe", "big_five": [0.45, 0.81, 0.44, -0.5, 0.44], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Sharon_Carter", "description": "Agent Sharon Carter is the great niece of legendary S.H.I.E.L.D. founder Peggy Carter. Following in her aunt's footsteps, Carter became an agent of S.H.I.E.L.D. who had briefly worked undercover as the neighbor of Steve Rogers under the direct orders of Nick Fury. She fought on the side of S.H.I.E.L.D. during the Battle at the Triskelion, facing off against Brock Rumlow to protect millions of lives. In the aftermath of the HYDRA Uprising, Carter left disbanded S.H.I.E.L.D. and joined the CIA, before he stationing in the Joint Counter Terrorist Centre. She continued to have a close relationship with Rogers and sided with him when he chose to protect Bucky Barnes from the government she still worked for, indirectly being responsible for sparking the devastating Avengers Civil War.", "quote": ["\"I asked her once how she managed to master diplomacy and espionage at a time when no one wanted to see a woman succeed at either. And she said, \"Compromise where you can. Where you can't, don't. Even if everyone is telling you that something wrong is something right. Even if the whole world is telling you to move, it is your duty to plant yourself like a tree, look them in the eye, and say, 'No, you move'.\"", "―Sharon Carter"], "movie": "Captain America: Civil War"}, "Drax_the_Destroyer": {"name": "Drax the Destroyer", "series": "marvel cinematic universe", "big_five": [-0.4, -0.31, -0.46, 0.19, -0.45], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Drax_the_Destroyer", "description": "Drax, also known as Drax the Destroyer, was a former intergalactic criminal and a member of the Guardians of the Galaxy. He sought revenge on Ronan the Accuser for killing his wife and daughter, and went on a rampage across the galaxy, ending with him being imprisoned by the Nova Corps in the Kyln. There, Drax became uneasy allies with Star-Lord, Gamora, Rocket Raccoon, and Groot. Together they broke out of the Kyln and became embroiled in the Quest for the Orb. After the Battle of Xandar, in which he finally exacted his vengeance on Ronan, Drax left Xandar with the other Guardians but not before declaring Thanos as his next target.", "quote": ["\"There are two types of beings in the universe: those who dance and those who do not.\"", "―Drax the Destroyer"], "movie": "Guardians of the Galaxy Vol. 2"}, "Rocket_Raccoon": {"name": "Rocket Raccoon", "series": "marvel cinematic universe", "big_five": [-0.08, 0.55, -0.22, 0.43, 0.16], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Rocket_Raccoon", "description": "89P13 is a genetically enhanced raccoon turned freelance criminal, calling himself Rocket. Alongside his friend and partner Groot, Rocket traveled the galaxy picking up bounties until they met Star-Lord who then convinced them to assist him to sell the Orb for a massive profit. However as it was discovered that the Orb was one of the Infinity Stones which was being sought out by Ronan the Accuser, Rocket was convinced to risk everything to stop Ronan's plans to destroy Xandar and enslave the world. During the ensuing conflict, Rocket managed to assist his friends in destroying Ronan, despite Groot being killed. He then became a member of the Guardians of the Galaxy alongside the newly planted baby Groot.", "quote": ["\"Ain't no thing like me 'cept me.\"", "―Rocket Raccoon"], "movie": "Guardians of the Galaxy "}, "Happy_Hogan": {"name": "Happy Hogan", "series": "marvel cinematic universe", "big_five": [0.7, 0.46, 0.41, -0.09, -0.34], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Happy_Hogan", "description": "Harold Joseph \"Happy\" Hogan is one of Tony Stark's closest friends and his personal chauffeur who formerly worked as his personal bodyguard and Head of Security of Stark Industries. He was almost killed during Aldrich Killian's War, which motivated Stark to get revenge on the Mandarin, who he believed was behind Hogan's injuries. After his recovery, Hogan continued to faithfully serve as Stark's friend and employee. He oversaw Stark's mentorship over Peter Parker/Spider-Man, aiding the young hero on his trip to Germany and acting as their liaison when Parker continued his superhero activities. Hogan, however, was irritated by the boy and avoided his duties with him. After Parker defeated Vulture to prevent the cargo in which Hogan kept certain valuable items to be transferred to the New Avengers Facility from getting hijacked, the young hero earned Hogan’s admiration and respect.", "quote": ["\"Let me tell you something. Do you know what happened when I told everyone I was Iron Man's bodyguard? They would laugh in my face. I had to leave while I still had a shred of dignity.\"", "―Happy Hogan to Tony Stark"], "movie": "Iron Man 3"}, "Jane_Foster": {"name": "Jane Foster", "series": "marvel cinematic universe", "big_five": [0.35, -0.06, 0.1, -0.34, 0.72], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Jane_Foster", "description": "Doctor Jane Foster is one of the world's leading astrophysicists, the world's foremost astronomer, the creator of the Foster Theory, as well as one of the premiere experts on Asgard. She found Thor after he was banished from Asgard and fell to Earth while she and her team were in New Mexico studying astronomical anomalies. She helped him in his mission to return to Asgard, eventually falling in love with him along the way. They were separated due to the temporary destruction of the Bifrost Bridge. During Loki's assault on Earth, S.H.I.E.L.D. kept her out of harms way by transferring her to a remote observatory where Loki could not find her.", "quote": ["\"It's all my fault. If I hadn't found the Aether, your mother and brother would still be alive...\"\"But if you hadn't come across it, Malekith would have found it quicker.\"\"", "―Jane Foster and Thor"], "movie": "Thor: The Dark World"}, "Bucky_Barnes": {"name": "Bucky Barnes", "series": "marvel cinematic universe", "big_five": [0.0, -0.51, 0.4, 0.31, 0.19], "url": "https://marvelcinematicuniverse.fandom.com/wiki/Bucky_Barnes", "description": "Sergeant James Buchanan \"Bucky\" Barnes was a former soldier of the 107th Infantry Regiment and the best friend  of Steve Rogers, since childhood. Barnes was conscripted and assigned to the 107th in 1942. His regiment was captured by the forces of HYDRA, but Barnes along with what remained of his regiment were rescued by Rogers, who had become Captain America during Barnes' military absence. Joining forces in the continuing war, Barnes and Rogers formed the Howling Commandos to battle the Red Skull's forces. During an attempt to capture HYDRA scientist Arnim Zola, Barnes was caught in an ambush and plummeted hundreds of feet from the HYDRA train. As no body was ever recovered, he was then presumed dead, but officially listed as MIA.", "quote": ["\"What you did all these years... it wasn't you. You didn't have a choice.\"\"I know. But I did it.\"", "―Steve Rogers and Bucky Barnes"], "movie": "Captain America: Civil War"}, "Mace_Windu": {"name": "Mace Windu", "series": "star wars", "big_five": [0.06, 0.42, 0.67, 0.31, 0.82], "url": "https://starwars.fandom.com/wiki/Mace_Windu", "description": "Mace Windu, a Force-sensitive human male, was a revered Jedi Master and member of the Jedi High Council during the last years of the Galactic Republic. During his time in the Jedi Order, he once served as elected leader of the Jedi and, during the Clone Wars, as a Jedi General in the Grand Army of the Republic. He was the greatest champion of the Jedi Order and promoted its ancient traditions amidst the growing influence of the dark side of the Force in the corrupt, declining days of the Republic.", "quote": ["In the name of the Galactic Senate of the Republic, you're under arrest, Chancellor.", "―Mace Windu, to Darth Sidious"], "movie": "Star Wars: Episode III Revenge of the Sith"}, "Chewbacca": {"name": "Chewbacca", "series": "star wars", "big_five": [0.74, -0.09, 0.39, -0.38, 0.67], "url": "https://starwars.fandom.com/wiki/Chewbacca", "description": "Chewbacca, known affectionately to his friends as Chewie, was a Wookiee warrior, smuggler, and resistance fighter who fought in the Clone Wars, the Galactic Civil War, and the conflict between the First Order and the Resistance. He hailed from the planet Kashyyyk and became a Wookiee military leader. During the Clone Wars, he was captured by Trandoshan slavers and held captive on Wasskah, but he worked with a fellow captive, Jedi Commander Ahsoka Tano, to escape. He later commanded Wookiee forces during the Battle of Kashyyyk alongside the Grand Army of the Republic, led by Jedi Master Yoda. During the battle, one of the last ones of the war, Yoda's clone troopers received Order 66 from Supreme Chancellor Palpatine and, with the help of Chewbacca, Yoda escaped Kashyyyk and the destruction of the Jedi Order.", "quote": ["Chewbacca here is first mate on a ship that might suit us.", "―Obi-Wan Kenobi"], "movie": "Star Wars: Episode IV A New Hope"}, "Orson_Krennic": {"name": "Orson Krennic", "series": "star wars", "big_five": [-0.57, 0.73, -0.29, 0.54, 0.82], "url": "https://starwars.fandom.com/wiki/Orson_Krennic", "description": "Orson Callan Krennic was a human male who served as Director of the Advanced Weapons Research division of the Imperial Security Bureau and served as the commander of the Death Star up to the beginning of the Galactic Civil War. Beginning his career as a Lieutenant Commander in the Galactic Republic, Krennic was promoted to commander and later the fleet equivalence of admiral upon formation of the Galactic Empire. Persistent and ambitious, Krennic was responsible for the development and construction of the Empire's enormous Death Star superweapon. An old friend of crystallographer Galen Erso, Krennic manipulated the brilliant scientist into researching synthetic kyber crystals under the pretext of researching sustainable energy. In reality, Krennic weaponized Erso's crystal research for the battle station's planet-killing superlaser, hoping this would place him above his long-time rival Grand Moff Wilhuff Tarkin and win the favor of the Emperor. Krennic was also held accountable for security of the project, quelling rumors of the Empire's secret enterprise for the several decades of its assembly. For these many purposes he commanded a squad of death troopers, serving as both a sword and shield when the Director found himself in battle.", "quote": ["Be careful not to choke on your aspirations, Director.", "―Darth Vader"], "movie": "Rogue One: A Star Wars Story"}, "Darth_Vader": {"name": "Darth Vader", "series": "star wars", "big_five": [-0.83, -0.07, 0.26, 0.19, -0.12], "url": "https://starwars.fandom.com/wiki/Darth_Vader", "description": "Anakin Skywalker, a Force-sensitive human male, was a Jedi Knight of the Galactic Republic and the Chosen One of the Force. During the Clone Wars, his accomplishments as a battlefield commander earned him the Hero With No Fear moniker. After turning to the dark side of the Force, he became known as Darth Vader―Dark Lord of the Sith and apprentice to Emperor Darth Sidious. As a Sith Lord, Vader turned against his former comrades and hunted the surviving Jedi into near extinction. He became an enforcer of the Galactic Empire, who worked to crush the Alliance to Restore the Republic for opposing his Sith Master's will. Yet despite his actions as Darth Vader, a glimmer of the light side of the Force remained within the former Anakin Skywalker.", "quote": ["You are the Chosen One. You have brought balance to this world. Stay on this path and you will do it again… for the galaxy. But beware… your heart…", "―The Father's last words, to Anakin Skywalker"], "movie": "Ghosts of Mortis"}, "Qi'ra": {"name": "Qi'ra", "series": "star wars", "big_five": [-0.12, 0.58, 0.23, -0.22, 0.28], "url": "https://starwars.fandom.com/wiki/Qi'ra", "description": "Qi'ra was a human female from the planet Corellia who lived during the reign of the Galactic Empire. She grew up on the streets along with Han as part of the White Worms. Though they were at first rivals, the two Scrumrats eventually fell in love and became lovers. Sometime after Qi'ra was made Head Girl by Lady Proxima, Han and Qi'ra attempted to escape with a vial of coaxium, but were separated at the Coronet Spaceport, Han got out but promised to return for her.", "quote": ["I might be the only person who knows what you really are.", "―Qi'ra, to Han Solo"], "movie": "Solo: A Star Wars Story"}, "Yoda": {"name": "Yoda", "series": "star wars", "big_five": [0.43, -0.32, 0.72, -0.44, 0.92], "url": "https://starwars.fandom.com/wiki/Yoda", "description": "Yoda, a Force-sensitive male member of a mysterious species, was a legendary Jedi Grand Master who witnessed the rise and fall of the Galactic Republic, as well as the rise of the Galactic Empire. An ancient Jedi revered for his advanced age and wisdom, Yoda served as Grand Master of the Jedi Order during the latter days of the Republic and also held a seat on the Jedi High Council along with other legendary masters such as Mace Windu and Ki-Adi-Mundi. For over eight-hundred years, he mentored others in the ways of the Force and had a hand in the training of many Jedi during their time as younglings.", "quote": ["For my ally is the Force. And a powerful ally it is. Life creates it, makes it grow. Its energy surrounds us and binds us. Luminous beings are we, not this crude matter. You must feel the Force around you. Here, between you…me…the tree…the rock…everywhere! Yes, even between this land and that ship.", "―Yoda to Luke Skywalker"], "movie": "Star Wars: Episode V The Empire Strikes Back"}, "Qui-Gon_Jinn": {"name": "Qui-Gon Jinn", "series": "star wars", "big_five": [0.83, 0.46, 0.09, 0.13, 0.84], "url": "https://starwars.fandom.com/wiki/Qui-Gon_Jinn", "description": "Qui-Gon Jinn was a human male Jedi Master who lived during the declining days of the Galactic Republic. The Coruscant-born Jedi was a controversial figure in his time, having long been a student of the Living Force who often bucked the Jedi Code and the decisions of the Jedi High Council in order to follow the will of the Force. According to his Padawan, Obi-Wan Kenobi, Jinn could have been a member of the High Council had he followed the Code, but he, like his own Jedi Master, Count Dooku, did not always put his faith in institutional wisdom. His studies of the Living Force helped him learn to unlock the secrets of eternal consciousness after death, giving him and the students he would later teach influence beyond death.", "quote": ["There is always hope, my friend, though it often comes in forms not looked for. The key is knowing how to see it and seizing that opportunity.", "―Qui-Gon Jinn, to Yoda"], "movie": "Voices"}, "Cassian_Andor": {"name": "Cassian Andor", "series": "star wars", "big_five": [-0.26, -0.58, 0.67, -0.64, 0.5], "url": "https://starwars.fandom.com/wiki/Cassian_Andor", "description": "Cassian Jeron Andor, also known by the aliases Willix, Aach, Joreth Sward, and the title Fulcrum, was a human male soldier, pilot and Intelligence officer who served in the Confederacy of Independent Systems during the Clone Wars and then the Alliance to Restore the Republic during Operation Fracture and the Galactic Civil War. Andor joined a Rebel mission to steal the plans of the Death Star, a superweapon built by the Galactic Empire. Although the mission was a success, Andor perished along with the rest of Rogue One.", "quote": ["Everything I did, I did for the Rebellion, and every time I walked away from something I wanted to forget, I told myself it was for a cause I believed in. A cause that was worth it. Without that, we're lost. Everything we've done would have been for nothing. I couldn't face myself if I gave up now.", "―Cassian Andor vows to accompany Jyn Erso to Scarif"], "movie": "Rogue One: A Star Wars Story"}, "Asajj_Ventress": {"name": "Asajj Ventress", "series": "star wars", "big_five": [0.26, 0.18, -0.79, 0.29, 0.67], "url": "https://starwars.fandom.com/wiki/Asajj_Ventress", "description": "Asajj Ventress was a Dathomirian female who, at various points throughout her life, was a slave, a Jedi Padawan, an assassin of the Sith, a Nightsister and a bounty hunter. In the final decades of the Galactic Republic's reign, Ventress was born into a clan of Force-sensitive Nightsister witches led by Mother Talzin on the planet Dathomir. Early in her life, her coven was forced to surrender Ventress to the criminal Hal'Sted, who spirited Ventress away from her sisters to the war-torn world of Rattatak where she was raised as a slave in his service. She was orphaned when her master was killed by Weequay pirates, but was later discovered by the Jedi Knight Ky Narec, who was stranded on Rattatak and waging a battle against the pirate marauders. Narec raised Ventress and taught her to use the Force in the ways of the Jedi Order, and together they protected the people of Rattatak and fought back against the predatory attacks of pirates and warlords. After a decade of helping the local population, Ventress was orphaned once more when Narec was killed by pirates seeking to end the Jedi's crusade on their world. Enraged by the loss and bereft of guidance, Ventress embraced the dark side of the Force, deposing the local warlords and ruling in their stead. She was eventually discovered by the Sith Lord Count Dooku and fell under his guidance and tutelage as an assassin and aspiring apprentice.", "quote": ["You've told me your existence has been nothing but pain and loss. Never feeling secure. Never having a home. You deserve so much, and I can get it for us. The life we'll be able to have together once—", "―Quinlan Vos and Asajj Ventress"], "movie": "Dark Disciple"}, "Wedge_Antilles": {"name": "Wedge Antilles", "series": "star wars", "big_five": [0.12, 0.74, 0.6, -0.57, 0.18], "url": "https://starwars.fandom.com/wiki/Wedge_Antilles", "description": "Wedge Antilles, known as TIE SS-2-5 during his time at Skystrike Academy, was a renowned human male starfighter pilot from Corellia who first served in the Imperial Navy as a TIE fighter pilot until defecting to join the rebellion. He would also serve in the Alliance to Restore the Republic and years later the New Republic during their fight against the Galactic Empire. He became a member of the Rebel Alliance during the Galactic Civil War and fought in several battles of the war. He fought in the Battle of Yavin, where he flew in Red Squadron alongside Luke Skywalker. After Skywalker destroyed the Death Star, he and Antilles were left as the only survivors of Red Squadron.", "quote": ["It's like you said: the Death Star had to be stopped. Just as the Empire must be destroyed. If that's going to happen, some of us have to get blood on our hands. We have to be willing to kill, and willing to die. It's not easy and it never will be. But I can tell you this much, Kyrell. It's easier than standing by and doing nothing.", "―Wedge Antilles, to Thane Kyrell"], "movie": "Lost Stars"}, "Kylo_Ren": {"name": "Kylo Ren", "series": "star wars", "big_five": [-0.44, -0.51, -0.03, 0.61, 0.19], "url": "https://starwars.fandom.com/wiki/Kylo_Ren", "description": "Kylo Ren, a Force-sensitive human male, was the Supreme Leader of the First Order and master of the Knights of Ren during the New Republic Era. Once a promising student of Jedi Master Luke Skywalker, the former Ben Solo was neither Jedi or Sith but a product of both philosophies. Through the teachings of his predecessor, Supreme Leader Snoke, Ren came to embrace the dark side of the Force. However, he still felt the pull of the light side of the Force, resulting in much conflict within him. Yet despite his inner struggle, Ren believed it was his destiny to rule the galaxy. He was also determined to destroy the legacy of the Jedi Order as well as the Sith, believing it was time to forge a new galactic order in their place.", "quote": ["Let the past die. Kill it if you have to. That's the only way to become what you were meant to be.", "―Kylo Ren"], "movie": "Star Wars: Episode VIII The Last Jedi"}, "Lando_Calrissian": {"name": "Lando Calrissian", "series": "star wars", "big_five": [0.04, 0.86, -0.28, 0.08, 0.48], "url": "https://starwars.fandom.com/wiki/Lando_Calrissian", "description": "Lando Calrissian was a human male smuggler, gambler, and card player who became Baron Administrator of Cloud City and, later, a general in the Rebel Alliance. He was the owner of the Millennium Falcon before losing it to Han Solo in a game of sabacc on Numidian Prime. After losing the Falcon, Calrissian put an end to his days as a smuggler and became an entrepreneur, setting up a small mining operation on the planet Lothal before eventually becoming the leader of Cloud City in the skies of the planet Bespin.", "quote": ["I mean, he was brave, sure, but always in the service of saving his own hide or profit. But I had also detected that deep down, behind all that smooth talking and those well-ironed capes, there was a whole human being with a conscience and a desperate need to do something worthwhile with his life.", "―Kaasha Bateen, on Lando Calrissian"], "movie": "Last Shot"}, "Finn": {"name": "Finn", "series": "star wars", "big_five": [0.83, 0.46, -0.06, -0.15, -0.15], "url": "https://starwars.fandom.com/wiki/Finn", "description": "Finn, also known as FN-2187 or Eight-Seven, was a human male stormtrooper who deserted the First Order and joined the Resistance during the new galactic war. He was born in 11 ABY and, like other troopers, conscripted into the First Order military. Though a capable soldier, he lacked the zeal for combat possessed by other members of the FN Corps. During the waning days of the cold war, FN-2187 witnessed the massacre of an entire village on the desert planet Jakku―an act carried out by his squadmates on the orders of the fallen Jedi Kylo Ren. Unable to reconcile the First Order's methods with his conscience, FN-2187 escaped from his former comrades with the help of Commander Poe Dameron, a Resistance pilot who named the stormtrooper \"Finn.\" He planned to hide in the Outer Rim Territories, believing the First Order was unbeatable, but reluctantly became involved with Rey, Han Solo, and Chewbacca as they made their way to the Resistance base on D'Qar in order to bring the droid BB-8 to General Leia Organa. After Rey was captured by Ren on Takodana, Finn infiltrated Starkiller Base to rescue his newfound friend but was subsequently defeated in a lightsaber duel with Ren.", "quote": ["You're a good man, Finn.", "―Poe Dameron"], "movie": "Star Wars: Episode VII The Force Awakens"}, "Poe_Dameron": {"name": "Poe Dameron", "series": "star wars", "big_five": [0.28, 0.64, -0.32, -0.26, 0.54], "url": "https://starwars.fandom.com/wiki/Poe_Dameron", "description": "Poe Dameron was a human male who served as a pilot in the New Republic and, later, the Resistance during its conflict and subsequent war with the First Order. The son of Lieutenant Shara Bey and Sergeant Kes Dameron of the Alliance to Restore the Republic, Dameron followed in his late mother's footsteps in becoming a pilot, serving the New Republic Defense Fleet as the commander of Rapier Squadron, but grew disillusioned with the Republic's inaction to the First Order's violations of the Galactic Concordance. Dameron defected to the Resistance, where he became one of General Leia Organa's most trusted operatives. Dameron flew under the callsign of Black Leader while piloting his specialized T-70 X-wing starfighter, Black One.", "quote": ["You know, I've been thinking about all of this. Thinking about the ", "―Poe Dameron to Black Squadron"], "movie": "Poe Dameron 31: The Awakening, Part VI"}, "Grand_Admiral_Thrawn": {"name": "Grand Admiral Thrawn", "series": "star wars", "big_five": [-0.52, -0.12, 0.83, -0.34, 0.41], "url": "https://starwars.fandom.com/wiki/Grand_Admiral_Thrawn", "description": "Mitth'raw'nuruodo, more commonly known as Thrawn, was a Chiss male officer and Grand Admiral of the Imperial Navy during the reign of the Galactic Empire. An alien Imperial officer with striking blue skin, red eyes, and an angular face, Thrawn was well known as a brilliant and ruthless strategist. He believed that in order to achieve victory in war, one must know their enemy. As such, he dedicated himself to understanding the philosophy, art, and culture of his opponents, which included the Twi'leks of Ryloth and the warriors of Mandalore. When Governor Arihnda Pryce requested a strong commander capable of defeating the rebels on Lothal, Grand Admiral Thrawn accepted the challenge, intending to dismantle the rebellion one piece at a time.", "quote": ["There are things in the universe that are simply and purely evil. A warrior does not seek to understand them, or to compromise with them. He seeks only to obliterate them.", "―Thrawn"], "movie": "Thrawn "}, "Captain_Phasma": {"name": "Captain Phasma", "series": "star wars", "big_five": [-0.69, 0.19, 0.63, 0.19, -0.11], "url": "https://starwars.fandom.com/wiki/Captain_Phasma", "description": "Phasma was a human female stormtrooper captain of the First Order. Phasma grew up as a member of the Scyre clan on the nuclear-ravaged world of Parnassos. She was a formidable warrior who became the clan's military leader. Seeking passage offworld, Phasma helped the First Order General Brendol Hux find his ship in the process betraying her own brother Keldo and clan. After being rescued, Phasma joined the First Order, abandoning her former life on Parnassos.", "quote": ["And I did what I had to do to get to me as well. I don't regret it. That's the difference between us. I know what I am, and I embrace it. I'm proud of it. I fought for everything that I have, every bit of what I am.", "―Phasma, to Cardinal"], "movie": "Phasma "}, "Padmé_Amidala": {"name": "Padmé Amidala", "series": "star wars", "big_five": [0.65, 0.41, 0.37, -0.42, 0.55], "url": "https://starwars.fandom.com/wiki/Padmé_Amidala", "description": "Padmé Amidala, also known as Padmé Amidala Naberrie, was a human female senator who represented the people of Naboo during the final years of the Galactic Republic. Prior to her career in the Galactic Senate, Amidala was the elected ruler of the Royal House of Naboo. A political idealist, she advocated for the preservation of democracy as well as a peaceful resolution to the Clone Wars. However, her secret marriage to the Jedi Knight Anakin Skywalker would have a lasting effect on the future of the galaxy for decades to come.", "quote": ["To those who act as agents of chaos, I say this: I stand resolute and unyielding. And if you strike my voice down, know that a chorus of thousands shall rise up in its place, for you have no dominion over the righteous. We are the defenders of truth.", "―Padmé Amidala"], "movie": "Assassin "}, "Rose_Tico": {"name": "Rose Tico", "series": "star wars", "big_five": [0.76, -0.14, 0.52, -0.48, 0.38], "url": "https://starwars.fandom.com/wiki/Rose_Tico", "description": "Rose Tico was a female human who served in the Resistance as a maintenance worker during their conflict with the First Order, whom Tico had hated since she was a child. Tico's older sister, Paige, was a gunner in the Resistance.", "quote": ["That's how we're gonna win, not fighting what we hate, but saving what we love.", "―Rose Tico to Finn"], "movie": ""}, "Grand_Moff_Tarkin": {"name": "Grand Moff Tarkin", "series": "star wars", "big_five": [0.59, 0.22, 0.83, -0.28, -0.18], "url": "https://starwars.fandom.com/wiki/Grand_Moff_Tarkin", "description": "Wilhuff Tarkin was a human male who served the Galactic Republic and later the Galactic Empire. During the Clone Wars, Tarkin served as a Republic captain under Jedi Master Even Piell and was taken prisoner by the Confederacy of Independent Systems, before escaping with the help of a Jedi and clone trooper strike team. During the incident Piell was killed and Tarkin was later promoted to Admiral and served as prosecutor in the trial of Ahsoka Tano, who was framed for the bombing of the Jedi Temple hangar.", "quote": ["You may fire when ready.", "―Wilhuff Tarkin"], "movie": "Star Wars: Episode IV A New Hope"}, "Saw_Gerrera": {"name": "Saw Gerrera", "series": "star wars", "big_five": [-0.69, 0.28, -0.19, 0.18, -0.3], "url": "https://starwars.fandom.com/wiki/Saw_Gerrera", "description": "Saw Gerrera was a human male Onderonian resistance fighter who, as a leading member of the Onderon rebels, fought against the Confederacy of Independent Systems on Onderon during the Clone Wars. He and his sister, Steela Gerrera, were instrumental in the rebel liberation of their homeworld during the Onderonian Civil War. He later became a key member in the fight against the Galactic Empire and the formation of the Alliance to Restore the Republic. His tactics against the Empire led him to be seen as an extremist, one whose notoriety was recognized by the Empire and, many years later, the New Republic.", "quote": ["I'm not a terrorist. I'm a patriot. And resistance is not terrorism.", "―Saw Gerrera"], "movie": "The Soft War"}, "Jyn_Erso": {"name": "Jyn Erso", "series": "star wars", "big_five": [0.27, -0.03, 0.24, -0.29, 0.52], "url": "https://starwars.fandom.com/wiki/Jyn_Erso", "description": "Jyn Erso was a human female soldier and former criminal who became a pivotal member of the Alliance to Restore the Republic when she led Rogue One in stealing the Death Star plans during the Battle of Scarif. She was the daughter of Lyra Erso, a devout member of the Church of the Force, and scientist Galen Erso, who was forced into helping the Galactic Empire build the Death Star. Erso's mother was killed when Director Orson Krennic, the commander of the Death Star project, kidnapped her father―who affectionately referred to his daughter as \"Stardust.\" She was raised by resistance fighter Saw Gerrera and became a child soldier in his army.", "quote": ["Rebellions are built on hope.", "―Jyn Erso"], "movie": "Rogue One: A Star Wars Story"}, "Palpatine": {"name": "Palpatine", "series": "star wars", "big_five": [-0.82, -0.26, 0.36, 0.18, 0.22], "url": "https://starwars.fandom.com/wiki/Palpatine", "description": "Darth Sidious, a Force-sensitive human male, was the Dark Lord of the Sith who founded the Galactic Empire after toppling its predecessor, the Galactic Republic from within. Prior to his term as Supreme Chancellor and subsequent reign as the Galactic Emperor, Sidious was born approximately eighty-four years before the Battle of Yavin and given the name Sheev Palpatine during the Age of the Republic. A native of the Mid Rim planet Naboo, Palpatine pursued a career in politics and eventually became his homeworld's representative in the Galactic Senate. Although he cultivated the persona of an honest and trustworthy public servant, Senator Palpatine was an ambitious Sith Lord who learned the ways of the dark side of the Force during his secret apprenticeship under Darth Plagueis. Following in a lineage of Dark Lords that began with Darth Bane, who reformed the Sith a millennium prior to the Fall of the Republic, Sidious spent years conspiring to restore his Order to galactic dominance. After killing his Sith Master, he trained an apprentice of his own, the Dathomirian assassin Darth Maul in accordance with the Rule of Two―Bane's decree that there should only be two Sith Lords at any given time.", "quote": ["Everything is proceeding as I have foreseen.", "―Darth Sidious"], "movie": "Star Wars: Episode VI Return of the Jedi"}, "Admiral_Piett": {"name": "Admiral Piett", "series": "star wars", "big_five": [-0.8, -0.2, -0.1, 0.07, 0.15], "url": "https://starwars.fandom.com/wiki/Admiral_Piett", "description": "Firmus Piett, a human male native to Axxila, was an Imperial officer who served in the naval forces of the Galactic Empire during the Galactic Civil War. At the time of the Battle of Hoth, he served as first officer of the Star Dreadnought Executor―flagship of the Sith Lord Darth Vader―assisting Admiral Kendal Ozzel. After Ozzel committed a fatal mistake during the hunt for the Rebel Alliance, Piett was promoted to admiral and given command of Vader's flagship. Piett served in that capacity until the Battle of Endor, where he served as a Fleet Admiral, when the Imperial Navy confronted the Rebel Fleet around the second Death Star battle station in the year 4 ABY. The admiral perished aboard his starship when Arvel Crynyd's A-wing starfighter crashed into the Executor's bridge.", "quote": ["Don't fail me again… ", "―Darth Vader, to Firmus Piett"], "movie": "Star Wars: Episode V The Empire Strikes Back"}, "Luke_Skywalker": {"name": "Luke Skywalker", "series": "star wars", "big_five": [0.34, -0.16, 0.16, -0.22, 0.77], "url": "https://starwars.fandom.com/wiki/Luke_Skywalker", "description": "Luke Skywalker, a Force-sensitive human male, was a  legendary Jedi Master who fought in the Galactic Civil War during the reign of the Galactic Empire. Along with his companions, Princess Leia Organa and Captain Han Solo, Skywalker served on the side of the Alliance to Restore the Republic―an organization committed to the downfall of Emperor Palpatine and the restoration of democracy. Following the war, Skywalker became a living legend, and was remembered as one of the greatest Jedi in galactic history.", "quote": ["We've passed on all we know. A thousand generations live in you now. But this is your fight. We'll always be with you. No one's ever really gone.", "―Luke Skywalker to Rey"], "movie": ""}, "Nien_Nunb": {"name": "Nien Nunb", "series": "star wars", "big_five": [0.03, 0.77, 0.0, -0.23, 0.47], "url": "https://starwars.fandom.com/wiki/Nien_Nunb", "description": "Nien Nunb was a Sullustan male arms dealer and smuggler who joined the Alliance to Restore the Republic during the Galactic Civil War. Shortly after the Battle of Yavin, Nunb answered the call from his friend, Rebel pilot Evaan Verlaine, to help smuggle a group of Alderaanians off of Sullust while avoiding detection from the Galactic Empire; the Empire was searching for surviving Alderaanians after Death Star I blew up its first planet, Alderaan. He went on to further assist Verlaine and Princess Leia Organa in their mission to unite the surviving Alderaanians, during which time he helped Organa escape from potential Imperial captivity.", "quote": ["Only ", "―Princess Leia Organa, to Nien Nunb"], "movie": "Princess Leia, Part V"}, "Ahsoka_Tano": {"name": "Ahsoka Tano", "series": "star wars", "big_five": [0.52, 0.66, 0.34, 0.04, 0.28], "url": "https://starwars.fandom.com/wiki/Ahsoka_Tano", "description": "Ahsoka Tano, nicknamed \"Snips\" by her Master and known as \"Ashla\" after the Clone Wars, was a Jedi Padawan who, after the conflict, helped establish a network of various rebel cells against the Galactic Empire. A Togruta female, Tano was discovered on her homeworld of Shili by Jedi Master Plo Koon, who brought her to the Jedi Temple on Coruscant to receive Jedi training. Following the outbreak of the Clone Wars, Jedi Grand Master Yoda assigned the young Tano to be the Padawan learner of Jedi Knight Anakin Skywalker, whom she joined at the Battle of Christophsis. Whereas Tano was eager to prove herself, Skywalker had a reputation for recklessness, and they had a rather difficult start as Master and apprentice. Yet, they worked together to rescue Rotta, the son of crime lord Jabba Desilijic Tiure, and returned Rotta to his father, thus facilitating a crucial alliance between the Hutt Clan and the Galactic Republic.", "quote": ["It's every citizen's duty to challenge their leaders, to keep them honest, and hold them accountable if they're not.", "―Ahsoka Tano"], "movie": "The Academy"}, "Princess_Leia": {"name": "Princess Leia", "series": "star wars", "big_five": [0.48, 0.83, 0.83, -0.72, 0.86], "url": "https://starwars.fandom.com/wiki/Princess_Leia", "description": "Leia Organa, a Force-sensitive human female, was a princess of Alderaan, a member of the Imperial Senate, a leader of the Alliance to Restore the Republic, a member of the Galactic Senate, and general of the Resistance. Born alongside her twin brother, Luke Skywalker in the year 19 BBY as Leia Amidala Skywalker, she was the daughter of the Jedi Knight Anakin Skywalker and Senator Padmé Amidala of Naboo. As a result of her father's fall to the dark side of the Force, the Skywalker children were separated with Leia becoming the adopted daughter of Senator Bail Organa and his wife, Queen Breha Organa, who renamed her Princess Leia Organa. Raised with the values of her adoptive parents, Organa supported the principles of the Galactic Republic and opposed the rule of its successor, the Galactic Empire. Despite succeeding to her adoptive father's post in the Imperial Senate, Organa worked in secret to undermine the Empire's operations and was entrusted with the stolen plans to the Death Star, an Imperial superweapon capable of destroying entire planets. Although she was unable to prevent the annihilation of her adopted homeworld, the plans were ultimately delivered to the Rebel Alliance, resulting in the destruction of the Death Star during the Battle of Yavin in 0 BBY.", "quote": ["I would rather be a monster that believes in something, that would sacrifice everything to make the galaxy better, than be someone who sits on the sidelines and watches as if it has no consequences to them.", "―Princess Leia Organa"], "movie": "Star Wars Annual 2"}, "Iden_Versio": {"name": "Iden Versio", "series": "star wars", "big_five": [-0.01, 0.07, 0.22, 0.44, 0.1], "url": "https://starwars.fandom.com/wiki/Iden_Versio", "description": "Iden Versio was a human female soldier who served in the military of the Galactic Empire. A TIE fighter pilot in the Imperial Starfighter Corps, Iden became Commander of Inferno Squad, an Imperial Special Forces commando unit assembled by her father, Admiral Garrick Versio, in response to the destruction of the Death Star. Along with Agents Gideon Hask, Del Meeko, and Seyn Marana, she infiltrated the Dreamers and successfully destroyed them, though Marana died in the mission. Inferno Squad would later go on to participate in and conduct special operations for the Empire in the Galactic Civil War, and, in 4 ABY, participated in the Battle of Endor, which saw the death of Emperor Palpatine and the destruction of the second Death Star, resulting in the fracturing of the Empire with the lack of a line of succession and broken chain of command.", "quote": ["We fight so that others can live. And if we die, it better be for the same reason.", "―Iden Versio, to Zay Versio"], "movie": "Star Wars Battlefront II"}, "C-3PO": {"name": "C-3PO", "series": "star wars", "big_five": [0.58, 0.18, 0.6, 0.43, -0.59], "url": "https://starwars.fandom.com/wiki/C-3PO", "description": "C-3PO, sometimes spelled See-Threepio and often referred to simply as Threepio, was a 3PO unit protocol droid designed to interact with organics, programmed primarily for etiquette and protocol. He was fluent in over seven million forms of communication, and developed a fussy and worry-prone personality throughout his many decades of operation. Along with his counterpart, the astromech droid R2-D2, C-3PO constantly found himself directly involved in pivotal moments of galactic history, and aided in saving the galaxy on many occasions.", "quote": ["I am C-3PO, human-cyborg relations.", "―C-3PO"], "movie": "Star Wars: Episode IV A New Hope"}, "Bail_Organa": {"name": "Bail Organa", "series": "star wars", "big_five": [0.72, -0.35, 0.51, 0.12, 0.62], "url": "https://starwars.fandom.com/wiki/Bail_Organa", "description": "Bail Organa was a human male Alderaanian politician, an influential voice for peace in the Galactic Senate during the last days of the Galactic Republic, and a founding member of the Alliance to Restore the Republic. Organa, the senator of Alderaan, was an outspoken member of the Senate's Loyalist Committee that pushed to maintain the ideals of the Republic during the Clone Wars. He became an architect of the early rebellion against the Galactic Empire and believed that a full-scale Galactic Civil War was inevitable if the Empire was to be toppled and replaced by a New Republic.", "quote": ["He taught me so much about politics, leadership, and war, but above all he taught me that no price is too great to pay for our ideals. Bail Organa was willing to die if that meant the Empire would fall. He believed in the New Republic we have been able to create, and in the promise of fair, equal government for everyone under the law.", "―Leia Organa memorializes her father, Bail Organa"], "movie": "Bloodline "}, "R2-D2": {"name": "R2-D2", "series": "star wars", "big_five": [0.19, 0.23, -0.25, -0.53, 0.69], "url": "https://starwars.fandom.com/wiki/R2-D2", "description": "R2-D2, pronounced Artoo-Detoo and often referred to as R2(Artoo), was an R2 series astromech droid manufactured by Industrial Automaton with masculine programming. A smart, spunky droid serving a multitude of masters over its lifetime, R2 never had a full memory wipe (apart from a partial mind-wipe by Cad Bane during the buildup to the senate hostage crisis) nor has he received new programming, with these factors resulting in an adventurous and independent attitude. Oftentimes finding himself in pivotal moments in galactic history, his bravery and ingenuity saved the galaxy time and time again.", "quote": ["Thank you for telling me all this. I know it can be hard to talk about, but war stories are important. I sometimes think it's my destiny—to see things, to be present, to witness the galaxy moving, evolving. It happens to me over and over again—but even so, I can't see everything. And so, I like hearing the stories. Recording them.", "―R2-D2, to BB-8"], "movie": "Poe Dameron 28: The Awakening, Part III"}, "Rey": {"name": "Rey", "series": "star wars", "big_five": [0.18, -0.03, -0.03, -0.15, 0.66], "url": "https://starwars.fandom.com/wiki/Rey", "description": "Rey, a Force-sensitive human female, was a scavenger who lived on the forlorn frontier world of Jakku during the era of the New Republic. In 34 ABY, events drew her away from her homeworld and into the galactic conflict between the First Order and the Resistance. Though initially unaware of her connection to the Force, Rey's powers would manifest during the waning days of the cold war, consequently leading her on the path to becoming a Jedi under the guidance of Jedi Master Luke Skywalker.", "quote": ["Something inside me has always been there, but now it's awake and I'm afraid.", "―Rey"], "movie": "Star Wars: Episode VIII The Last Jedi"}, "General_Hux": {"name": "General Hux", "series": "star wars", "big_five": [-0.7, -0.06, 0.47, 0.09, -0.38], "url": "https://starwars.fandom.com/wiki/General_Hux", "description": "Armitage Hux was a human male general in the First Order military during the cold war and subsequent conflict with the Resistance. A member of High Command, Hux answered directly to the First Order's ruler, Supreme Leader Snoke, granting him far greater authority than his rank would indicate. He was a young, ruthless military officer who rose through the chain-of-command but his ambitions extended far beyond his present status. Believing he was destined to rule the galaxy, Hux longed to see the day when his technological innovations brought about the fall of the New Republic and the Resistance, allowing the armies of the First Order to establish an era of military rule not seen since the Age of the Galactic Empire.", "quote": ["You wonder why I keep a rabid cur in such a place of power? A cur's weakness, properly manipulated, can be a sharp tool.", "―Snoke, on Armitage Hux, to Kylo Ren"], "movie": "Star Wars: Episode VIII The Last Jedi"}, "Obi-Wan_Kenobi": {"name": "Obi-Wan Kenobi", "series": "star wars", "big_five": [0.46, -0.27, 0.7, -0.16, 0.68], "url": "https://starwars.fandom.com/wiki/Obi-Wan_Kenobi", "description": "Obi-Wan Kenobi, later known as Ben Kenobi  during his exile, was a Force-sensitive human male Jedi Master who served the Galactic Republic. He was a mentor and close friend to both Anakin Skywalker and his son, Luke, training them in the ways of the Force.", "quote": ["You've been a great apprentice, Obi-Wan, and you're a much wiser man than I am. I foresee you will become a great Jedi Knight.", "―Qui-Gon Jinn"], "movie": "Star Wars: Episode I The Phantom Menace"}, "Darth_Maul": {"name": "Darth Maul", "series": "star wars", "big_five": [-0.89, -0.2, -0.18, 0.32, -0.61], "url": "https://starwars.fandom.com/wiki/Darth_Maul", "description": "Maul, formerly known as Darth Maul, was a Force-sensitive Dathomirian Zabrak male who lived during the final years of the Galactic Republic and the subsequent reign of the Galactic Empire. The son of Mother Talzin of the Nightsisters, he was taken at a young age by the Sith Lord Darth Sidious, who anointed his first Sith apprentice Darth Maul. Through his training, Maul grew strong in the dark side of the Force, becoming a skilled lightsaber duelist and assassin who yearned to reveal the Sith's continued survival to the Jedi Order. During the crisis on Naboo in 32 BBY, Maul confronted Jedi Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi. Although he succeeded in killing the former, Maul was defeated and maimed by Jinn's apprentice, who left the Sith Lord for dead. As a result of Maul's defeat and apparent death, Sidious replaced him with Count Dooku, Jinn's Jedi mentor who adopted the Sith persona of Darth Tyranus.", "quote": ["I was apprentice to the most powerful being in the galaxy once. I was destined to become… so much more.", "―Darth Maul"], "movie": "Revenge "}, "Han_Solo": {"name": "Han Solo", "series": "star wars", "big_five": [0.28, 0.74, 0.02, -0.44, 0.55], "url": "https://starwars.fandom.com/wiki/Han_Solo", "description": "Han Solo, known only as Han until being given the surname Solo by chief recruitment officer Drawd Munbrin, and also known as Cadet 124-329 when serving as a Imperial cadet, was a human male smuggler who became a leader in the Alliance to Restore the Republic and an instrumental figure in the defeat of the Galactic Empire during the Galactic Civil War. He hailed from Corellia and became a smuggler in the employ of Jabba the Hutt, even completing the Kessel Run in just twelve parsecs with his prized ship, the Millennium Falcon. He was the son-in-law of fallen Jedi Knight Anakin Skywalker and Senator Padmé Amidala, husband of Princess Leia Organa, brother-in-law of Jedi Master Luke Skywalker, father of Ben Solo, rivals and close friends with fellow smuggler Lando Calrissian, and best friends with the Wookiee Chewbacca, his trusted co-pilot who swore a life debt to the Corellian smuggler. Solo ran afoul of Jabba after ditching a shipment of spice to avoid trouble with the Empire, owing the Hutt a great deal of money as a result. His fortune seemed to have changed when he agreed to charter Luke Skywalker, Obi-Wan Kenobi, and the droids R2-D2 and C-3PO to Alderaan, but he became caught up in the rebellion against the Empire and, after helping Leia Organa escape from the Death Star, briefly fought in the Battle of Yavin, which allowed Skywalker to destroy the superweapon. Solo fought with the Rebellion for a number of years afterward, taking part in numerous operations and battles against the Empire.", "quote": ["Never tell me the odds!", "―Han Solo"], "movie": "Star Wars: Episode V The Empire Strikes Back"}, "Jango_Fett": {"name": "Jango Fett", "series": "star wars", "big_five": [0.57, -0.47, 0.56, -0.06, 0.29], "url": "https://starwars.fandom.com/wiki/Jango_Fett", "description": "Jango Fett was a human male bounty hunter, widely regarded to be the best in the galaxy in the years preceding the Clone Wars. Although Fett wore a set of Mandalorian armor during his time as a bounty hunter, the government of Mandalore regarded him as a renegade and pretender. Recruited by the Sith Lord Darth Tyranus, Fett was relocated to the remote planet of Kamino where he served as the genetic template of the clone troopers for the Grand Army of the Republic. Unlike Fett, his clones lacked much of his independence, as they were designed to be entirely loyal to the Galactic Republic. Fett had only one request for the Kaminoans: the creation of Boba Fett, an unaltered clone whom he would raise as his own \"son.\"", "quote": ["One question for you, Tyranus. Why me? There are plenty of bounty hunters out there.", "―Jango Fett and Count Dooku"], "movie": "Age of Republic - Jango Fett 1"}, "Bodhi_Rook": {"name": "Bodhi Rook", "series": "star wars", "big_five": [0.24, 0.16, -0.36, 0.54, 0.17], "url": "https://starwars.fandom.com/wiki/Bodhi_Rook", "description": "Bodhi Rook was a human male from Jedha who served as a cargo pilot for the Galactic Empire prior to the Galactic Civil War. After defecting to the Alliance to Restore the Republic, he fought alongside a group of rebels during the Battle of Scarif.", "quote": ["This is for you, Galen.", "―Bodhi Rook during the Battle of Scarif"], "movie": "Rogue One: A Star Wars Story"}}