{"id": "Abomination", "name": "Abomination", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Abomination", "personality": ["A veteran soldier with years of experience, Emil Blonsky showed a deep passion for combat. When asked why he wouldn't accept a promotion, he answered that he's a soldier and wanted to be one for as long as possible. Being aware that he was being slowed down by age, Blonsky showed an intense desire to return to his glory days, as he commented that if he put his current level of experience in his body from 10 years ago, that would be an opponent he would not want to fight. Blonsky's fierce desire to remain in the battlefield is what convinced General Thaddeus Ross to offer him to try the experimental Super Soldier Serum replica, which he accepted.\n", "After his first encounter with the Hulk, Blonsky became obsessed with defeating the green monster at all costs, slowly losing his sanity and humanity as he continued injecting himself with more Super Soldier Serum. Upon learning that Samuel Sterns had the Gamma Radiation-irradiated blood samples, Blonsky became even more obsessed with obtaining the Hulk's power, going as far as threatening Sterns and ignoring his warnings.\n", "When Blonsky mutated into the Abomination, he readily accepted his new form and immediately became drunk with power, going on a rampage through Harlem and killing several soldiers just to show off his new strength. When Hulk appeared, Blonsky was pleased and eager to have another rematch to see which mutant was stronger. Throughout their duel, he repeatedly enjoyed beating up Hulk and taunting him, showing his sadistic nature and he even arrogantly told Bruce Banner that he did not deserve the Hulk's power. Abomination's aggressive and arrogant behavior, as well as his obsession with defeating Hulk, likely resulted from the Super Soldier Serum enhancing Blonsky's desire to become a better fighter.\n", "Ruthless, savage and psychopathic, Blonsky did not even cared about his defeat nor his death which could come out of the battle with the Hulk at Harlem, all that he cared about is to achieve his greater goal; gain more and more power and later to become the most powerful warrior that the world has ever seen.\n", "Yearning for more strength and more combat, Blonsky arrogantly stated that Ross's soldiers \"would piss in their pants\" when coming into combat against the Hulk, showing his sinister nature even further.\n"], "quotes": [], "figure_captions": []}