{"id": "Alexander_Pierce", "name": "Alexander Pierce", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Alexander_Pierce", "personality": ["As a high ranking member of S.H.I.E.L.D., Pierce was respected by many of his subordinates, including Nick Fury. That respect was gained by decades of service in S.H.I.E.L.D., fighting for and promoting international stability and worldwide peace. However, beneath the exterior of a good man, Pierce was actually a loyal agent of HYDRA who was able to cleverly hide his true goals in order to gain the trust of others.\n", "Always calm and collected during dangerous situations, Pierce showed no physical stamina or skill, but he was still one of HYDRA's most valuable operatives because of his extraordinary position within S.H.I.E.L.D., the United States Government, and the World Security Council. Maybe his greatest talent was his ability to present his actions as if they were for the good of the mankind, while he was actually pushing S.H.I.E.L.D.'s operations in the right direction to serve HYDRA's goals.\n", "As a member of HYDRA, Pierce was a ruthless master manipulator who showed a complete lack of morality or remorse. To ensure HYDRA's global domination, he rallied S.H.I.E.L.D. into pursuing Captain America so he could trick the World Security Council into activating Project Insight undisturbed. He was no stranger to killing and could murder without batting an eye as he did with his housekeeper and with the World Security Council. Pierce no doubt held a great amount of pride for his leadership position within HYDRA as after his true loyalty was exposed by Captain America via loudspeaker to all of S.H.I.E.L.D he made no attempt whatsoever to deny the Captain's revelation and showed very quickly that it was indeed the truth.\n", "He appeared to be somewhat abusive towards his minions, slapping the Winter Soldier for failure to kill Captain America, although this was more likely to snap him out of his trance. However, he did have somewhat of a comical edge, asking if Nick Fury would arrange to have Iron Man attend his niece's birthday party, and offering milk when the Winter Soldier appeared in his house. Even in his final moments, Pierce pledged his loyalty with his final words being, \"Hail HYDRA.\"\n"], "quotes": [["\"Our enemies are your enemies, Nick. Disorder. War. It's just a matter of time before a dirty bomb goes off in Moscow, or an EMP fries Chicago. Diplomacy? A holding action, Nick. A band-aid.\"", "―Alexander Pierce to Nick Fury[src]"]], "figure_captions": []}