{"id": "Ant-Man", "name": "Ant-Man", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Ant-Man", "personality": ["Scott Lang is an affable rogue with a tongue-in-cheek humor. Despite his criminal activity, Lang is a man of honor, good morals, and justice, though to the point of being stubborn, with it being his sense of honor that had led him to his break-in at Vistacorp, where Lang avenged all the people the corrupt corporation wronged. Lang's desire to right wrongs were often the motivation for his illegal activities, yet his love for his daughter, Cassie, also made him determined to go straight upon his release from San Quentin State Prison. Lang only went back to criminal activities when his criminal record ostracized him and gave him no other choice in supporting his daughter. Lang will \"do the wrong thing for the right reason\", which is why he joined Captain America's team during the Avengers Civil War, seeing Rogers' point of view on the Sokovia Accords far more just and honorable than Tony Stark's.\n", "Lang also had a drive to prove himself worthy, as he felt he didn't deserve the admiration of his daughter Cassie. In fact, Lang was initially unwilling to take up the mantle of Ant-Man from Hank Pym due to his own fears of having used the suit. But upon a chat with the former hero, Lang realized he had a chance to become the hero that his daughter already thought he was.\n", "Lang also has a considerable dislike towards Tony Stark and the latter's attitude. This was highlighted when he was interviewed on WHiH World News, as when Christine Everhart said he that he was \"no Tony Stark\", Lang was relieved at the news, genuinely desiring to be nothing like Stark. This was highlighted once again during the Avengers Civil War. Prior to the Clash of the Avengers, he reacted with alarm and distrust to Stark's name. Lang also takes great pleasure in mocking Stark and battling against him; whilst shrunken down during the Civil War, he started disabling Stark's Mark XLVI Armor from the inside and implied he didn't have a conscience despite the fact that not saying anything may have allowed Lang to do more damage without being detected. When he was later imprisoned in the Raft, he again mocked Stark to his face saying that Pym was right not to trust Stark's family. The fact that Stark asked him who he is was a severe blow to Lang's ego.\n", "In contrast, Lang has great respect for Steve Rogers, calling it an honor to meet him, and similarly respects Wanda Maximoff and Sam Wilson; Lang was very awkward around them when he first met them, constantly apologizing to Wilson for hitting him when the two did battle and was awestruck towards Rogers, shaking his hand for too long and babbled before Rogers brought him back to reality. Lang's respect for Rogers was so great that he allowed him and Bucky Barnes to escape by creating a distraction which he implied could have killed him, and knowing that even if he survived he would've been captured.\n", "Since being put under house arrest after escaping the Raft, Lang had time to prioritize what was important in his life. He respected Hank Pym enough to hide the Ant-Man Suit instead of destroying it; he also refused to attempt contacting them as by using the Pym Particles in the Avengers Civil War, it put him on the Most Wanted list. Lang learned Up Close Magic and set up imaginary heights and getaways throughout his apartment as entertainment for his daughter. He also used his former thief skills to set up X-Con Security Consultants with Luis and the rest of his buddies, now creating security systems instead of bypassing them. Lang retained a romantic interest in Hope, a woman who he respected for both her intelligence and fighting skills; as Lang put it, if he was going to have a partner, there was no-one else he'd want but Hope (professionally and romantically).\n"], "personality_quotes": [["\"Mr. Lang, with all due respect, WHiH has been covering global news in detail for the past two decades. From the recent security breach at S.H.I.E.L.D. headquarters, to the earth-shattering events at Sokovia. I reported on Tony Stark in Gulmira and believe me, you're no Tony Stark.\"\"Thank god.\"", "―Christine Everhart and Scott Lang[src]"]], "figure_captions": [], "quote": ["\"I do some dumb things and the people that I love the most pay the price. Mainly you.\"", "―Scott Lang to Cassie Lang", "Ant-Man and the Wasp"], "description": "Scott Edward Harris Lang is a former criminal who was convinced by Pym Technologies CEO Hank Pym to take up his mantle as the new Ant-Man. As Ant-Man, Lang fought against Darren Cross, Pym's protégé who became obsessed with Pym Particles and intended to recreate and sell the technology to terrorist organizations such as HYDRA and the Ten Rings. After his daughter, Cassie Lang, was taken hostage by Cross, Lang was able to send both of them into the Quantum Realm, where he saw Pym's wife Janet van Dyne, before successfully returning. Cross was presumably killed. Lang then began a romantic relationship with Pym's daughter, Hope van Dyne.\n"}