{"id": "Arnim_Zola", "name": "Arnim Zola", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Arnim_Zola", "personality": ["A man of dubious morality, Dr. Zola was one of the most infamous scientific minds on the planet. There was no crime he wasn't willing to commit if that could help him in his scientific experiments. Despite his amorality, Dr. Zola wasn't sadistic, evident by the shock and fear he often displayed towards Red Skull's actions and megalomania. Zola's loyalty to HYDRA seemed to be slightly reluctant during World War II, although after being captured by Captain America and following the war, Zola was key to the survival and re-creation of the organization showing that he had become fanatically loyal to HYDRA and its goals and was willing to do anything to see those goals accomplished by creating world chaos, leading to the deaths of millions. Zola no doubt had a particular hatred of Captain America as he sacrificed himself in order to ensure that Captain America and Black Widow were obliterated in a missile strike by HYDRA. He seemed to be somewhat cowardly during the war, following HYDRA out of fear and willing to keep himself alive in a machine, although when death came he was willing to accept since he was \"out of time.\"\n"], "personality_quotes": [["\"HYDRA was founded on the belief that humanity could not be trusted with its own freedom. What we did not realize was that if you try to take that freedom, they resist. The war taught us much. Humanity needed to surrender its freedom willingly.\"", "―Arnim Zola to Captain America and Black Widow[src]"]], "figure_captions": [], "quote": ["\"I am not a recording, fräulein. I may not be the man I was when the Captain took me prisoner in 1945, but I am.\"", "―Arnim Zola to Black Widow", "Captain America: The Winter Soldier"], "description": "Doctor Arnim Zola was a Swiss scientist working for HYDRA before, during, and after World War II. Originally an employee of the Nazi Sturmabteilung, in 1934 he was recruited by Johann Schmidt to become a lead scientist for Schmidt's HYDRA organization. During the war, he designed many advanced weapons to aid HYDRA in its quest for world domination. Despite being captured by the Allies shortly before Schmidt's defeat in 1945, he was offered a position in S.H.I.E.L.D., the newly formed peacekeeping organization, and he used that opportunity to secretly rebuild HYDRA.\n"}