{"id": "Black_Panther", "name": "Black Panther", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Black_Panther", "personality": ["T'Challa is polite, respectful, and very caring for the people he is around and who he considers his friends. He is shown to have high respect towards other people, especially towards his father, T'Chaka. He honors the tradition and principles of Wakanda and is willing to take action whenever it is necessary. When his father died, he was willing and ready to take his rightful place as king of Wakanda. While he does not seem to favor fights, he was very quick to try and avenge his father's death. An honorable fighter, T'Challa respects his opponents and is willing to spare his enemies' lives. That being said, he is not opposed to killing his opponents in a fight and does not always try to avoid lethal measures of disabling them. Though he mortally injured Erik Killmonger, he still offered him the chance to heal his wounds and even granted his wish to see Wakanda's sunset before dying. When M'Baku challenged T'Challa for the throne, T'Challa focused on forcing M'Baku to yield rather than trying to kill him.\n", "Despite shown to be too action-oriented and had too much of a shoot-first-ask-questions-later attitude early in his introductions, he is, however, not incapable to see reason and was level-headed enough to know when to keep his emotions in check, shown when he finally had the chance to avenge his father, he ultimately chose not to, knowing that doing so would make him fall as low as Zemo, and would go against what the Black Panther stands for. As he stood by Zemo, the latter explained to him about how he had also lost his loved ones too, and that he and T'Challa were not so different, as they both are in pursuit of revenge. It was at this moment that T'Challa realized that revenge has completely consumed Zemo, and he realized that this is not what his father would have wanted for him, he even offered to heal Erik Killmonger despite wanting to kill him initially due to the multiple atrocities he committed, and for killing Zuri who was a friend and a mentor to him. In the end, he agreed to help Captain America and Winter Soldier by granting them asylum in Wakanda, despite their status being international criminals now, as he was able to empathize with the pain both went through. He also displays a strong resolve, as when Captain America warned him the world might declare war on his country for housing Winter Soldier, he confidently stated to let them come.\n", "According to his father, T'Challa tends to disapprove of diplomacy but was nevertheless supportive of the Sokovia Accords, showing that he is more a warrior at heart than a politician.\n", "Since ascending to the throne as King of Wakanda, he is constantly torn between honoring the traditions of Wakanda, and helping the wider world. T'Challa personally questions Wakanda's isolationism, yet unable to find any solid reasons to take a stand on the issue other than traditions. While he agrees that Wakanda, as the most advanced country in the world, can and should do more to help the world, he is unwilling to revise the country's isolationist policies.\n", "It isn't until T'Challa has been dethroned by his corrupted and very destructive cousin, learning about his father's mistakes and the country is on the brink of declaring war against the rest of the world, that he realizes that Wakanda's isolationism had caused, and will eventually cause, more harm than good to the nation's interests, and that of the world's at large. His epiphany on the matter becomes so firm that he berates his father's and his predecessors' insistence on isolationism in the spirit realm, and vows to make Wakanda truly a part of the world.\n", "To that end, T'Challa would develop a strong moral compass, devoting himself to doing what's best for the people around him, even beyond his status as King. T'Challa initiated a variety of programs dedicated to providing aid to the needy in foreign countries, and promote exchanges in a variety of fields, as early steps to break Wakanda's isolation in a very cautious manner, as it is impossible to fully share Wakanda's wealth, technological advancements, and vibranium resources, without causing worldwide chaos.\n", "T'Challa is not a very talkative person, as he usually stays silent during conversations and often talks in short sentences. Even though T'Challa almost always shows a mostly serious demeanor, he is actually quite humorous and sarcastic around his family and friends. He jokes and playfully interacts with his sister Shuri, his lover Nakia, and bodyguard Okoye. He also had a good friendship with his best friend W'Kabi and adviser Zuri until the former lost faith in him for his failure to capture Klaue.\n"], "quotes": [["\"You are a good man, with a good heart. And it's hard for a good man to be a king.\"", "― T'Chaka to T'Challa[src]"]], "figure_captions": []}