{"id": "Bucky_Barnes", "name": "Winter Soldier", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Bucky_Barnes", "personality": ["Bucky Barnes was extremely devoted, loyal, headstrong and patriotic and had a strong moral center. He was a good and close friend to Steve Rogers during their youth; he helped him when he got into fights and tried to cheer him up and look after him when Rogers' mother died. Best friends since childhood, they went through many trials and tribulations together. He was also protective of Rogers, as demonstrated when Steve planned to enlist in the United States Army. Barnes tried to talk him out of it, as he knew he would die because of his physical condition and poor health. \n", "Due to his advanced physiology, however, Barnes survived his apparent death but was found by HYDRA instead. Trained as a living weapon, Barnes became a new man so to speak, as his memories and identity were constantly being wiped until he was augmented into the perfect assassin, the Winter Soldier. As the Soldier, he was brutal and ruthless with an utter lack of conscience, and remorselessly followed HYDRA's every order. Even so, he still saved Steve Rogers from drowning after the Insight Helicarrier blew up. Although he tells Steve he did not know why he did it, it was due to Rogers reminding him of who he was, to which he initially reacted with violence before finally accepting the truth of it.\n", "While he still holds a mostly serious demeanor, he retains a sense of humor, as shown when he and Falcon both smiled with approval at Rogers' kiss with Sharon Carter and later as he and Captain America reminisced over earlier times in their friendship. His sense of humor can also be dry at times, as shown when he asked Wilson why he couldn't use Redwing on Spider-Man earlier.\n", "Even though Barnes has regained his identity and former values, he has also developed a guilt-ridden conscience, and became deeply ashamed and remorseful over his actions as the Winter Soldier. He previously stated that he has an absolute memory of every person he has killed, and knows and freely acknowledges with a tone of great regret that the fact he was brainwashed does not change the fact that he killed them. Upon watching his murder of Howard and Maria Stark, he was clearly visibly stunned and ashamed of what he had done. Fearing for his mental state and anyone around him, Barnes ultimately decided that placing himself in cryogenic stasis until he can be cured of HYDRA's mental programming completely would be the best course of action.\n", "After being cured of HYDRA's programming, Barnes appears to have come to terms with his past. As the White Wolf, Barnes lived quietly in Wakanda, where he spent his time entertaining children and farming until T'Challa asked for his assistance in the Battle of Wakanda. When presented with a replacement cybernetic arm, Barnes, recognizing its meaning, didn't hesitate to join his allies in the battle.\n"], "personality_quotes": [["\"This doesn't have to end in a fight, Buck.\"\"It always ends in a fight.\"", "―Captain America and Winter Soldier[src]"]], "figure_captions": [], "quote": ["\"What you did all these years... it wasn't you. You didn't have a choice.\"\"I know. But I did it.\"", "―Steve Rogers and Bucky Barnes", "Captain America: Civil War"], "description": "Sergeant James Buchanan \"Bucky\" Barnes was a former soldier of the 107th Infantry Regiment and the best friend  of Steve Rogers, since childhood. Barnes was conscripted and assigned to the 107th in 1942. His regiment was captured by the forces of HYDRA, but Barnes along with what remained of his regiment were rescued by Rogers, who had become Captain America during Barnes' military absence. Joining forces in the continuing war, Barnes and Rogers formed the Howling Commandos to battle the Red Skull's forces. During an attempt to capture HYDRA scientist Arnim Zola, Barnes was caught in an ambush and plummeted hundreds of feet from the HYDRA train. As no body was ever recovered, he was then presumed dead, but officially listed as MIA.\n"}