{"id": "Captain_America", "name": "Captain America", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Captain_America", "personality": ["Considered by many as the world's first and greatest superhero, Steve Rogers has been defined by his courage and righteousness. Rogers has always had a noble and honest spirit, intolerant towards injustice and abuses of power. Since he grew up weak and small, he learned on his own that true strength is having the courage to fight against abuse no matter one's power and having compassion for the innocent. Despite being transformed into a perfect human by the Super Soldier Serum, he maintained his original spirit and character. Since his reawakening, Rogers was saddened by losing so much of his time but still retains the same values he had since the 1940s. Due to his famed past exploits and his continued works to save the world, Rogers is generally respected by many; even if he doesn't seek acknowledgment for his deeds. He was also very empathetic being able to understand and relate to both Scarlet Witch and Quicksilver before meeting them and understanding Tony Stark's motivation during the Avengers' Civil War despite Iron Man being on the opposing side.\n", "What separates Steve Rogers from the other Avengers is his humanity and morality. Steve Rogers is an extremely dedicated person. Despite originally being physically weak and small, and rejected many times due to his frail health, he still tried to enlist in the Army during World War II. Steve tried to be of service in whatever way he was allowed; even when his talents were wasted when he was ordered to inspire the American soldiers and support the American war effort by starring in U.S. propaganda. When he heard that the 107th battalion, including Bucky, was captured in a nearby HYDRA facility, Rogers disobeyed his superior's orders and went behind enemy lines in an apparent suicide mission and rescued them. Rogers finds the courage to defend the weak and innocent, and does not hesitate to stand up to corrupt bureaucrats, hypocritical authority figures, powerful beings like Loki, or even the nearly omnipotent Thanos. His determination also aids him, giving him a boost in physical power to allow him to hold off beings of much greater strength, with this even allowing him to survive against Thanos. A true hero, Rogers is more than willing to sacrifice himself to protect others and does not care if he is considered the villain in his heroic job, as his desire to protect the world remained as strong as ever even after he was deemed a criminal.\n", "Rogers is not afraid to do what's right for the greater good and make the tough choices, even if it might be costly to him personally. As a soldier and an Avenger, Rogers knows full well that war has its casualties and some of his dearest friends or even himself may need to make the ultimate sacrifice. He was willing to justify violence and killing to defend others and to preserve peace and freedom, even when Nick Fury called him out on various war crimes he and the American army committed during World War II. Rogers once had to tell Natasha Romanoff to close the Chitauri portal, despite Stark not being out yet. Rogers was also willing to fight his best friend Bucky Barnes when the latter was preventing Steve from saving over three million innocent lives. Nevertheless, Captain America will always prioritize civilian lives. For example, Rogers would not abandon Novi Grad until all of its citizens were evacuated; even when Ultron was planning on smashing the city to the ground to create more damage to Earth. His heroism and determination to what he believes is morally right no matter the personal cost even allowed him to move Mjølnir slightly when he attempted to lift it following the retrieval of the Chitauri Scepter, much to the surprise and discomfort of Thor. He also does not approve of sacrificing others to achieve victory should other options remain available; he refused to let Vision sacrifice himself, instead looking for a way to separate him from the Mind Stone.\n", "As seen during World War II and the Chitauri Invasion, Captain America has demonstrated impressive charisma and leadership skills. He is able to command respect from his fellow Avengers and the undying loyalty of his Howling Commandos. Rogers' extraordinary ability to not only inspire the nobility in others but also assess combat situations and come up with effective strategies made his fellow Avengers recognize him as the leader of their team. During the Chitauri attack on New York, Captain America focused on directing civilian authorities in order to keep the citizens safe and off the streets while the rest of the Avengers focused their efforts on taking out the Chitauri's military assets. Even when outnumbered by the forces of HYDRA within S.H.I.E.L.D., Steve was able to get Wilson, Hill, Romanoff and even Fury, along with the loyal agents within S.H.I.E.L.D. to fight back against HYDRA and stop Project Insight from being achieved. As a result, Rogers dealt HYDRA their first devastating blow in decades, since he fought against them in World War II.\n", "Captain America's uncompromising sense of morality and selflessness sometimes puts him at odds with Tony Stark, who is more comfortable with a grey morality to protect people. This has led to several moments of bickering, arguments, and almost physical fights over the direction of the Avengers in how to protect people. Despite their differences, however, they both respect each other, work well together, and have even formed a close friendship. This difference in attitude, reached a head in the Avengers Civil War, where Tony sought to compromise with governments who were increasingly intolerant with collateral damage while Rogers refused to do so believing it would inhibit the Avengers' response time, eventually causing him to become a fugitive. Rogers nevertheless still cared for Tony and did not desire for them to fight, as he pleaded with Tony to stop attacking Bucky as Bucky did it without having control and did not kill him after beating him, even going as far as to send him a letter to apologize and a phone so Stark can contact him. He was visibly ashamed when Tony furiously demanded he tell the truth of his parent's death and felt enough sympathy and remorse for keeping the truth hidden that he relinquished his shield and returned it to the Stark family. Two years later, after much of the anger between the two factions of Avengers had died down, Rogers outright referred to Iron Man as Earth's \"greatest defender\", even joking that he himself was a poor substitute emphasizing the respect he maintained for Tony.\n", "While Captain America's sense of duty exceeds his personal feelings, his sense of loyalty is difficult to surpass. After realizing the Winter Soldier was his long thought to be a dead best friend, he only fought him to disable HYDRA's Helicarriers. However, once the Helicarriers were destroyed, he immediately stopped fighting the Winter Soldier in an attempt to reason with him and help him remember their friendship. This reached its apex in the Avengers Civil War where Steve steadfastly refused to give up on Bucky which caused the Avengers to fracture along with more than half their number to become fugitives.\n", "Since being defrosted by S.H.I.E.L.D., Steve was lost in a world he no longer knew. The world had changed; though technology had greatly advanced, humane morals were constantly being compromised in favor of political expediency. To make matters worse, most of the people he loved from his past were gone, or greatly aged. Even while working with S.H.I.E.L.D. and the Avengers, Steve still had no real life outside of being a soldier. Steve did not know how to belong and strives to uphold his code of honor in this new complicated world. Although he eventually reunited with both Peggy and Bucky, Steve was still a \"man out of time\". However, after the battle against Ultron, Steve finally realized that he was no longer the man he was before he was frozen. Hence, Steve decided to focus his life on just helping people, taking a permanent role as the leader of the second incarnation of the Avengers.\n", "He is very protective of his friends from his past, especially Bucky Barnes, and is willing to go to great lengths to save them, being susceptible to emotional and violent acts to fulfill his goal. He seems to have developed a trust and attraction towards Sharon Carter. During his time with the new team of Avengers, he developed a trust and bond with Black Widow. He also embraces links to his own time often seeing much of Howard Stark in Tony.\n", "He does have a darker side, however, with Ultron noting that Rogers had been a soldier for so long, he subconsciously craved conflict and battles to avoid a civilian life and being forced to confront all he'd lost. Indeed his worst nightmare, caused by Wanda Maximoff, was shown to be the end of the war with people not needing him anymore leaving him with the realization that everyone whom he had ever loved was gone and he was alone. Overall, Rogers is a selfless person but one with a notable blindspot: his childhood friend Bucky Barnes. The last living link to his time, Rogers was willing to do everything to protect him, going so far as to abandon his role as leader of the Avengers and a team player. When Tony called Rogers out on failing the role of Captain America, at the end of their fight during the Avengers Civil War, Rogers abandoned his shield and with it, the identity of \"Captain America\", heeding Tony's point. Even years later, he had made no efforts to reclaim the moniker allowing his uniform to darken and removing the American stars that had once adorned it.\n", "Rogers has a strong dislike for agencies or groups that express control over the individual due to having fought vigorously for his nations' freedom and losing the world he knew for that very reason. This dislike extends to groups of any ideology be they HYDRA or S.H.I.E.L.D.. Rogers himself admits that the Howling Commandos committed less than moral actions during World War II, but it was for the basis that people could be free, whereas Project Insight was using fear to dissuade a security risk before it happens, eliminating the need for a soldier like himself and taking away the people's freedom. The desire for free will heavily influence Rogers' opinion on the Sokovia Accords. He strongly believed that the extravagant politics involved would restrict (or at least hinder) the Avengers' efforts to protect the people of the world, putting him at odds with the very pragmatic Tony Stark on the issue. His opinion on such groups lessened when the Joint Counter Terrorist Centre, locked up Barnes in a cage. In the end, such was his dislike that he cut all ties with them and became a fugitive after the Avengers Civil War. While he still retains his desire to protect the world, continuing to fight against terrorists, he has no desire to be re-acknowledged as a superhero and does not care about the opinions of the governments of the world, as he coldly told Thaddeus Ross that he did not care if the latter disapproves of him defending the world and even went as far as to say he would not hesitate to fight him and the governments if they get in the way.\n"], "personality_quotes": [["\"For as long as I can remember, I just wanted to do what was right. I guess I'm not quite sure what that is anymore.\"", "―Steve Rogers[src]"]], "figure_captions": [], "quote": ["\"I'm not looking for forgiveness. And I'm way past asking permission. Earth just lost her best defender. So we're here to fight. And if you wanna stand in our way... we'll fight you, too.\"", "―Steve Rogers to Thaddeus Ross", "Avengers: Infinity War"], "description": "Captain Steven Grant \"Steve\" Rogers is a World War II veteran, a founding member of the Avengers, and the world's first superhero. Rogers had suffered from numerous health problems, and upon America's entry into World War II, was rejected from military service despite several attempts to enlist. Rogers was the only recipient of the Super Soldier Serum developed by Abraham Erskine under the Strategic Scientific Reserve. Determined to serve, Rogers ultimately volunteered for the Project Rebirth, which enhanced the frail Rogers' body to the peak of human physicality. Mistrusted by Colonel Chester Phillips, the head of the SSR, Rogers was relegated to propaganda campaigns, and was given the new moniker of Captain America. Rogers later joined the war with a combat role after he single-handedly liberated captured Allied prisoners of war. \n"}