{"id": "Carol_Danvers", "name": "Captain Marvel", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Carol_Danvers", "personality": ["Carol Danvers is a extremely stubborn and rebellious person who always want to prove herself. Due to being told what to do or what her limits are her entire life, Danvers has a tendency to act reckless when attempting to do something, which often results in causing accidents because she tried too hard. Having been repeatedly underestimated her entire life due to being a woman, Danvers never backs down from a challenge. Danvers notably possesses a sassy and dry wit. Danvers is ultimately a very determined person, as though she often gets frustrated whenever she fails to do something, she always stands up again and never gives up.\n", "Upon being kidnapped and misled by the Kree into becoming their soldier, Vers was completely indoctrinated into the teachings of the Kree Empire, firmly believing them to be noble warriors while also believing the Skrulls to be an evil plague. Even though she lost her memory due to the explosion that gave her powers and abilities, some of Danvers' traits remained within Vers, most notably her tendency to let her impulsive nature get the better of her.\n", "Once she returned to Earth and recovered from her amnesia, Danvers felt both guilt over her actions against the Skrulls and anger towards the Kree, believing that she needs to undo the wrongs she had committed and stand up against the Kree. However, Danvers still retained some degree of respect for Yon-Rogg despite everything he did to her, as she chose not to kill him and instead sent him back to Hala with the warning that Danvers will expose the truth about the Kree's manipulative empire.\n"], "personality_quotes": [["\"You were the woman on that black box, risking her life to do the right thing. My best friend, who supported me as a mother, and as a pilot when no one else did. You were smart and funny, and a huge pain in the ass. And you were the most powerful person I knew, way before you could shoot fire from your fists.\"", "―Maria Rambeau to Carol Danvers[src]"]], "figure_captions": [], "quote": ["\"I'm coming to end it. The war, the lies, all of it.\"", "―Captain Marvel to Yon-Rogg", "Captain Marvel "], "description": "Captain Carol Danvers, also known as Captain Marvel, is a former United States Air Force pilot who, upon being exposed to the energy of the Tesseract, obtained cosmic powers. She was made into a Kree-Human hybrid via a blood transfusion from Yon-Rogg, while having her memories removed, turning her into the Kree's weapon and a member of Starforce. During the the Kree's war with the Skrulls, Danvers returned to Earth and began recalling her past, with help from Nick Fury as well as Maria Rambeau. Danvers also discovered that Yon-Rogg had been manipulating her for years, learning from Talos that the Skrulls were merely seeking to find a new home. With this information, Danvers unlocked her true powers and defeated the Kree invasion onto Earth that was being led by Ronan the Accuser, before setting off out to the far reaches of the galaxy to finish what her late mentor Mar-Vell had once started.\n"}