{"id": "Carol_Danvers", "name": "Captain Marvel", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Carol_Danvers", "personality": ["Carol Danvers is extremely stubborn and rebellious, to the point of her not liking being told what to do or what her limits are. Danvers has a tendency to act reckless, which often results in causing accidents. Having been repeatedly underestimated her entire life due to being a woman, Danvers never backs down from a challenge. Danvers notably possesses a sassy and dry wit. Danvers is ultimately a very determined person, as though she often gets frustrated whenever she fails to do something, she always stands up again and never gives up.\n", "Upon being kidnapped and misled by the Kree into becoming their soldier, Vers was completely indoctrinated into the teachings of the Kree empire, firmly believing them to be noble warriors while also believing the Skrulls to be an evil plague. Even though she lost her memory due to the explosion that gave her powers and abilities, some of Danvers' traits remained within Vers, most notably her tendency to let her impulsive nature get the better of her.\n", "Once she returned to Earth and recovered from her amnesia, she felt both guilt over her actions against the Skrulls and anger towards the Kree, believing that she needs to undo the wrongs she had committed and stand up against the Kree. However, Danvers still remained some degree of respect for Yon-Rogg despite everything he did to her, as she chose not to kill him and instead sent him back to the Kree with the warning that Danvers will stop their manipulative empire.\n"], "quotes": [["\"You were the woman on that black box, risking her life to do the right thing. My best friend, who supported me as a mother, and as a pilot when no one else did. You were smart, and funny, and a huge pain in the ass. And you were the most powerful person I knew, way before you could shoot fire from your fists.\"", "―Maria Rambeau[src]"]], "figure_captions": []}