{"id": "Claire_Temple", "name": "Claire Temple", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Claire_Temple", "personality": ["Claire Temple is a highly compassionate woman. Upon seeing an injured masked man in her garbage, she did not hesitate to take him in and care for him. She went to similar lengths to help Luke Cage when he was seriously injured and on the run despite both of the men being complete strangers to her. Temple is often practical, down-to-earth and sarcastic.\n", "Whilst her lack of powers or special abilities could make her a liability, Temple makes up for this with her medical background and humanity. When meeting with Matt Murdock, Jessica Jones, Luke Cage and Danny Rand, she has helped them through their most turbulent times and acted as their moral compass. Effectively, Temple is the human nature of the Defenders and, in an indirect way, is responsible for the formation of the group. Eventually instead of fighting it, she accepted that assisting people with powers was her calling in life. Due to her unbending sense of right and wrong, Temple has been there when Murdock, Cage and Rand came close to breaking their own code as she knows the line between a hero and vigilante is a thin one. Therefore, she advised Murdock to not kill Fisk if he got the chance to, stopped Cage from suffocating an injured Rafael Scarfe and warned Rand about the repercussions of taking a life. The one time she was not successful was when Jessica broke the neck of Kilgrave. However, Temple is not without a dark side. She expressed satisfaction that Vladimir Ranskahov would feel excruciating pain when Murdock cauterized his gunshot wound after he ordered her kidnapping, assisted Daredevil in torturing Semyon and told Noah Burstein that if he did what he did to Cage, she would cause him serious injury.\n", "Perhaps due to her lack of powers, Temple has chosen to learn martial arts from Colleen Wing. She eventually became skilled enough to fight with members of the Hand in China and Wing claims that she is one of her most advanced students.\n"], "quotes": [["\"I got robbed. Some guy stole my bag. I had to whoop his ass.\"\"What were you thinking?\"\"I was thinking that I wanted my bag back.\"\"He could have killed you!\"\"Mami, please. I grew up here. If you don't fight back, they make you into a doormat.\"", "―Claire Temple and Soledad Temple[src]"]], "figure_captions": []}