{"id": "Collector", "name": "Collector", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Collector", "personality": ["Throughout the universe, Taneleer Tivan has amassed the largest collection of an interstellar variety, through the use of illegal dealings or other, sometimes immoral means; the contents of the collection, while harmless, is also composed of dangerous, even planetary-destructive relics and unlawfully imprisoned sentient beings, who were either made a part of his collection just to fulfill a desire to have them or as a punishment.\n", "Tivan also has a preoccupation with the Infinity Stones, as evidenced by his expressing a desire to obtain all six of them. Whether he has expressed this desire for megalomaniacal purposes, or simply an extension of Tivan's desire to amass the most powerful objects in the universe for his collection remains to be seen. The way he states this desire, however, after coming into the possession of the Aether just after Sif and Volstagg leave his presence, may imply a sinister design at hand.\n", "Towards clientele or business partners, Tivan has an affable and somewhat gentlemanly side, such as kissing Gamora's hand upon meeting with the Guardians of the Galaxy. Beyond this, he can be just as equally cruel. This is displayed by the relationship he has with his servant, Carina, and her fearful demeanor around his presence. Likely viewing anyone in his servitude as an extension of his own collection, Tivan abused her to the fullest, since he had also imprisoned his previous servant and threatened to do the same to Carina over the slightest hint of disobedience. It was this that drove her to attempt to use the Infinity Stone to break out of Tivan's servitude, which resulted in the Stone killing her and destroying his collection simultaneously. \n", "His relationship with his brother according to Thanos was not good, saying he'd be willing to sell him out if it meant adding something to his collection.\n", "Nevertheless, Tivan has an honorable side and will follow through on any deal, no matter the price. He seems to respect Groot's species and expressed a desire to buy his corpse, but would only add him to his collection after his death, as opposed to several other living subjects Tivan imprisoned in his collection.\n"], "personality_quotes": [["\"Everyone in the galaxy knows you'd sell your own brother, if you thought it would add even the slightest trinket to your pathetic collection.\"", "―Thanos to the Collector[src]"]], "figure_captions": [], "quote": ["\"I present to you, Taneleer Tivan, the Collector!\"", "―Carina", "Guardians of the Galaxy "], "description": "Taneleer Tivan, also known as the Collector, is the keeper of the largest collection of interstellar fauna, relics and species in the galaxy, operating from the Knowhere port installation. Through his dealings with Asgardians and the Guardians of the Galaxy, he was in possession of one of the Infinity Stones and was nearly able to obtain a second stone. However, this caused Thanos to attack his museum seeking the Aether.\n"}