{"id": "Deathlok", "name": "Deathlok", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Deathlok", "personality": ["Being chosen for a super-soldier project modified from Abraham Erskine's from the 1940s, Mike Peterson was still presumably a good man at heart. A family man, since his wife left, he loved his son more than anything but he became crushed when an injury caused him to be laid off at work and, in desperation agreed to test the Centipede Project on himself to make ends meet. Though seemingly successful, the negative effects prompted a violent and unpredictable outrage.\n", "Unlike the rest of the subjects, Peterson initially retained his original personality, stablity and hard-working ethics such as rescuing Debbie from her burning lab. Unfortunately due to the haste of revealing Centipede to the public, Peterson had no choice but to return to his old workplace. When meeting with his former boss, he releases so much anger and stress over how he was willing to use men like him as disposable machinery, that he becomes violent which accidentally begins the Centipede Serum's combustion.\n", "Now thinking himself as a hero, he only claims to want to \"look out for the little guys\" against people like his supervisor, going as far to claim that this was his \"origins story\". This is also supported by how he proceeded into an angry rant towards Phil Coulson, S.H.I.E.L.D. and the government workforce in general; expressing how he was always told to remain clean-nosed and do what he was told but was disposed of nevertheless. Although he only attempted to fight against this system, he now believed that Coulson's Team were only there to make an example of him, attributing to his anger. However, he still had enough common sense to listen to Coulson who reminded him of what he was; a hero.\n", "Ultimately, Peterson's love for his son is what caused him to listen to reason, eventually calming himself down from his Centipede-induced rage and joining S.H.I.E.L.D. to hone his newfound enhanced-abilities. However, Peterson became deeply remorseful over his actions, having his son witness him as a monster led him to feel undeserving of his love and cut off connection for as long as possible due to shame. Peterson's love for him was so much that he was prepared to kill or even die for him, when HYDRA also exploited this by kidnapping Ace, he was forced to kill on John Garrett's orders and did such with tremendous regret. When broken free of Garrett's control, Peterson became wracked with guilt again and wished to do further good to make amends for his actions and for Ace.\n", "Peterson has a strong sense of loyalty as he thinly veiled his disgust at Grant Ward for betraying his team. He has a sarcastic sense of humor which Lincoln Campbell observed too when in captivity together.\n"], "quotes": [["\"We're a team. I'd do anything for this little guy.\"", "―Mike Peterson to Skye[src]"]], "figure_captions": []}