{"id": "Doctor_Strange", "name": "Doctor Strange", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Doctor_Strange", "personality": ["Prior to his accident, Strange had a massive ego that fueled his career. Strange only took on patients that he believed would help benefit his status, even refusing to heal a US Army Colonel's back, albeit it was because this injury was a simple one any neurosurgeon can fix. His work was also driven by a desire to control death and time, which led him to refuse even looking into any patient he perceived to have little chance of recovery so as to not ruin his track record. However, if he also perceived the chance a patient could survive, he would help them recover even if it would not benefit his public image, showing that at his core, he does care about saving people. In addition, he seems to prioritize his research over his physician work as he stated his work would save thousands for years to come whereas a physician will only save a handful of patients they directly interact with. This, however, changed after his accident, which left Strange a broken man and constantly frustrated due to being incapable of returning to the life he knew, even blaming Christine Palmer, Nicodemus West and other doctors for ruining his life, not accepting the fact that the accident was because of his carelessness and lack of regard for his safety. Upon visiting Kamar-Taj, Strange initially maintained his narrow-minded arrogance and stubbornly refused to believe that the Ancient One was telling the truth until she forcibly demonstrated astral projection and sent him across multiple dimensions to prove her point.\n", "Strange has shown extreme determination and stubbornness, a useful trait in a doctor as he would never give up on his patients even when one was called dead with a bullet in his brain, Strange was able to determine the patient was still alive to successfully save him. He spent most of his remaining money in seven different surgeries to attempt to heal his hands to the point of near bankruptcy, remained outside of Kamar-Taj's front door for five hours after being initially thrown out, then spent most of his time at Kamar-Taj studying and improving his abilities, even going as far as studying while sleeping through Astral projection. He even allowed himself to be violently killed by countless times by Dormammu until Dormammu gave into his demands and later giving up the Time Stone to Thanos in exchange for saving Stark’s life when he was about to be killed by the Mad Titan despite initially wanting to save the Time Stone first. All of this at the cost of his own life, this made him one of the few people to have earned Stark’s respect.\n", "Through his training with the Ancient One, Strange gained a newfound appreciation for the natural order of things due to his studies of the Mystic Arts and became more humble. However, this was not to say he was a completely changed man; he retained a cocky attitude when dealing with people and things, as seen in how he behaved when he went to borrow books from Wong. This, coupled with his inquisitiveness and willingness to break rules, made him an odd one in Kamar-Taj and constantly an eyesore to many of his peers. However, due to this nature of his, he was also more willing to compromise and be somewhat flexible with his principles, quickly accepting that the Ancient One broke her own rules to do what was deemed necessary to protect the world, and he had to be willing to do so himself, which, when combined with his natural talent in the Mystic Arts, had the Ancient One name him as the new Master of the New York Sanctum, despite his relative lack of training and inexperience.\n", "Having trained as a doctor, Strange is a pacifist and tries to avoid hurting people, as it goes against the Hippocratic oath. He was disgusted by his actions in killing Lucian Aster, stating he became a doctor to save lives, not take them. However, neither the Ancient One nor Karl Mordo were especially sympathetic towards this, with the former stating it was his towering ego and delusion that he could control death itself that made him become a doctor and the latter simply calling him a coward for not having the spine to do what has to be done. Nevertheless, Strange claimed that there were other ways to defeat their enemies, a claim he ultimately proved correct by defeating both Kaecilius and Dormammu without killing either of them.  \n", "Despite coming off as arrogant and genuinely selfish, Strange has, ultimately, has always had good intentions. After his talk with Kaecilius, Strange began to see his own failings reflected in Kaecilius and started showing signs of self-improvement. He repeatedly and genuinely apologized for his past treatment of Christine Palmer and showed a newfound trust in former rival Nicodemus West. During his talk with the Ancient One before her death, he admitted that his fear of failure is what pushed him to be a successful neurosurgeon. However, the Ancient One stated that his fear is exactly what kept him from greatness, as well as learning the simplest and most important lesson of all; it's not about him. Strange took this very much to heart, and when he faced Dormammu, he showed strong selflessness, allowing himself to be killed over and over in order to keep Dormammu trapped in the time loop so mankind could live and came to stop fearing failure.\n", "Despite his tremendous maturity, Strange maintains some of his old habits such as making sarcastic comments and jokes when talking to others, similar to Tony Stark and Peter Quill. Whilst he compensates his lack of experience by further using the powerful magical relics at his disposal and his intelligence allows him to imagine unorthodox solutions to problems, Strange has also learnt to comprehend his limits and despite his success at the hands of Dormammu's defeat, he has begun to realize the natural order should not be entirely disturbed, the same reason why Mordo left the Mystic Arts and vows to never use the Eye of Agamotto until he is fully prepared. This was his second greatest lesson to learn - that time is beyond even his control. He also retains his meticulous and diligence by forming a watchlist of individuals that might pose a threat to Earth. However, his flexibility is his greatest strength in this regard as, even though he wants to be rid of these individuals, he was willing to help Thor locate Odin so he and Loki would return to Asgard. During Thor's visit, Strange was visibly annoyed and wary of the Asgardians, but remained polite towards Thor.\n", "Strange's imagination and intellect have given him a vastly flexible personality, so much so the Ancient One could never see exactly what his future would be, only possible paths he would take. Due to his inquisitiveness, Strange is easily able to adapt and teach himself light years ahead of even experienced sorcerers like Mordo and Kaecilius. Once he started to get the hang of his sorcery studies, he began to teach himself and was able to learn at an accelerated rate.\n", "Strange is noted to have a severe case of misophonia, meaning he is greatly distracted by even the slightest sound when he requires absolute focus. This was shown when he was operating on a patient and asked Nicodemus West to cover his watch as the ticking was distracting him. After his car crash, Strange's hands suffered from constant shaking though unlike Pangborn he refused to direct magic into his body to heal this, presumably to be reminded of his mistakes in the past.\n"], "quotes": [["\"There is a strength to him.\"\"Stubbornness, arrogance, ambition, I've seen it all before.\"", "―Karl Mordo and Ancient One[src]"]], "figure_captions": []}