{"id": "Drax_the_Destroyer", "name": "Drax the Destroyer", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Drax_the_Destroyer", "personality": ["Underneath Drax's brutish appearance, serious demeanor, and seemingly unquenchable murderous rage, due to his quest to avenge his family, belies a sense of honor and a calm mind capable of strategy and refined eloquence. He was capable of elaborated speech filled with vocabulary few would expect someone like him to know when calm, enough to prompt Peter Quill to call him a thesaurus, which he disliked as he did not understand that it was a metaphor. As such, Drax demonstrated many times a severe lack of understanding for metaphors and symbolism, noted to be a trait of his people by Rocket Raccoon.\n", "His rage and hatred for Ronan the Accuser often made him highly impatient with his new teammates when he did not see that they could beat Ronan. This made him act without thinking of the consequences, such as getting Ronan to come to Knowhere in order to fight him, which lead to Ronan obtaining the Orb, nearly destroying his friends, and eventually lead to the Battle of Xandar and near destruction of the planet at Ronan's hands. He felt great remorse towards his rashness and selfishly endangering others for his own vengeance, prompting him to work better with his team. However, his vengefulness then made him want to kill Thanos when he rationalized that Ronan was only a puppet. His wrathfulness, as well as his calm demeanor, also hide his sadness and grief over his family, though Mantis was able to sense and experience it and was driven to tears while Drax remained outwardly unfazed, only showing some somberness.\n", "Despite his calm nature in most situations, Drax's unending hatred for Thanos remains as strong as ever even four years after swearing to kill him and finding solace with the Guardians. Upon encountering an illusion of the Mad Titan on Knowhere his serenity dissipates to the point where he seethes with rage and had to be restrained by Quill and Mantis before he attempted to kill him. Nevertheless, Drax does not associate his hatred with anything related to Thanos such as his daughters in contrast to the Drax that was willing to kill Gamora in the Kyln just to hurt Ronan. When he grabbed Gamora in Knowhere, Drax screamed at Thanos to let her go and bravely charged at him with only two knives despite him being equipped with three of Infinity Stones at the time. Drax later furiously screamed at Thanos upon arriving on Titan, immediately throwing his knife at him without any care that it may not be Thanos or his minion, but someone else and later on unhesitantly and ferociously fought the Titan alongside Doctor Strange. Drax was also in disbelief that Mantis claims Thanos was in mourning on Titan due to his strong belief that he was a monster with no redeeming qualities, which proved to be not entirely correct, as Thanos does have the same (though much more twisted) love for Gamora that Drax felt for his own daughter. \n", "Though his warrior mentality caused him to appear brooding and serious, Drax expressed an immature and childish excitement for battle and adventure and was often thrilled when faced with dangerous and tense situations. As such, he was laughing jovially when fighting guards at the Kyln and when crashing into the Dark Aster with his team. Drax has an uncanny affinity for knives, making them his weapon of choice in most situations, regardless of the size and type of foes he fought unless forced otherwise. It was so well-known that Moloka Dar attempted to appease him by offering Drax his own. Despite this, he was willing to use other weapons, such as the Hadron Enforcer.\n", "Although Drax has grown fond of his teammates, his social skills leave much to be desired as he called Gamora a \"green whore\" when telling her she is his friend along with the rest of the Guardians of the Galaxy. Ironically, he will not hesitate to harm or even kill anyone who insults his friends, as he blasted Nebula with a rocket launcher as she was insulting Gamora, before calmly stating no one could speak to his friends in such a manner. Though unlikely to admit being so, he was shown time and again to have a soft side to him, enough to comfort his friend, Rocket Raccoon, when the latter seemingly lost his friend, Groot.\n", "After the battle with Ronan, Drax attempted to learn more about living as a modern citizen to avoid getting into any more trouble with the law since his records have been expunged. He, in turn, experienced trouble understanding this concept, he asked if he could rip out a man's spine if he annoys him, which Rhomann Dey reminded him was murder, and therefore, illegal.\n", "For Drax, his exploits with the Guardians of the Galaxy have been a journey of renewal. The trauma he suffered after losing his family was so severe that he lost himself to rage and revenge. Yet the new family Drax has found has given him more serenity and allowed him to come to terms with this tragedy and attempted to find peace and calm within himself. In the Guardians, Drax finds an adopted family that share similar experiences of loss and hardship. In particular, Drax finds a daughter figure in Mantis, whom he sees as sharing the same innocence that his daughter once had.\n"], "personality_quotes": [["\"Are you yawning? In the middle of this? While I'm breaking it down? Huh? Did you hear what I said?\"\"I stopped listening after you said \"We need a plan\".\"", "―Iron Man and Drax[src]"]], "figure_captions": [], "quote": ["\"There are two types of beings in the universe: those who dance and those who do not.\"", "―Drax the Destroyer", "Guardians of the Galaxy Vol. 2"], "description": "Drax, also known as Drax the Destroyer, was a former intergalactic criminal and a member of the Guardians of the Galaxy. He sought revenge on Ronan the Accuser for killing his wife and daughter, and went on a rampage across the galaxy, ending with him being imprisoned by the Nova Corps in the Kyln. There, Drax became uneasy allies with Star-Lord, Gamora, Rocket Raccoon, and Groot. Together they broke out of the Kyln and became embroiled in the Quest for the Orb. After the Battle of Xandar, in which he finally exacted his vengeance on Ronan, Drax left Xandar with the other Guardians but not before declaring Thanos as his next target.\n"}