{"id": "Falcon", "name": "Falcon", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Falcon", "personality": ["Sam Wilson is one of Captain Steve Rogers' most stalwart friends and allies. Both men found a kindred spirit in each other when they discovered they both shared common life experiences and had similar values. Sam Wilson and Rogers both fought in the military, had to cope with the deaths of friends during war, and had to adjust to life outside of war. For Wilson, he found purpose in helping military veterans adjust to civilian life. This earned Rogers' respect, and in turn Wilson admires Captain America and the ideals he represents. Their commonality helped the two to forge a bond that led Wilson to aid Steve Rogers in many of his heroic exploits. During these exploits, Sam Wilson becomes a hero in his own right, whether it be when the two are fighting shoulder to shoulder together during a mission to save the world or aiding Rogers with a personal matter, such as helping him find the Winter Soldier.\n", "In contrast to Rogers' pensive no nonsense attitude, Wilson often displays a more brazen attitude and a strong sense of humor, often makes cheeky comments; he jokingly tells Rogers to come by the VA to make him look good in front of a girl at the desk, and nods in approval when Rogers and Sharon Carter kiss. However, similarly to Rogers, Wilson is also a hardened soldier who, during battle, believes strongly in focusing on the job at hand, bluntly telling Spider-Man that during fights people don't tend to talk much when his adversary started admiring his EXO-suit. Some of Wilson's hardened attitude comes from losing his wingman, Riley, which led to him leaving the military. In addition, he also takes great pride in his work, both when he helps veterans who suffer from PTSD and his work as Falcon, and is visibly embarrassed following his defeat at the hands of Ant-Man, though later jokes about this at their next encounter.\n", "Unlike many of his teammates, Wilson doesn't hold grudges and believes in forming his own opinions of others instead of going by what others think. He respects Scott Lang following their initial meeting despite much of the public believing him to be nothing more than a common criminal, and following their battle at Leipzig airport is the only one of Rogers' captured teammates who doesn't show any ill will toward Tony Stark when he visits his former teammates and admits to Wilson that he was wrong, suggesting the two of them both understand why the other did what they did and still hold some mutual respect for one another.\n"], "quotes": [["\"Some stuff you leave there. Other stuff you bring back. It's our job to figure out how to carry it. Is it gonna be in a big suitcase, or in a little man-purse? It's up to you.\"", "―Sam Wilson[src]"]], "figure_captions": []}