{"id": "Foggy_Nelson", "name": "Foggy Nelson", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Foggy_Nelson", "personality": ["Nelson is witty, fun-loving, and sociable, yet intelligent and professional when the situation demands it. Matt Murdock and Nelson have been best friends since college. Murdock appreciates that Nelson doesn't treat him like he's fragile and Nelson appreciates Murdock seeing him as an equal and hearing about the beautiful women entangled in Murdock's love life. The two friends were determined to start their own law firm and make a difference in Hell's Kitchen. Nevertheless, Nelson is the more pragmatic of the duo and thinks that they should take cases that actually pays the bills while Murdock wants to take cases that defend only the innocent.\n", "Nelson disapproves of Daredevil's vigilantism and thinks that justice should be done in court. Ultimately though, Nelson's priority is whatever is best for the people of Hell's Kitchen, to the point where he gave Murdock his Daredevil suit so that he could save the city once again.\n"], "personality_quotes": [["\"You seem like a decent guy, Mr. Nelson. You care about people. About doing the right thing.\"", "―Ray Nadeem[src]"]], "figure_captions": [], "quote": ["\"People have bailed on Matt his whole life, and I'm not gonna be one of 'em. You do what you want, but that's not the kind of friend I wanna be.\"", "―Foggy Nelson to Karen Page", "The Devil You Know"], "description": "Franklin Percy \"Foggy\" Nelson is a lawyer and the best friend of Matt Murdock. He co-founded the law firm Nelson and Murdock with his best friend and worked on cases with a passion for getting justice for the innocent including Karen Page and Elena Cardenas. Nelson remained loyal to Murdock even after discovering that Murdock had been living a secret life as a masked vigilante known as Daredevil. However, the revelation continued to have an impact on Nelson and Murdock as Nelson became more frustrated with his friend as Murdock's double life began to interfere with their case defending Frank Castle. Eventually, Nelson decided to leave their law firm and took a job at Hogarth, Chao and Benowitz. Upon learning of Matt's survival and Wilson Fisk's release from prison, he decided to run for District Attorney to help keep Fisk behind bars.\n"}