{"id": "Gamora", "name": "Gamora", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Gamora", "personality": ["Gamora, throughout most of her life, has been molded into a living weapon and the only family that she knew and raised her are the people she considered enemies. Because of her assassin background, Gamora can be stoic, distant and merciless to her foes or targets. Her reputation as the most deadly woman in the galaxy precedes her, as Rocket Raccoon states \"anyone who is anyone knows who [Gamora] is\". Whilst she was an equal level of criminal to the rest of her teammates when they first met, Gamora valued honor greatly and held Star-Lord with disdain for being an dishonorable thief alone. However, she was willing to work with the Guardians of the Galaxy to escape the Kyln and sell the Orb though she was monumentally irritated by them, Drax in particular.\n", "During combat, she can be aggressive and ruthless due to her tendency for war cries and her willingness to kill without restraint. However, she will often use strategy to avoid murder when possible such as flirting with Quill so to steal the Orb from him without fatal means, only resorting to killing when it became clear that Quill wasn't going to surrender without a fight or the fact that he might sell it to someone dangerous like The Broker or Ronan if he managed to escape. Within the Kyln, Gamora was almost killed by Drax and Moloka Dar but she only restrained them instead of killing them and non-lethally incapacitates the guards when they were trying to escape.\n", "Her brutal training by Thanos could have turned her into someone like her sister, Nebula but by comparison Gamora is extremely caring. When she discovered the Orb's destructive power, she didn't hesitate to surrender it to the Nova Corps despite the threat of arrest and angrily chastising Quill for attempting to sell it. Despite her hatred to everyone connected towards Thanos as well as her rivalry towards her sister and her attempts to kill her earlier, Gamora consoles to her and genuinely cares for her. Throughout of all their altercations, Gamora would always try to reason with Nebula and held back so as not to kill her. However, during childhood she was too self-focused with her own survival that she didn't seem to care about what happened to Nebula when Thanos would torture her for losing against Gamora in combat, something which Gamora didn't even realize until adulthood and shows remorse for this but defends this by saying that she was a child like Nebula and scared for her own life. Her love for Nebula was shown when she quickly gave in and told Thanos the Soul Stone is on Vormir when she saw Nebula tortured.\n", "Gamora hates Thanos for ruining her childhood and massacring half of her people. She even went as far as to lie that Thanos killed her parents in front of her while it was not the case and Thanos actually gently kept her from seeing it. When they reunite, despite Thanos's kind attempts to reconcile with her, Gamora bitterly rejected everything and did not hesitate to express her profound hatred for him. However, despite all of this, Gamora does still love Thanos as a father to some degree but could not bring herself to admit it and created the lie to justify her hatred for Thanos, as she still cried when she seemingly killed him and Thanos himself said that he knew she still cared for him deep down. While she was quick to attempt suicide to prevent Thanos from obtaining the Soul Stone, Gamora was genuinely shocked and seemed almost happy after learning that Thanos genuinely loved her as his daughter and the fact she had to die for him to complete his mission deeply shocked and devastated him for a brief moment before she tried to kill herself. Thanos also said that she once had the same will as he has as she fought alongside him, implying that she at first did have some dedication to Thanos's cause until she saw him for what he was and turned against him. It could also be possible that she initially believed in his goal to balance the universe by killing half its population to be the right thing until she began to disagree with it. \n", "Unlike the other Guardians, Gamora lacks the comical quirks and deep-seated personality issues giving her a more serious and deadly personality. However, like Drax, Gamora is ignorant towards Quill's Earth lingo and pop references. She also doesn't understand figures of speech because she believed that \"having a stick up your butt\" which was another way of saying one was uptight was literal and considered it cruel. During a few months with the Guardians, Gamora's hardened personality has begun to vanish. She took the time during a fight with the Abelisk to wave at Groot, becoming an almost mother-figure to him and dancing with Quill on Ego's planet despite previously claiming not to dance. Gamora later consoled him about Yondu Udonta's death and hinted to having romantic feelings for him. However, she still has an aggressive edge, threatening to break the jaw of Mantis if she touched her (presumably because she didn't want Drax or anyone to know about her attraction to Quill). She eventually confessed that she loved him more than anything when she asked him to kill her after Thanos had grabbed her.\n", "Gamora's selflessness was shown by the fact that she was willing to let Star-Lord kill her to prevent Thanos from learning the location of the Soul Stone and later quickly and desperately attempted suicide to prevent Thanos from acquiring the Stone.\n", "After being sacrificed by Thanos, Gamora's soul trapped in the Soulworld showed a more defeated side, seemingly being the only hero who humbly accepted Thanos's victory, as when Thanos came to her, she bore no ill will towards him and calmly asked if he did it. She even showed a softer side when he solemnly replied that achieving his goal needed him to sacrifice her, sadly smiling as if to comfort Thanos.\n"], "quotes": [["\"I have spent most of my life surrounded by my enemies. I will be grateful to die among my friends.\"", "―Gamora[src]"]], "figure_captions": []}