{"id": "Grant_Ward", "name": "Grant Ward", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Grant_Ward", "personality": ["Grant Ward, while infiltrating S.H.I.E.L.D., generally had a bad temper but was able to stay calm and collected during sticky situations. He was slightly anti-social with strong morals and was known to be \"deadly\". On his days off, however, he enjoyed a nice book or even singing along to his favorite West Side Story song. As time progressed, Ward seemed to soften somewhat, developing friendships with his fellow Agents, which was eventually cemented upon rescuing Jemma Simmons after she jumped from the Bus. Ward did not seem overtly interested in relationships but for a time had a purely sexual relationship with Melinda May. However, when he began to develop feelings for Skye, this arrangement ended.\n", "In reality, Ward was a master manipulator, who was able to adjust his personality in order to gain the trust of others. While he still managed to retain a calm and collected personality, he had very little of the loyalty or morals that he previously demonstrated. His only loyalty was to John Garrett, to whom he claimed to owe everything. He did seem to have some reservations about Garrett's actions. Beyond that, he seemed more than willing to work against Phil Coulson and his team. However, when Raina pointed out that Coulson was a good man and asked him if he owed something to a man like that, Ward admitted that he did owe Coulson something, but he owed Garrett everything. At the same time, he could not bring himself to directly murder Leo Fitz and Jemma Simmons and instead ejected them into the ocean.\n", "During his imprisonment, Ward evolved to being his own person, as he was previously restricted by his almost blind loyalty towards Garrett, to the point of even ignoring his own desires. Ward became more remorseless and manipulative as he demonstrated when he knew Skye's pressure points and attempted to use his knowledge of her father to exploit them. He also murdered numerous guards during his escape and his brother and his parents as revenge for the years of abuse they put him through. When he was reinstated as a member of HYDRA he still continued to aid S.H.I.E.L.D. to re-earn their trust, particularly Skye's, but this ultimately ended when she and Simmons attempted to kill him on separate occasions. As a result, he grew a far darker personality and sadistic tendencies, as shown with the kidnapping of Bobbi Morse and torturing her in order to give Kara Palamas the closure she needed. When he was tricked by Melinda May into killing Kara Palamas, that was the last straw for Ward; he vowed revenge against S.H.I.E.L.D. and was willing to join HYDRA as its new leader into order to gain \"closure\". \n", "As the new head of HYDRA, having killed Kara and lost all connections to the team, Ward had effectively severed all ties to his humanity and whatever form of conscience he retained before had been erased. Now his only goal was to make S.H.I.E.L.D. and Coulson suffer as much as he had. Presumably because of this campaign to rebuild HYDRA, Ward had also become more arrogant and narcissistic. He was dismissive of the previous generation of HYDRA, believing their greed was what led to the organization's collapse. When he recruited Werner von Strucker, he assumed that after one act of savagery that the boy could murder Andrew Garner, an act that caused Gideon Malick to chastise him. Even with his dark personality, Ward cared deeply for his younger brother, Thomas; after fifteen years separated, Grant still loved him. When Coulson had Hunter point a gun to Thomas's head, Grant swore that he would cut Fitz from head to toe if they hurt him.\n", "Ward realized his life had gained a purpose during his mission to bring Hive back to Earth as Gideon Malick's second in command of HYDRA. He reflected on how he lived his life, how he joined HYDRA and what his motives were for it, from a father figure, to vengeance, to closure. After looking back and thinking of how things were at that point, and that the fact he was chosen for this mission, he felt that for the first time, that his life was important for something. He actually felt loyal to the HYDRA organization rather than any individual HYDRA operative, and even spoke the words \"Hail HYDRA\" as a way of accepting his purpose.\n", "Hive states, months later and after possessing Ward's body that his final memories were that he was almost glad to be dead. This insinuates that despite his relentlessness, he secretly wished to end his pain and suffering having finally undergone a life of turmoil, from his family, to Garrett, to Kara and was ready to be killed.\n"], "quotes": [["\"That straight version of you is something else. I don't even think Romanoff could pull that one.\"", "―John Garrett[src]"], ["\"See, I've seen the real Grant Ward, the one buried deep inside. He's a coward who always has an excuse or someone else to blame.\"", "―Bobbi Morse[src]"]], "figure_captions": []}