{"id": "Groot", "name": "Groot", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Groot", "personality": ["Groot is usually very gentle and warm, displaying kindness towards innocent life. His child-like personality often causes him to be distracted and simple-minded, such as by a water fountain that he kept drinking from in public while Rocket was trying to talk to him and then trying to deny it. He tends to not listen to plans and goes off to tackle threats on his own, such as when he wandered off from Rocket to remove a power source in the Kyln without listening to the full plan and missing the fact that it needed to be taken last.  \n", "During intense or serious situations, Groot is sometimes smiling gleefully, such as when he and Rocket where trying to abduct Peter Quill on Xandar or after impaling several Sakaarans on his vines and angrily thrashing them around a hallway for several seconds. He is loyal to Rocket and the other Guardians, and was even willing to die to protect them, as shown in the Battle of Xandar. However, he can also be merciless and savagely brutal towards his enemies, especially if they threaten his friends, as shown when lifted an inmate on the Kyln into the air by his nose to cause him enough pain to leave him sobbing on the floor, all just because he got in the way of himself and Rocket and threatened Quill, who was their bounty.\n", "As a baby, Groot could be shown to misinterpret simple requests such as bringing Yondu a prototype for his weapon and knowing which button to press to activate a bomb that would kill Ego's consciousness. He enjoys listening and dancing to music, even while his friends were battling the Abilisk. As a baby, Groot is deeply affectionate and seeks the company and comforting arms of his friends, sometimes falling asleep on their shoulders like he did with Drax. Despite this, he retains his savage and violent nature, as shown when he would regularly attack small creatures and angrily attacking and sending Retch falling to his death in revenge for being abused by him. He also attempted to attack Drax twice, once for bumping into him and another time for crashing into a stereo that was playing a song he was dancing to, though his small size made his strikes unable to even faze Drax anyway.\n", "He also has used curse words before and could use them adamantly, but Rocket could just leave them out in his translation of Groot to the other Guardians.\n", "As an adolescent, Groot displays the typical behavior of a human teenager, such as being rude, making a mess of his own space and getting obsessed with playing video games. Unlike his father, he hardly smiles and seems to be unaware of his surroundings most of the time. He frequently snaps at his guardian companions when he gets told off, resulting in them, notably Rocket and Peter murmuring about how they miss the old Groot and how annoying the new Groot is. Nevertheless, Groot's loyalty to his companions remain as strong as ever and he staunchly stands by them during fights, fully retaining his old courage and headstrong nature. He even went as far as to resist the pain of the newly heated pieces of Stormbreaker and sacrificed his arm to create the axe without hesitation. He also seemed to look up to Rocket, referring to him as \"Dad\" in his native tongue as he faded away.\n"], "quotes": [["\"I am Groot.\"\"So what it's better than eleven percent? What the hell's that got to do with anything?\"Thank you, Groot. Thank you. See, Groot's the only one of you who has a clue.\"", "―Groot, Rocket Raccoon and Peter Quill[src]"]], "figure_captions": []}