{"id": "Hank_Pym", "name": "Hank Pym", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Hank_Pym", "personality": ["Hank Pym is a multi-faceted man, a passionate scientist who did not wish to see his work fall into the wrong hands. Pym was also a caring father and husband; however, once his wife, Janet van Dyne, sacrificed herself to save the world from a soviet ICBM, Pym became colder and distant. He sent his daughter Hope off to boarding school in order to protect himself and his young daughter from their loss.\n", "Pym has an aggressive side and a tendency to lash out when provoked. When he was insulted by S.H.I.E.L.D. Head of Defense Mitchell Carson about not being able to protect his wife, Pym smashed Carson's face into the desk to the point where his nose bled and threatened him should he mention his wife ever again. This also happened with Darren Cross when Pym found out about Cross wanting to sell Pym Particles to a terrorist organization. He was willing to destroy Pym Technologies to keep his technology out of the wrong hands, though he showed concern for the people inside and planned for it to be evacuated, despite leaving at least some of Cross' men and knocked out terrorists inside when the building was destroyed.\n", "Pym is extremely overprotective of his Pym Particles and distrusts anyone who shows interest in them, due to being concerned that the Pym particles would change the nature of warfare and thus the world. During his time at S.H.I.E.L.D. he refused to let anyone use the Ant-Man suit and Pym particles except for himself. He immediately quit S.H.I.E.L.D when he found out they attempted to copy the Pym Particle. When he found out Cross was close to replicating his formula, he immediately plotted to steal Cross' Yellowjacket suit and destroy his own former company to prevent Pym Particles from being sold. Pym even fired Bill Foster for attempting to steal his work and also Elihas Starr for the same reason during his time at S.H.I.E.L.D. According to Foster, Pym had much of an ego during his career. Pym also has a habit of pushing everyone away because he's so cynical. He even cut ties with Lang when he accidently made them fugitives for helping Captain America.\n", "This distrust seems to be even higher towards the Stark family, as Howard Stark had been experimenting with Pym Particles. When Scott Lang asked to bring in the Avengers to help with Cross; Pym replied that he had spent much of his early life keeping Pym Particles out of the hands of Howard Stark and he would not let it fall into the hands of Stark's son Tony. Pym also believes in second chances and redemption, such as Scott Lang, for example.\n", "It should be noted that even before he had hope that Janet could still be alive, Hank never attempted to move on and love again. This shows a positive quality of Hank; he was true and faithful to the woman he loved.\n"], "personality_quotes": [["\"Hank was a terrible partner. Temperamental... stubborn, impatient. Sooner or later, he just pushed everyone away.\"", "―Bill Foster[src]"]], "figure_captions": [], "quote": ["\"This is your chance. To earn that look in your daughter's eyes. To become the hero that she already thinks you are. It's not about saving our world, it's about saving theirs. Scott, I need you to be the Ant-Man.\"", "―Hank Pym to Scott Lang", ""], "description": "Doctor Henry Jonathan \"Hank\" Pym was an entomologist and physicist who developed the Ant-Man Suit after discovering the Pym Particles. For a time, he worked for S.H.I.E.L.D. as a consultant and became the first Ant-Man. Later he formed his own company, Pym Technologies, and passed the title of Ant-Man down to Scott Lang when his own former protégé Darren Cross replicated the Pym Particle and attempted to sell his technology, the new Yellowjacket Suit, to the notorious paramilitary terrorist organization known as HYDRA. Thanks to his recruitment of Lang to stop Cross, and Lang’s successful escape from the Quantum Realm, Pym came to terms with losing his wife Janet van Dyne to the said realm years earlier, because he thought she could be alive in there.\n"}