{"id": "Happy_Hogan", "name": "Happy Hogan", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Happy_Hogan", "personality": ["Hogan was Tony Stark's constant companion. He also acted as Stark's \"pre-screener\" when Stark was womanizing.[7] An example of this was when he described reporter Christine Everhart as \"cute\".[5]\nHogan initially was annoyed by and ignored Peter Parker by not replying to his messages and being rude to him even when Parker was serious about Adrian Toomes actions. He later apologized to Peter for not taking him seriously and thanked him for saving his job.\n"], "personality_quotes": [["\"Since you've taken the post...\"\"You don't have to thank me.\"\"We've had a rise in staff complaints of three hundred percent.\"\"Thank you.\"", "―Pepper Potts and Happy Hogan[src]"]], "figure_captions": [], "quote": ["\"Let me tell you something. Do you know what happened when I told everyone I was Iron Man's bodyguard? They would laugh in my face. I had to leave while I still had a shred of dignity.\"", "―Happy Hogan to Tony Stark", "Iron Man 3"], "description": "Harold Joseph \"Happy\" Hogan is one of Tony Stark's closest friends and his personal chauffeur who formerly worked as his personal bodyguard and Head of Security of Stark Industries. He was almost killed during Aldrich Killian's War, which motivated Stark to get revenge on the Mandarin, who he believed was behind Hogan's injuries. After his recovery, Hogan continued to faithfully serve as Stark's friend and employee. He oversaw Stark's mentorship over Peter Parker/Spider-Man, aiding the young hero on his trip to Germany and acting as their liaison when Parker continued his superhero activities. Hogan, however, was irritated by the boy and avoided his duties with him. After Parker defeated Vulture to prevent the cargo in which Hogan kept certain valuable items to be transferred to the New Avengers Facility from getting hijacked, the young hero earned Hogan’s admiration and respect.\n"}