{"id": "Hawkeye", "name": "Hawkeye", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Hawkeye", "personality": ["Clint Barton is a brave operative with a deadpan focus; dedicated to his job of protecting the innocent. Through his years of being with S.H.I.E.L.D., Barton had made himself one of their best soldiers, tacticians and marksmen, and had shown great loyalty and dedication to whatever his objective is, and always gets the mission done, as he will fight until the end and then keep fighting. However, despite this commitment, Barton has proven himself to be a maverick, disobeying orders in order to do what he believes is right as well as seeing through whatever he does his own way. When Phil Coulson gave Barton orders to use a gun to take aim at Thor but he chose to grab a bow, his signature weapon, as he knew that he is at his best with it. \n", "Though commonly misjudged and underestimated as one of the most under-powered Avengers, with his ability to blend in with his environment, his stoic professionalism, and ability to see and assess from afar, Barton is often valued by his superiors for his ability to keep an eye on people and assess situations. For this, he was able to stay alert and level headed during the Battle at the Salvage Yard and not succumb to the affects of the Scarlet Witch, unlike the other Avengers, who were easily subdued due to their more reckless approach. It is because of this that Barton can even understand when he is outmatched and accept it and use his skills to benefit him. When he went to rescue Wanda Maximoff, he knew that he could not defeat the Vision, despite placing traps to stop him, but instead had Wanda defeat him. During the Avengers Civil War, Barton also understood that in order for them to win, some of them had to sacrifice themselves and be arrested, including himself. \n", "For Barton, this is not a tough call, as he is willing to sacrifice himself for what is right. That is why he went back to save a Sokovian boy who was missing, even though Barton himself was safe from the near destructing country, because for Barton, he needs to make sure that everyone is safe no matter how the fight is going. So even though there was a massive army of aliens attacking, Barton went to rescue a bus filled with civilians who were trapped, rather then fight them off with Black Widow.\n", "Despite his professionalism and approach to missions, Barton is a humorous and often sarcastic person and is able to not take things too seriously, even in the midst of battle where he can sometimes be overwhelmed. Whether it be fighting aliens, robots or even fellow Avengers, Barton will constantly make a joke or bring levity to a situation, mainly when he is fighting alongside his best friend and partner, Black Widow, one of the few people who not only understands Barton’s level of banter, but also keep up with it, as seen in the Battle of New York where both of them make jokes about the situation and as well as each other. \n", "Barton’s humor is occasionally used to compensate for Barton being overwhelmed in situations that include people like Thor, a literal god. However, despite his ability, or lack there of, Barton is respected and valued in the Avengers, being seen as equal to them, being able to confidently express doubt about Thor’s hammer, but also open to be made fun of, all in good sense as they are all friends. However, Barton is mainly the one who makes the jokes at a constant, even in moments of pain, seriousness or conflict, such as the Avengers Civil War. For this, Barton is seen as the jokester of the team.\n", "Because of this, Barton can sometimes be seen as more immature then the other Avengers, as well as being cocky and always feels the need to be competitive with anyone who acts as a challenge. When he was easily bested by the enhanced Quicksilver, Barton then happily participated in a rivalry with him, despite it being childish as he is much older and supposably maturer then then the adolescent. He also uses his perfect aim to show off, such as hitting a moving target without looking, especially towards those who appear to be more powerful or better then him, mainly Tony Stark. While Stark causally threw darts, Barton decided to hit the bullseye with three darts at the same time, right next to Stark’s head, disarming the usually confident and always in control billionaire.\n", "He is also seen to be very revengeful and does not take kindly towards being betrayed or manipulated. After regaining control from Loki’s influence, Barton was then motivated to fight by the thought of killing his former enslaver. During the battle against Loki, even though focusing on protecting others and stopping the attack, Barton seized the moment to get revenge by exploding an arrow right next to the God of Mischief, defeating him. However, Barton is not as immature when the person who wrongs him is someone he trusts. For Barton, trust is very important, but when Stark, a man who Barton was good friends with and even revealed his secret family to him, had a hand in fighting against and arresting him, Barton became furious and lost his respect for him, even to label him as someone who can never be trusted.\n", "Uniquely, Barton is quite compassionate for an assassin, as he sees the good in people and who they could be, rather then who they were. For this, Barton is seen as a better man, then a good soldier. When he was ordered to kill Black Widow, he made the call to spare her, recruiting her for S.H.I.E.L.D., and developing a great friendship with her, while others would only see her as a merciless assassin, beyond redemption. From this, Barton developed a strong partnership with Romanoff, caring for her deeply at all times, as seen when he would go to check on her when she was affected by Wanda and frustrated when Ultron captured her, causing him to not stop searching for her. This is also seen with Wanda Maximoff, who he inspired to do good and fight with them against Ultron. Since her brothers death, ultimately saving Barton, he has felt some responsibly towards Wanda, him being a father figure towards her, guiding her and making sure she does what is right.\n", "This is because Barton is a very loyal, caring and dedicated person who would do anything for the people he cares about. But the most important people in his life, are his family, who are very supportive in his role as an Avenger. Being a loving husband and father, Barton thinks about his family before a battle, motivating him, and would call them afterwards to tell them he is fine. However, because he cares so much about them, he decides to retire to be with them. Although, if he was ever needed, Barton would also go to help his friends if they needed him, especially Wanda. Barton being a compassionate person and a family man go hand in hand with each other, and is what separates him with the other Avengers. It is the experience of being a husband and a father that makes him the soldier, Avenger and man he is.\n", "Barton’s place on the Avengers can be misconceived, with him not having any powers, but in fact he is incredibly vital to the teams unity. As the other members either have extraordinary powers or are beings beyond human, Barton in fact grounds the team, and makes sure that they stay focused and helps them to be better. However, despite this, Barton still can seem very overwhelmed by the other members. However he does not let that stop him. Barton is able to address the absurdity of his situation, such as fighting against an army of robots with a bow and arrow, but keeps fighting anyway. From this, Barton is able to understand his place amongst the Avengers, usually taking a high vantage point, assessing the situation, and keeps up with the Avengers, showing to be confident in his place.\n"], "quotes": [["\"Okay, look, the city is flying, we're fighting an army of robots, and I have a bow and arrow. None of this makes sense. But I'm going back out there because it's my job.\"", "―Hawkeye to Scarlet Witch[src]"]], "figure_captions": []}