{"id": "Howard_Stark", "name": "Howard Stark", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Howard_Stark", "personality": ["During his early life, Howard was considered to be quite charismatic and comical. He was well-known for having flings with different women, sometimes attending the Academy Awards to be around actresses. He had a jeweler create the \"Stark Special\", a bracelet created of the highest quality of gold and diamonds, to be given to each lover after he had Edwin Jarvis dismiss them. This trait eventually landed him in deep trouble when one of his dates ended up stealing weapons he developed. However, he eventually settled with a woman named Maria and had a son, whom they named Tony. In addition, even beforehand, he also made clear to Captain America after an incident where the latter accused Peggy Carter of \"fonduing\" with Howard during a fight between the two that, while he had his proclivities, he made sure to avoid indulging in them during the events of the war and focus on his work.\n", "Sometime after his son's birth, his personality drastically changed. Howard's relationship with Tony was a strained one and Tony, for most of his life, saw Howard as a cold, calculating man who wanted to be rid of Tony, so much that he believed Howard's happiest day was when he sent Tony off to boarding school.\n", "Howard was shown to be very cautious as he left a film message for Tony in the event he died before Tony was old enough to understand the contents of the message. The contents of the film stated Howard left something very important behind for Tony, which ended up saving his life. Howard called Tony his \"greatest creation\" and trusted that he would carry on his legacy. Tony's attitude towards his father's memory had changed after this, as he was shown to be willing to work with authoritative figures, evidenced by aligning the Avengers with the Sokovia Accords for a better future. When Tony later fought and was defeated by Captain America who lied to him about his father's death, Tony said to the latter that his shield was Howard's property and he didn’t deserve it.\n", "According to Tony, Howard had a habit of talking about Captain America non-stop. He felt that, before the birth of Tony, that Captain America was his greatest creation largely due to the perception that all he created were weapons of mass destruction. Howard also saw Captain America as a good friend and was deeply loyal to him, having made several attempts to find him after he disappeared in the Ocean. Even though he tried everything in his power, Stark kept underlying guilt about not finding Steve Rogers when he sought him after his disappearance.\n", "Howard is also shown to be quite sarcastic, a trait he carried with him until his death. Mere hours before his death, he sarcastically insulted Tony who just got home from studying abroad by asking who the \"homeless person on the couch\" was. He also believed sarcasm is correlated to a person's intellectual potential, possibly stemming from his own intellect and sarcasm. As such, he believed Tony would amount to great things with his life, has told his son that during their last conversation.\n"], "quotes": [["\"He was cold, he was calculating. He never told me he loved me, he never even told me he liked me.\"", "―Tony Stark[src]"]], "figure_captions": []}