{"id": "Hulk", "name": "Hulk", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Hulk", "personality": ["Bruce Banner is shown as a mild-mannered, mysterious, shy and analytical man of science. The incident at Culver University caused Banner to become somewhat mentally troubled and obsessed with finding a cure for his mutation. He is compassionate and afraid of hurting someone unintentionally, so he tries not to get close to something or someone that leaves him stressed.\n", "In turn, Hulk is more primitive with his senses amplified to such an extent that it is difficult for his brain to process it all. In Banner's own words, he describes the experience as \"It's like someone poured a liter of acid into my brain.\" When Banner returns to his normal human form, he has little recollection of events aside from fragments and images.\n", "In his earliest transformations, Hulk appeared as a savage with no real ability to distinguish friend from foe. Because of this, he was responsible for the deaths of two scientists, an army officer, a police officer from Idaho, and two Canadian hunters when he was a fugitive. However, while extremely aggressive and destructive, Hulk only attacked when provoked as a form of self-defense and wanted to be alone, often fleeing and ending up in areas uninhabited by humans like caves or forests to calm himself.\n", "Ever since his first transformation Banner was terribly afraid of Hulk and the risk of him hurting those around him. He abandoned everyone and everything he cared about and became a fugitive for five years to prevent Hulk's power from falling into the wrong hands, while desperately searching for a cure and attempting to avoid transforming at all costs. On some occasions, he lost the hope of getting rid of his other persona and showed suicidal tendencies, attempting to kill himself once. The only times he was willing to let himself transform was during the Battle of New York, when attempting to intimidate Scarlet Witch, as he was angry with her for having set Hulk loose on Johannesburg, to the point where he threatened to kill her without even transforming, and when he tried to protect the Asgardians from Hela, her army of Berserkers and the Fenris. Despite this, he still dislikes having to transform into Hulk to battle, as it would require him to harm and kill others, which he expressed after the Attack on the HYDRA Research Base, as Thor commented on Hulk's kills and inadvertently made Banner feel ashamed and regretful.\n", "Hulk keeps fragments of Banner's personality and gradually attained a better reasoning capacity over time, becoming able to show affection, demonstrating a capacity to work collaboratively with others once they've established a rapport with him, be aware that his name is \"Hulk\", and demonstrating he's capable of directing his savagery at foes instead of allies. Betty suggested that this is because Banner's mind is still within Hulk and can influence his behavior. Over time, he supplemented his scientific pursuit by learning meditation and breathing techniques, gaining a greater control over the transformations. Banner discovered that by focusing during the moment of transformation he can control Hulk's destructive behavior or at least \"aim\" it at a desired target, first seen during the Duel of Harlem. Banner usually has a love interest to act as Hulk's handler and soothe him back into his normal state. Hulk would check his aggression if Betty Ross desired it and would be given a lullaby to lull him into a calmer state by Black Widow.\n", "After having shown some success in controlling the monster, he seemed to have abandoned the search for a cure and redeemed himself, helping sick people in poor areas of the world. Thus, he appeared to be more comfortable and sarcastic in various situations with fellow Avengers. He is no longer even afraid to get angry as it no longer triggers a transformation instantly. Tony Stark encouraged Banner to see Hulk as an ally rather than a destructive curse by pointing out that Hulk technically saved his life when the Gamma exposure accident occurred. Eventually Banner became confident enough to bring out Hulk voluntarily knowing he won't attack his allies. By the time Thor found Hulk while trapped in Sakaar, Hulk became intelligent enough to speak, albeit somewhat rudimentary.\n", "However, Banner is the Avenger his teammates are the most wary of despite their camaraderie and often don't call Hulk to a battle unless strictly necessary. Though Banner is able to suppress his transformations through emotional intelligence, he has been known to lose control or be manipulated into lose control. Should he be completely overwhelmed with rage or stress, he loses all reason and becomes a volatile rage monster. Because of this, Banner had requested Tony to build the Hulkbuster armor. For example, he once attacked Black Widow on the Helicarrier, when they were blasted out of the lab and he transformed and attacked her, and when the Scarlet Witch used her mental manipulation powers on him in South Africa to force him to transform. After the War against Ultron, Hulk himself decided to abandon his Avengers friends much like he did when he defeated Abomination.\n", "During his time in Sakaar, Hulk's control over Banner's body increased significantly, to the point that he was able to stay as Hulk for two whole years and prevent himself from reverting back to Banner. His increased self-awareness gave him increasingly visible layers of personality, similar to a five-year-old's [26], instead of just being a very destructive rage monster. Hulk became intelligent enough to acknowledge his human half but repeatedly refuted Banner's existence, claiming \"No Banner, only Hulk!\", though he did so out of resentment and bitterness for Banner. While he gained more self-awareness and personality, Hulk was still susceptible to emotion and could easily become more savage due to stress and frustration, such as when he fought Thor in the Contest of Champions. Despite this, he could still demonstrate a calm and stable demeanor, which allows him to not solely act aggressive and hostile, such as when he talks calmly with Thor after the two of them argue and befriend Valkyrie during his stay on the planet. However, Hulk was also wary of others, due to his history of violence on Earth, which caused him to believe that humanity hated him and made him refuse to return. Upon regaining control, Banner became afraid of Hulk once more, baffled at the fact that Hulk existed for more than two years, inferring that transforming again would likely result in Hulk gaining full control and the ability to indefinitely suppress Banner.\n", "Hulk's time on Sakaar allowed him to form his own identity. Having risen to the top of the ranks and becoming the Grandmaster's Champion, Hulk enjoyed a celebrity lifestyle. This was as close to a \"normal life\" that he was able to enjoy. During such time, he was able to develop his emotions beyond just anger. His interactions with Valkyrie and Thor demonstrated his playful nature. In addition, upon hearing that Earth hated him, Hulk appeared genuinely upset. This fortifies the notion that Hulk doesn't want to be alone as he claims. This was highlighted when he begged Thor to stay on Sakaar as his friend. Unfortunately, Hulk's low emotional intelligence and raw strength provide a combination that creates a being who cannot easily co-exist with others. Tragically, Hulk may be the loneliest Avenger yet the one who needs friends the most.\n", "Because Hulk has never lost a fight before; his experience and growing intelligence in Sakaar reinforced the idea and image so much that he believed himself to be invincible, no longer a primitive rage monster like when he first came into existence, and now capable of grasping a wide spectrum of emotions, the defeat at Thanos' hands traumatized Hulk tremendously; he has since grown so fearful of the Titan and his forces that he outright leaves Banner alone to fend for himself for the first time since his creation, to the extent staunchly refusing to transform and come out to fight even when told to.\n", "Banner ironically realizes that despite getting his wish of being cured of the Hulk, this has left him vulnerable and unable to help his teammates directly as he has lost the strength gained from being the Hulk. However, despite this, Banner displays great courage by fighting in the Battle of Wakanda wearing the Hulkbuster Armor, even facing Thanos again without fear.\n"], "personality_quotes": [["\"For all the destruction Hulk has caused over the years, he's done that only after we attacked him. In fact, whenever he's seen innocents threatened, Hulk has gone out of his way to protect them. Suggests to me that buried within that raging monster beats the heart of a hero.\"", "―Nick Fury[src]"]], "figure_captions": [], "quote": ["\"Hulk, we got a lot to figure out, pal.\"", "―Bruce Banner", "Avengers: Infinity War"], "description": "Robert Bruce Banner, M.D., Ph.D., is a renowned scientist and a founding member of the Avengers. As someone who was highly respected for his work regarding biochemistry, nuclear physics, and gamma radiation, he was commissioned by Thaddeus Ross to recreate the Super Soldier Serum which created Captain America, although Ross elected not to inform Banner what he was creating. However, when an exposure to high levels of gamma radiation instead of vita radiation went awry, the mild-mannered scientist had found that when angered, provoked or excited, he would transform into the huge, rage-fueled, nearly mindless creature known as Hulk.\n"}