{"id": "Jemma_Simmons", "name": "Jemma Simmons", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Jemma_Simmons", "personality": ["She has a deep affection towards Leo Fitz, refusing to let him sacrifice his life for her. However, she briefly found being around Fitz hard because of the memories she has of the man he was before his brain was damaged. The two later resumed a normal relationship.\n", "Simmons was a terrible liar, proved many times over, prominently the instance in the Hub when she shot Agent Jasper Sitwell with the Night-Night Gun out of panic when he did not believe her lies.[14] However, Simmons has improved on this flaw during her undercover assignment in HYDRA's science division.[5] Simmons also has a bright outlook on life, most often trying to see the best in any situation, and then trying to make them better.\n", "The death of Antoine Triplett drastically changed Simmons' views of superpowers and alien artifacts. She thought that the world was a better place without anyone with powers, to the point in almost saying that killing Raina, since she had powers, was the best option for the team. She viewed Skye as being equal to Hulk in terms of destructive capability and lack of control; Simmons hoped to find a way to remove her powers permanently, or at least suppress them through sedatives. Her change of opinions was so surprising that Fitz himself said that her change in personality is almost scary. This change also brought out a darker side of Simmons' personality as she intended to kill Grant Ward with a Splinter Bomb after all of his betrayals and while she failed due to Sunil Bakshi's interference, she calmly told them that he didn't make it, not revealing his death was caused by her murder attempt.\n", "Simmons has an attraction to men who act heroic, especially in regards to saving her. She was attracted to Ward after he saved her life when she attempted suicide; her closeness to Triplett grew when he defended her against Victoria Hand and her deceptive loyalty test. Simmons began an affair with Will Daniels after she lost hope that Fitz, the man who constantly risks his well-being on her behalf, would save her. However, Fitz did save her, causing a conundrum for her emotionally. However, after a mission when she confronted Hive and moved on Daniels' death, Simmons finally consummated a relationship with Fitz. Although it took some time for Simmons to admit her feelings towards Fitz, she is deeply committed in their relationship, planning romantic getaways and actively looking for a place where they could live together. She also never gave up on saving her boyfriend from the Framework, saying that she loved him on multiple occasions, despite Fitz being a cruel and ruthless HYDRA officer in the alternate reality.\n", "After learning that Deke Shaw is her grandson and hearing that Yo-Yo Rodriguez met her future self, Simmons developed the belief that she and Fitz were invincible if they were predestined to end up at the Lighthouse. Her belief was further reinforced when she avoided purposely drinking a toxic substance by sheer chance and when Yo-Yo accidentally shot between her and Fitz.\n"], "quotes": [["\"There's no getting home. Sooner you accept that the better. Survival's all that matters.\"\"I will not accept that. There's always hope.\"", "―Will Daniels and Jemma Simmons[src]"]], "figure_captions": []}