{"id": "Justin_Hammer", "name": "Justin Hammer", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Justin_Hammer", "personality": ["Justin Hammer is a self-centered businessman and rival to Tony Stark. Whilst overconfident, Hammer is also incompetent in terms of the quality of his technology, some of which are faulty altogether and even dangerous to the user, such as an attempt to replicate Stark's Iron Man Armor results in the injury of the pilot, the outdated software at Hammer Industries described as \"shit\" by Ivan Vanko and the Ex-Wife Missile, despite selling it as a weapon of mass destruction, does not even scratch Vanko's Whiplash Armor Mark II.\n", "Following the repeated media attention being distracted from Hammer Industries to Stark, especially since the reveal of Iron Man's identity and his subsequent humiliation, Hammer began engaging in legally dubious activities to finally gain the upper hand over Stark, even breaking the terrorist Ivan Vanko out of prison and getting him to assist Hammer. Though a self-proclaimed businessman, Justin Hammer seems to be without his own original ideas such as creating a Hammer Expo, a few months after Stark's own Expo, and lining it with drones (but Hammer initially asked for suits instead) and selling the War Machine Suit as his own, despite it being granted to him by Rhodes from Stark Industries. Hammer is also willing to endure repeated insults to himself and his company for a period of time for the greater good of matters, as he does with Vanko. However, when pushed to the edge, Hammer can undergo furious, almost temper-traumatic rants against an individual who wronged him.\n"], "quotes": [["\"So now you like the bird, is that right? Isn't that your bird? I'm confused, you said it wasn't, but now it looks like you're best of pals! You love that bird, don't you? You know what, take the bird. Take his pillows, too. Both of them. And his shoes. Take his shoes. I took your stuff. How's that make you feel? Do you feel bad? Good. 'Cause that's how I feel! We had a contract! I save your life, and you give me suits! That was our deal.\"", "―Justin Hammer[src]"]], "figure_captions": []}