{"id": "Karen_Page", "name": "Karen Page", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Karen_Page", "personality": ["Karen Page is a cunning, optimistic woman with a humorous nature and an unshakable loyalty and love for the people closest to her. However, the series of traumatic events, from being framed for murdering her colleague at the Union Allied Construction, almost being assassinated in prison and murdering James Wesley, evolves Page into a darker and more driven character, determined to bring those that wronged her to justice. Though these personal tragedies have affected her greatly, she is first and foremost an extremely kind and caring person and doesn't allow her growing cynicism to affect her ideas or nature.\n", "Page's loyalty to her friends can make her act cold and spiteful if she feels hurt or shunned by the people she trusts. Being the only worker of Foggy Nelson and Matt Murdock who was not aware that Murdock was Daredevil, she was the only one who was constantly being lied to. After Nelson and Murdock stopped even speaking with each when Nelson discovered Daredevil's identity, it affected her state greatly, causing her to state that they were a team with Nelson and Murdock and this was not how a team acts. Due to Nelson not informing her why this was happening, she threatened to punch him in the throat if he claimed the situation was \"complicated\" and stated that he did not care about her. These traits become more evident when she engaged in a romantic relationship with Murdock. After a string of ill-concocted lies, his failure to appear at Frank Castle's trial - effectively causing the firm to shut down, and Page finding a half-naked Elektra in his bed, she assumed the worst, severed all ties with him immediately, claiming he wasn't a hero that could save New York City.\n", "She can be viewed as a woman who gets into trouble quite often, from being caught in the crossfire of the Blacksmith framing the Punisher, almost being assassinated by Fisk numerous times, and kidnapped by the Hand, Wesley and Ray Schoonover.\n"], "personality_quotes": [["\"Karen. Look, I know you. All right? You're brave. You're strong. But you are so goddamn stubborn.\"", "―Frank Castle to Karen Page[src]"]], "figure_captions": [], "quote": ["\"A hero is not a god or an idea. A hero lives here on the street. Among us. With us. Always here but rarely recognized. Look in the mirror and see yourself for what you truly are. You're a New Yorker. You're a hero. This is your Hell's Kitchen. Welcome home.\"", "―Karen Page", "A Cold Day in Hell's Kitchen"], "description": "Karen Page is the former office manager for Nelson and Murdock and, along with Foggy Nelson, Matt Murdock and Ben Urich, was instrumental in the effort to bring Wilson Fisk to justice. While working for Nelson and Murdock, Page came into contact with Frank Castle, who she helped defend in court. When Nelson and Murdock fell apart, Page joined the New York Bulletin with the intention of writing Castle's true story, however during her investigation she was kidnapped by Ray Schoonover and saved by Castle. Later the Hand also kidnapped Page and she was rescued by Daredevil before Murdock revealed to her that he was Daredevil.\n"}