{"id": "Kingpin", "name": "Kingpin", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Kingpin", "personality": ["Despite being one of New York City's most powerful crime lords, Fisk has a very shy and introverted demeanor. He did not like crowds and was uncomfortable around other people, until Vanessa Marianna's involvement. Fisk almost had an \"OCD-like\" mindset, being a creature of habit and hating when things in his life changed, or went against how they were planned. It could be argued that Fisk exhibits symptoms of autism, due to these reasons.\n", "However, in spite of his social anxiety and his awkward nature, he is nonetheless capable of being extremely persuasive and charismatic when he needs to be. He has a keen understanding of psychology and social dynamics, which allows him to almost effortlessly manipulate people around him and exploit their psychological and emotional weaknesses. He also has a natural talent for leadership, as his take-charge attitude, sheer force of personality, and raw physical presence enable him to take control of chaotic situations. As evidenced from the speeches he gave at his press conferences, he knows how to play a crowd as well, feigning emotion and passion in order to rally support from the masses.\n", "He is a polite, articulate, and well-spoken man of courtesy and manners. He expected courtesy from his subordinates as well, as he would attack and sometimes even kill those who did not show respect to him or those he cares about. Fisk is a man of deep sophistication, enjoying the high-class life despite his poor origins. He enjoyed fine suits, fine dining, and classic literature and music. He considered himself a man of honor and always kept his word. While he can be a brutal, cold, calculating machine, he honestly believed what he was doing for Hell's Kitchen was righteous.\n", "However, if Fisk was provoked he had an unstoppable, almost animal-like rage. His aggression was immense, and nothing could get in his way if those he cared about or his plan for the city were in danger. This was largely due to his abusive father, who taught him to keep hitting someone even when they were bloodied and beaten. Fisk's broken childhood had a lasting effect on him, still causing him nightmares even into his later years. He even hallucinated his reflection in the mirror having the image of his younger self covered in blood after murdering his father.\n", "There are only four people that Wilson has ever cared for in his life. Fisk's mother was the only person that showed him love and respect growing up, and thus Fisk would kill to protect her, killing both Ben Urich and his own father for her. Vanessa Marianna became the love of his life; Wilson once brutally beat Anatoly Ranskahov to death and removed his head with a car door for simply interrupting their date. When Leland Owlsley had been involved in poisoning Vanessa, he threw him down an elevator shaft to his death. James Wesley was the only man Fisk ever called a friend; he was emotionally distraught upon learning the death of Wesley, even kissing the forehead of his dead friend, and ordered the assassination of Karen Page when he found out she was the one who had killed him. Finally, Fisk had a deep respect and almost fear of Madame Gao, and her opinion of him, though this changed after he found out that she was responsible for the attempt on Vanessa's life.\n", "Marianna's effect on him made him more vulnerable and less able to run his organization because his focus was primarily on her. He ignored both Gao's and Owlsley's warnings to cut ties to her and as such, Owlsley betrayed him by dealing with Gao and was part of the plot to poison Marianna. Fisk was shocked at his friend's betrayal and it took time for him to come to his senses and kill Owlsley. When his criminal organization was brought down and his plans for the city ruined, he finally snapped and no longer cared about the city, saying it deserved to be destroyed and it deserved people like his father. His belief was shown when he related himself to the antagonist of the Good Samaritan story, as he first thought himself to be the hero of it.\n", "After being imprisoned, Fisk became even more cynical, ruthless, violent, and sociopathic. Having given up on his ambitions to change the city for the better, he became concerned solely with attaining money and power, getting revenge upon the people who'd wronged him, and being reunited with Vanessa. He also became more impulsive and prone to homicidal outbursts, as he beat Wellers to death in a fit of rage after Benjamin Poindexter failed to kill Page. While he originally showed some reluctance and remorse about killing civilians like Elena Cardenas, this changed after his release from prison, as he displayed a willingness to order the murders of innocent people without a second thought if it would even slightly further his plans. This was evidenced when he had Poindexter go on a killing spree at the New York Bulletin in order to cause a panic, and when he had Julie Barnes murdered to secure Poindexter's loyalty even though it wasn't necessary.\n", "Despite losing most of his moral compass, Fisk still does have some level of compassion and loyalty in regards to Marianna. When Felix Manning failed a task Fisk not only spared him but allowed him to still work for him in gratitude for keeping Marianna safe. He also kept his word not to expose Daredevil or go after Foggy Nelson or Page when Daredevil threatened to expose Vanessa to the police as being the one who had ordered the hit on Ray Nadeem.\n"], "quotes": [["\"The one thing that keeps me warm, is the thought that I will look down upon this city, the city that birthed me, with the woman that I love, who, whom I love, with everything that I am! You're worried that Frank Castle will wreak havoc on Hell's Kitchen? Just wait...\"", "―Wilson Fisk to Matt Murdock[src]"]], "figure_captions": []}