{"id": "Lance_Hunter", "name": "Lance Hunter", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Lance_Hunter", "personality": ["Initially, Lance Hunter was only perceived as a common mercenary, only caring about being paid by Coulson for the job and possesses a sarcastic sense of humor. However, he does care for his comrades as he chose to save Hartley against orders to try and save her life. After his friends' deaths, he became extremely vengeful against Carl Creel and knocked out Skye, Melinda May and Antoine Triplett in a failed attempt to kill him. He also went to similar lengths to infiltrate HYDRA to retaliate against Grant Ward, to retaliate for an incident in which Hunter's ex-wife Bobbi Morse was abducted and nearly killed. He has a sense of honor as he chose to join S.H.I.E.L.D. because of Isabelle Hartley, despite the loss of two million dollars from Glenn Talbot.\n", "Since joining, Hunter showed remorse for his actions, repeatedly apologizing to May; however his apologies were only considered when she shot him to protect Jemma Simmons. He shares a complicated romantic history with Bobbi Morse as they were both married at one point and separated for unknown reasons. Initially, he was reluctant about working with her, but he stayed anyway and they even reignited their relationship.\n", "Over time, Hunter has come to be truly loyal to S.H.I.E.L.D., and especially to Phil Coulson. His new-found loyalty is strong enough for him to help Coulson take back S.H.I.E.L.D. from Robert Gonzales. Hunter's decision to become a permanent agent surprised many people who knew him for a long time, including Bobbi.\n", "Hunter has admitted that he is jealous of the Inhumans' powers, claiming their ability to gain powers after coming into contact with the Terrigen Mist is an \"unfair advantage\". He tried a fish oil pill to find out if he's Inhuman, hoping to gain x-ray vision. He also complains about it every time he faces an Inhuman, such as when he and Bobbi fought Giyera and Lucio for the first time.\n"], "quotes": [["\"I want my pay, and not just mine, either. I want Hartley's and Idaho's, too.\"\"Okay, now you're kidding.\"\"It's for their families. I think they deserve something for their loss, don't you think?\"", "―Lance Hunter and Phil Coulson[src]"]], "figure_captions": []}