{"id": "Leo_Fitz", "name": "Leo Fitz", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Leo_Fitz", "personality": ["Like his best friend Jemma Simmons, Leo Fitz is known to be an attractive nerd on his profile for S.H.I.E.L.D., though he is somewhat socially awkward. Fitz also has a strange affinity for monkeys. He also has a great sense of humor, teasing Ward behind his back (in a mockery Southern accent), and planning to prank Skye. He is also a good actor, and easily impersonates an American tourist.[15]\n", "In spite of his lack of combat skills, Fitz impressed the more experienced Ward with his remarkable bravery and quick thinking during their mission together in South Ossetia. Fitz believes deeply in the friendships he creates: being upset when Skye appears to have been secretly working with Miles Lydon[108], actually crying when John Garrett revealed himself as HYDRA[19], as well as having a rare angry fit and emotional breakdown when Ward was revealed to be a murderer and a HYDRA mole.[21] In return, Fitz is very loyal to his friends, is miserable when he was unable to save Skye from Quinn, and trusts Simmons with his life.[23] Another instance of his loyalty was his refusal to serve Gonzales, deciding to leave rather than betray Coulson.[39]\n", "While Fitz is devastated at Ward's betrayal, he is the only one on the team that still insists that Ward is redeemable, as Fitz believes that people are never \"born evil.\" He is the only one who still tries to reason with Ward and implores him to let Garrett die and abandon HYDRA.[21] Despite that, Fitz later on became very bitter against Ward after he dropped him and Simmons into the ocean to die and for betraying the team, even going on to torture him by suffocating him inside a cell as he did him, and later, attack him. However, Fitz is also very forgiving and understanding of others' problems, shown when he quickly forgives Skye for being so secretive about Miles Lydon, claiming that everyone \"makes mistakes.\" He also instantly forgives Coulson for knocking him out with a punch, understanding the situation. As Simmons grows closer to Triplett, Fitz remains suspicious of him, though he does learn to trust him later on.[2][21]\n", "Fitz also tends to go through with his promises and threats: he promised Garrett that he would suffer for what he had done, and he (Fitz) plans to be a \"very big part of that.\" By electrocuting and nearly assassinating Garrett shortly thereafter, Fitz manages to keep his word.[21]\n", "The brain damage Fitz suffered has caused him to become withdrawn after Simmons opted to be a part of an undercover mission. Fitz had hallucinations of Simmons and talked to her, claiming that those conversations calmed him. Billy Koenig had replaced him in many aspects, raising Fitz's jealousy. No one other than Skye and May interacted with him until Alphonso Mackenzie approached him, creating a new friendship between the two.[26]\n", "Since nearly losing Simmons to the Kree Monolith, Fitz has exhibited a tougher and more determined personality. His actions often put himself directly in harm's way, in order to protect those he loves. In order to find a way to get Simmons back, Fitz traveled to Morocco and negotiated with terrorists, risking his own life for a piece of parchment with the secret of the Monolith written on it. Once he returned to the Playground, he found out that the only word on the parchment is \"Death\". In his desperation, Fitz blasted the Monolith's container open with a shotgun and started beating on the rock furiously demanding that it swallow him.[46]\n", "Whilst inside the Framework Fitz's personality was radically different to the point where he was the polar opposite from who he was in the real world. Ruthless, cruel, cold and sadistic and claiming to enjoy torturing people who HYDRA would capture. \"The Doctor\", as he was nicknamed, was willing to use his intelligence and scientific ability to further promote HYDRA's ideals, developing an agonizing experiment to find out an Inhuman's powers without triggering Terrigenesis.[82] According to Fitz, victims of this experiment never survived, yet The Doctor had no qualms about carrying it out.[89] This radical change was achieved when Aida removed Fitz's greatest regret, which was never having made amends with his father. In the Framework, Fitz's personality was deeply influenced by the education provided by his cold and ruthless father, who in turn was proud of his son's achievements within HYDRA. However Fitz still had doubts about doing the things he was doing like the killing of Agnes Kitsworth, even if his father dismissed these doubts as \"\"womanly sentiment\".[85] After escaping the Framework, Fitz was horrified by his behavior inside the alternate reality since it had led to the deaths of Kitsworth and Jeffrey Mace, and was afraid that his profound nature could be evil.[87] Fitz was so wracked with guilt that he was unable to look at Simmons once he was out of the Framework without breaking down into tears.[88] He also offered to sacrifice himself for the team by taking full responsibility for what had happened since the creation of Aida and the Framework. Moreover, being responsible for Mace's and Kitsworth's deaths was such a trauma to Fitz that he was unwilling to kill Aida and thus causing him to have another death on his mind, even if Aida had become a crazed, lethal enemy to S.H.I.E.L.D. Instead, Fitz tried to stop her by attempting to reason her and to have her express her pain by means other than violence, but his attempts failed as Aida was keen on making him suffer.[89]\n", "Despite his expressed guilt and shame toward his actions in the Framework, minor traits of his alternate dark personality stayed with him, with an example being when Fitz forcefully threatened Enoch by holding him at direct gunpoint. Fitz initially rejected these remnants, stating that he could not accept it and was trying to bury it within him. However, after his friend Lance Hunter told him that all he had to do was do his best to control it[90], Fitz learned to use these traits to his advantage, thus allowing him to pose as a much more formidable and cruel individual than he actually is to blend in when dealing with dangerous individuals whenever the situation required it.[93] As a result, Fitz sometimes displayed harsh pragmatism such as, for example, when he designed a trap which beheaded three Kree guards, so that others would be too frightened to chase the S.H.I.E.L.D. agents, which initially shocked Simmons. However, Fitz later apologized to Alphonso Mackenzie for having exposed the young Flint to such a vision.[97]\n", "Eventually, due to the combined trauma of his brain damage, his experiences in the Framework, a lack of sleep, and general stress, Fitz developed a major case of Dissociative Identity Disorder, becoming split between himself and his Framework personality. Fitz not only heard The Doctor, but also hallucinated his presence, which led Fitz to hurt Daisy Johnson as his subconscious knew the only way to achieve Fitz's goals was using her powers by painfully removing her Inhuman Control Device. Once it was done and Fitz returned to his normal self, he isolated himself from his friends once again, claiming that he did not deserve their forgiveness and struggling between his regrets of having hurt them and the feeling that he had nonetheless done the right thing.[101]\n"], "quotes": [["\"Yes, they betrayed you. And after all you've been through, no one would blame you if you put up your own firewall. But you didn't. Instead you became the most open, loyal, caring person I've ever met.\"", "―Jemma Simmons to Leo Fitz[src]"]], "figure_captions": []}