{"id": "Loki", "name": "Loki", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Loki", "personality": ["Loki was an ever-scheming individual; the God of Mischief, he meddled in people's lives and even led them to their inevitable deaths as it made him feel powerful, and often used superior ploys or ulterior designs upon his enemies, such as Thor and the Avengers. Compared to his boisterous older brother, he always seemed to be calm, peaceful and quiet, but in truth had the mind of a cold, calculating sociopath and was constantly formulating machinations that would achieve him power and respect that he truly believed he deserves. Other than that, Loki supposedly cared for Thor, consoling him after his coronation was ruined but was stated to be jealous of him his entire life, although no one knew the extent of such jealousy until it was too late. He had a deep hatred of Odin and Thor due to supposedly being the least favored son and constantly rejected by Thor himself. Loki would do anything to humiliate, defeat or hurt Thor, even enslaving the world he cared about and supposedly killing himself.\n", "Part of his bitterness stemmed from the fact that he was a Frost Giant and was intended as a political tool to bring peace between Asgardians and Frost Giants. As such, Loki felt alienated and ashamed since he was a member of a race Asgardians were taught to fear and hate, and the people he thought were his family lied to him about it all his life. Growing up, Loki believed he was an actual prince of Asgard and so genuinely thought he could be King. Loki competed with Thor for Odin's favor, yet once his real parentage was revealed, Loki felt betrayed as he felt a Frost Giant as king was never a feasible possibility. Furthermore, Loki also felt that he was viewed as nothing more than a trophy and tool instead of an actual son by Odin despite all evidence to the contrary.\n", "However, deep down Loki loved his family to some degree. Though his hatred for his brother and father seemed to be unending, he did not share these feelings for his mother Frigga. Upon learning she was killed, Loki acted with rage and destroyed everything within his cell. When confronted by Thor in his imprisonment, he asked genuinely if she suffered as she died and was willing to work with his much-hated brother to kill Malekith. Part of this stemmed from his regret over directing Kurse to Frigga and Jane Foster and upon Svartalfheim he displayed tremendous and uncharacteristic selflessness such as risking his own life to save Foster and Thor, while dying in the process. Thor even stated that Loki did indeed die with honor but even this was a ruse as he has usurped the throne of Asgard and captured Odin. Despite his hatred and contempt, Loki had expressed the desire to be Thor's equal and recognized by Odin as the worthy son. He did seem to care about the two to an extent, particularly Odin, calling the guards and looking on in concern when Odin collapsed on the ground, and when hanging onto Thor near the Bifrost, he stated that he wanted to destroy Jotunheim for him. Perhaps, he did love his family deep down as he appeared hesitant to eject Thor out of the Helicarrier, and saved Odin from being murdered by Laufey as he later stated that his death was not his goal, and did not actually kill Odin, but rather imprisoned him on Earth.\n", "But the love he once showed and his more human emotions appeared to be significantly dulled by the time he arrived on Earth, along with the decades of built-up resentment which overshadowed any sliver of humanity Loki might retain. Despite this, however, Loki's time as king of Asgard appeared to have reduced his rivalry with and hatred for Thor and resentment for Odin, as he showed sadness and remorse for Odin's death and even showed visible care for Thor on Sakaar, asking him not to return to Asgard out of possible concern of his adopted brother dying against Hela. He was evidently angry and distraught when Thor ignored his offers to abandon Asgard and join the Grandmaster, saying emotionally that he always had to do it alone. He was also affected when Thor suggested he remain on Sakaar due to his power hungry nature and seemed saddened when Thor said that their paths had diverged long ago. Ultimately, Loki's newfound love for his brother swayed him to help Thor evacuate the Asgardians, risk his life by personally reviving Surtur, and support Thor's coronation. \n", "He had suppressed his desires for most of his life due to constantly living within Thor's shadow. As such he was capable of presenting himself as timid and meek when in reality he was in possession of supreme megalomaniacal ambitions which he believed he was entitled to more than anyone else, especially Thor whom he viewed as an incompetent fool who would make a terrible King in comparison to himself. As The Other stated, his desires were virtually reminiscent to that of a childish need to always be best; this also made his hatred of Thor an entirely overgrown and impractical sibling rivalry and the entirety of his actions could be intervened as purely attention-seeking, going to horrifying lengths such as the subjugation or destruction of a species, all to impress his father. Indeed, Loki's megalomaniacal desires were foiled by his true objective to stand superior over Thor and crush him completely, proving to Thor that he was his equal and his better, which was all he ever wanted.\n", "As a master of deceit and trickery, Loki utilized his duplicitous nature within combat. Loki was also not above underhanded tactics, such as when Thor offered a hand of peace, Loki deceptively stabbed him in his side. Loki would create feints and appear like running away or surrendering if a fight turned to his disadvantage. For example, when he was at the mercy of Thor on top of the Bifrost Bridge, Loki pathetically begged for his life, yet revealed the act to be just another one of his illusion manipulations and a feint to ambush his brother. However, Loki had a flaw of being arrogant, narcissistic and was in possession of extensive delusions of self-entitlement. This led him into trouble at times as he mocked Hulk within Avengers Tower, calling him a \"dull creature\" which caused him to be thrashed around like a plaything by the green monster. Later, the same arrogance allowed Doctor Strange sufficient time to teleport Loki away from the New York Sanctum. This overconfidence over his deceptive talents ultimately ended up claiming his life as attempted to smooth talk Thanos into lowering his guard enough to be slain only for the Titan to easily anticipate the attack and inevitable betrayal, having always been the far better deceiver and manipulator, and kill Loki in retaliation.\n", "He had an unfounded superiority over and deep hatred for humans, and this enforced his thinking that he was entitled to rule them; simply because he could, due to mankind's history of following people with power, Loki simply believed that they would view him as a benevolent dictator instead. Added to this, Loki firmly believed that freedom was life's great lie and that no-one was truly free and everyone was oppressed in some way. He went as far to say that humans were created only to be subjugated by superior men and that they craved to have a ruler, claiming that they would be lost and their lives effectively pointless without one to give them their identity. He mocked Thor for his compassion towards humanity and him enslaving Earth would be nothing less than a petty, spiteful attack towards his older brother.\n", "For many years, Loki had no respect for his real heritage and would often contradict himself within this area to whatever situation would require it better. After learning that Laufey was in actuality his biological father, he did not even mention this to him on Jotunheim and later murdered him when he attempted to kill Odin. He called the Frost Giants a \"race of monsters\" despite already knowing that he was a member of the race himself before unleashing the full power of the Bifrost upon their planet. Effectively ending the war which Thor started and having saved Odin's life, he believed would be paraded as a hero as he apparently could not see the logic that ending an entire race would only make Odin disgust him further. Since learning that he was the son of Laufey, Loki stated that Thor was not his brother at all, ignoring the years that they grew up together entirely and threw this in his face twice. When hanging over the Bifrost, though, he referred to him as \"brother\", despite having previously disowned him only a few minutes earlier, though this was soon revealed to be an illusion, and another trick to use against Thor. Likewise, after being transported to Earth by the Tesseract he claimed himself as \"Loki of Asgard\" but on Svartalfheim before the Dark Elves, proclaimed himself \"Loki of Jotunheim\".\n", "The Battle of New York traumatized Loki, since his defeats at the hands of the Hulk left him terrified about the creature, to the extent of trying to leave Sakaar upon discovering that Hulk was the champion of their Contest of Champions. Despite this, Loki showed to be capable of using him, as when he, Thor and Valkyrie plotted how to get Thor out of Sakaar, Loki suggested to use Hulk. When the Statesman came under attack by Thanos, however, the two had formed enough of a partnership to improvise a coordinated attack on the Mad Titan. Indeed Bruce Banner would later insist on referring to the New York invasion as Thanos' doing instead of Loki's, emphasizing how the two had come to terms.\n", "Shortly after Odin died and Thor learned the truth about Hela and how Asgard really rose to power, Loki genuinely felt sympathetic towards Thor as he had just found out that everything he knew was false, much like how Loki himself did after finding out he was a Frost Giant. After the destruction of Asgard, Loki and Thor seem to have fully reconciled. However, Loki still kept some his mischief as he stole the Tesseract from Odin's Vault before Asgard’s destruction. Ultimately, though, seeing Thanos on the brink of killing Thor, Loki gave up the Tesseract, despite the fact that it allowed the Titan to be one step closer to conquering the universe, showing his love for his brother had now far surpassed any desire for power that Loki had, but Loki did so in a attempt to assassinate Thanos. Unfortunately for Loki, Thanos easily anticipated this and killed him.\n", "An often remarked flaw of Loki's was that he not only lacked conviction but often failed to appreciate the long term consequences his actions might have as stated by Phil Coulson and Iron Man shortly before the Battle of New York. This was seen again following his usurping of Odin's throne as his decadent leadership caused most of the Nine Realms to fall into chaos and unintentionally precipitated Hela's release. This period of total power had also given him a sense of complacency to the point where most everyone he came across had come to anticipate all of his potential tricks and betrayals. Indeed, Thor openly mocking this attitude was a deciding factor in Loki's decision to reform his ways and genuinely aid his people.\n", "In the final moments of his life, Loki displayed that he had truly came to accept both his Asgardian heritage and his Frost Giant parentage, proudly identifying himself as \"Odinson\" and the \"rightful king of Jotunheim\". Though having lived in fear of Thanos since their first meeting, Loki selflessly attempted to slay the Titan in spite of his power and entourage, showing he had truly redeemed himself. When Thanos effortlessly parried the attack and began choking Loki to death, Loki not only accepted his fate but remained openly defiant, mocking Thanos that he would never achieve true godhood. In the end, Loki died doing what many believed he would never do: display open care for others and reconcile with and accept his lineage.\n"], "quotes": [["\"Dear brother, you're becoming predictable. I trust you, you betray me. Round and round in circles we go. See, Loki, Life is defined by growth. And change. Maturity. And yet it seems you would instead remain as you ever were. It seems you will always be the God of Mischief, ignorant that you could in fact be more.\"", "―Thor to Loki[src]"]], "figure_captions": []}