{"id": "Malekith", "name": "Malekith", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Malekith", "personality": ["Since the war against the Dark Elves and Asgardians that ended in his species complete annihilation and the Aether being stolen from him, Malekith grew a hateful personality in his exile and was deeply embittered by the losses he faced. After this Malekith not only sought the destruction of Asgard with the reclaimed Aether but the entire universe. Stated by Odin to be the most ruthless of his species, Malekith cares deeply about the survival of the Dark Elves as he looked saddened whilst overviewing the wasteland of Svartalfheim and the destroyed ships and corpses of his fallen brothers. In truth, Malekith would sacrifice his own men if it were to help in achieving his goals, in a final slight to make sure the Asgardians suffered as much as they did, destroyed his ships with countless Dark Elves still within and the collective damage on the surface of the planet, culminated in Malekith destroying more of his species than the Asgardians did. He also Kursed his second-in-command, Algrim.\n"], "personality_quotes": [["\"Through their sacrifice we will survive. It will not be in vain.\"", "―Malekith[src]"]], "figure_captions": [], "quote": ["\"You needn't have come so far, Asgardian, death would have come to you soon enough.\"\"Not by your hand!\"\"Your universe was never meant to be. Your world and your family will be extinguished!\"", "―Malekith and Thor", "Thor: The Dark World"], "description": "Malekith (Mälekith in Shiväisith) was the utterly cruel and malevolent leader of the Dark Elves, a race of beings said to be older than the universe itself. Born in a realm of complete darkness, Malekith had led his people in a War against the Asgardians, using an ancient weapon known as the Aether, but they were thought to have been destroyed thousands of years ago during a final battle against the Asgardian King Bor. Malekith had survived, however, and after going into hiding for thousands of years, he returned during the Convergence and sought to retake the Aether and use its power to transform the universe by plunging it back into eternal darkness. Before his attempt could succeed, however, Malekith and his armies were finally defeated by Bor's grandson, Thor, in the Battle of Greenwich, resulting in the eventual death of Malekith.\n"}