{"id": "Nebula", "name": "Nebula", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Nebula", "personality": ["Like Gamora, Nebula greatly despises her father, Thanos, for torturing her and turning her into a cybernetic assassin. However, despite this, she always tried, often in vain, to prove her worth to her father. Nebula lost any desire to do this after betraying Thanos, though, and has since vowed to kill her adopted father, now free to express her hatred for him. Her hatred for Thanos eclipsed any fear she had of him, as she went as far as to infiltrate the heavily guarded Sanctuary II just to try to kill Thanos, which failed miserably and she was captured and tortured badly by Thanos. This likely compounded her hatred for him even further and Nebula later immediately became furious and brutally attacked him unhesitatingly when he coldly told her he considered killing her would have been a \"waste of parts\".\n", "Nebula has very little loyalty to a cause as she quickly betrayed Thanos once Ronan the Accuser harnessed the power of the Orb, believing he could kill Thanos as he declared to do so. However when the Battle of Xandar became too intense for her liking she quickly abandoned Ronan to escape, despite her sister's pleas for her to help the Guardians of the Galaxy, becoming an independent criminal. Nebula is also known to be highly sadistic, even being referred to as the biggest sadist in the galaxy by Taserface and she seems to take pride in her sadistic killing of her targets, with her proudly telling Gamora that \"The screams of my victims can be heard through the galaxy\", which Gamora replied in stride by saying that it was because Nebula often took a long time to kill her foes because she tortured them first. Unlike her sister who seeks to atone for her past crimes, even after she had redeemed herself, Nebula shows no visible signs of regret for her own crimes and she was perfectly willing to murder anyone tasked to her and anyone who stood in her own way.\n", "Although she and Gamora grew to genuinely care for each other and develop a strong bond, ever since Thanos considered Gamora his favored children and Gamora's repeated victories over her, which caused her to be painfully cybernetically altered, Nebula had grown to resent Gamora, both for never letting her win and for being Thanos' favored daughter. However, she does still like and care for her to an extent, as Nebula said she disliked and hated her the least out of all the other children of Thanos and she did not have the heart to let her be captured by Thanos and Ronan, as she knew that either Ronan or Thanos would torture her first before killing her, causing her to genuinely believe that when she destroyed her ship and left her to die in space that she was doing Gamora a favor. However, while she ruthlessly tried to kill her sister when they fought in Ego, even dishonorably attacking Gamora despite Gamora saving her, when Nebula finally had the chance to kill her sister, she could not bring herself to do so and although she first revealed that she finally beat Gamora, Gamora's lack of care on it and admonishing her for still continuing their rivalry caused her to furiously reveal why she hated her and this caused them to warm up with each other, with Nebula finally forgiving Gamora, even joining forces with the Guardians of the Galaxy and saving her. When Nebula departed from their company, she did so on equal terms, sharing a hug with her sister before she left.\n", "Years later, Nebula's relationship with Gamora and the Guardians appears to have improved considerably, as she trusted the Guardians enough to tell them to meet her on Titan so they can fight Thanos. Her care for Gamora was most notably shown when she furiously dueled with Thanos, she angrily asked where Gamora was. Upon realizing that Thanos had sacrificed Gamora, Nebula was visibly distraught as she implied it and seemed to show some sympathy towards Star-Lord, Gamora's boyfriend, showing more emotional sensitivity, as rather than bluntly telling him Gamora had died, she never actually openly said it and looked almost in tears when Star-Lord, in denial of Gamora's death, angrily asked Thanos to tell him that she was lying. She showed genuine care for the Guardians, looking visibly distraught as they ceased to exist.\n"], "quotes": [["\"You were the one who wanted to win, and I just wanted a sister! You were all I had, but you were the one who needed to win. Thanos pulled my eye from my head. and my brain from my skull, and my arm from my body... because of you.\"", "―Nebula to Gamora[src]"]], "figure_captions": []}