{"id": "Nick_Fury", "name": "Nick Fury", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Nick_Fury", "personality": ["Nick Fury is somewhat of an enigma, but his actions prove him to be bold and pragmatic. It's nearly impossible to read his emotions. He is known to manipulate people and is the bearer of many, classified, global security secrets. Nor does he tell whatever happened to his missing eye. However, while showing Project Insight to Steve Rogers he gives a backstory saying, \"Last time I trusted someone, I lost an eye.\", insinuating he doesn't trust easily and he is known to compartmentalize. Ironically, Fury lost his eye over trusting Goose, and not an enemy. \n", "Fury and his organization, S.H.I.E.L.D., share a cynical outlook. Sometimes, Fury finds that cutthroat actions and clandestine, illegal operations are necessary to protect the world. Fury stated that \"the world is filling up with people that can't be matched\" and advocates methods for S.H.I.E.L.D. to arm themselves against potential threats, even if it involves creating weapons of mass destruction. Fury himself quotes \"that S.H.I.E.L.D. sees the world as it is, not how it likes to be seen\"; though Captain America believed that Project Insight was controlling people using fear. Fury's main goal was world safety against alien and human threats, going so far as to create a team of people with extraordinary abilities called the Avengers and secretly planned to use an unlimited power source for weapons as a secondary security option. The latter was kept secret, even from the Avengers. \n", "While his decisions make him appear ruthless and the nature of his profession occasionally requires a moral grey, Fury genuinely cares about human life and didn't see his agents or Avengers as pawns. One of his own agents, Phil Coulson, was also his closest friend and he seems to trust people like Maria Hill and Steve Rogers. However, he did use the death of Phil Coulson to motivate the Avengers and used alien biology to bring him back to life, no matter how much Coulson begged to die. In fact, he would often help the Avengers, whether by providing resources or motivating them during turbulent times. When New York was under attack by the Chitauri, the World Security Council insisted on a nuclear strike on New York, but Fury refused to destroy a populated city. He was also seen rescuing people from Sokovia when Ultron uplifted it in the air and intended to use it as a weapon against Earth. In spite of the seriousness of his job, Fury has displayed a knack for dry humor and a use of visual puns whilst regarding his missing eye and his constant global surveillance, often using irony and metaphors due to the combination, i.e. referring to Tony Stark \"I've got my eye on you\".\n", "Nick is a man of great and indomitable will, but he too can feel, as he was shaken with the death of Coulson and was deeply disturbed at seeing Maria Hill fade away due to Thanos snap while using the Infinity Gauntlet.  While visiting Tony Stark at Clint Barton's home, Fury told Stark that he cared very much about him. It is also shown that Fury has a soft spot for cats, as shown by his interactions with Goose.\n", "One thing about Fury for certain is that he prefers everyone that knows him to only call him by his last name, even his family. This allows him to know instantly if there's a spy or imposter around, if they call him Nick or Nicolas. Though if its someone who likes to annoy him, it also allows Fury to confirm their identity.\n"], "personality_quotes": [["\"When you want to build something, you need a strong foundation. Now, you know how few people I trust, Coulson.\"\"You can count them on one hand.\"\"And I'm not afraid to cut off fingers.\"", "―Nick Fury and Phil Coulson[src]"]], "figure_captions": [], "quote": ["\"I'm trading in my bird's eye view for two solid feet on the ground. This is the last time you'll be seeing me for a stretch.\"\"You're going to disappear. Nowhere to be found.\"\"Nowhere? You know me better than that, Phil. I'll be everywhere.\"", "―Nick Fury and Phil Coulson", "Beginning of the End"], "description": "Nicholas \"Nick\" Joseph Fury was a former Colonel who had served with the United States Army and an espionage veteran of the CIA during the Cold War. Continuing to serve the world, Fury joined S.H.I.E.L.D., a covert international peacekeeping organization which operates as humanity's first line of defense against Earth's most dangerous enemies. The great scope of enemies widened as Fury met Kree warrior Vers. Fury helped her uncover her human heritage as Carol Danvers, as the two fought off the Kree Starforce, which was led by Yon-Rogg, as they targeted refugee Skrull families. Fury took a liking to Mar-Vell's pet Flerken, Goose, who proceeded to scratch him and permanently blinded his left eye. Fury has kept the reason for this injury his secret while Captain Marvel had left the Earth.\n"}