{"id": "Obadiah_Stane", "name": "Iron Monger", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Obadiah_Stane", "personality": ["Publicly, Obadiah Stane appeared as a loyal and devoted friend to the Starks; his business partner Howard Stark, whom he helped build Stark Industries from the ground up with and his son, Tony whom Stane was seemingly affectionate towards. In reality, he deeply enjoyed the authority and respect that came with being CEO. This eventually caused him to place a hit on the young Stark using the terrorist organization, the Ten Rings.\n", "More than once, Stane proudly called himself as a weapons manufacturer and \"iron monger\" and shows that the only value he was concerned about was the one that would result in profit, which he used to convince the board of Stark Industries to remove Stark from power after he effectively shut down the weapons division of Stark Industries culminating in a highly significant drop in the stock market. After utilizing the Iron Monger Armor, Stane quickly went on a rampage and attempted to destroy everything in his path during his fight against Iron Man. Throughout their fight, he constantly stated how much he was enjoying the suit's power, causing havoc and recklessly ignoring human life or casualties, claiming that it was only \"collateral damage\".\n"], "personality_quotes": [["\"Do you really think that just because you have an idea, it belongs to you? Your father, he helped us give the atom bomb. Now what kind of world would it be if he was as selfish as you?\"", "―Obadiah Stane to Tony Stark[src]"]], "figure_captions": [], "quote": ["\"Gentlemen, what is at stake here? I want you to think about this. Civilization has been preserved because the right people have had the right idea at the right time! This technology, it comes along once in a generation, and it's a gift that has been put in our hands. And why is that? It's because we have a vision, a vision for the future of this company, of this nation, of the world order! Because, make no mistake, this tool that you are creating in the wrong hands would end civilization as we know it.\"", "―Obadiah Stane", "Iron Man "], "description": "Obadiah Stane was the business partner of Tony Stark and a good friend of his father, Howard Stark. After Howard Stark's death, Stane became interim CEO of Stark Industries until Tony Stark took over officially shortly after. Stane's jealousy of the younger Stark led him to join forces with the Ten Rings to organize a failed attempt to assassinate him so Stane could become CEO once again. When this failed Stane created the Iron Monger Armor and attempted to kill Stark himself, leading to his own death.\n"}