{"id": "Obadiah_Stane", "name": "Iron Monger", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Obadiah_Stane", "personality": ["More than once, Stane proudly calls himself as a weapons manufacturer and \"iron monger\" and shows that the only value he is concerned about is the one that would result in profit, which he uses to convince the board of Stark Industries to remove Tony from power after he effectively shuts down the weapons division of Stark Industries culminating in a highly significant drop in the stock market. Because of this Stane was somewhat of an anti-environmentalist as, although he made an Arc Reactor project which was a clean power source, he claims it was only a publicity stunt to appease the protesters against Stark Industries and that it would be too costly to continue the project further. Stane was highly arrogant and he treated most people who worked with or under him poorly. Raza states that he payed the Ten Rings \"trinkets to kill [Tony Stark]\" after proceeding to massacre him and the rest of his group for his failure and to steal the Iron Man Armor Mark I. Similarly, he reacted with rage that one of his lead doctors was unable to miniaturize the Arc Reactor, claiming that Tony Stark was able to with even less resources - which is also a display of Stane's deep inferiority towards Stark.\n", "After utilizing the Iron Monger Armor, Stane quickly goes on a rampage and destroys everything that comes in his path during his fight against Iron Man. Throughout their fight, he constantly states how much he is enjoying the suit and sadisitcally causing havoc and recklessly ignoring human life or casualties, claiming that it was only \"collateral damage\".\n"], "quotes": [["\"Do you really think that just because you have an idea, it belongs to you? Your father, he helped us give the Atomic Bomb. Now what kind of world would it be if he was as selfish as you?\"", "―Obadiah Stane to Tony Stark[src]"]], "figure_captions": []}