{"id": "Odin", "name": "Odin", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Odin", "personality": ["Odin was a patient, just, and wise king. He strives to maintain the peace between the Nine Realms and is thoughtful of the lives of the innocent. Despite his enemies warring against him and his willingness to cause mass destruction when needed, he is compassionate enough to not seek the obliteration of the innocents of the opposing force. He even adopted Loki, the abandoned son of his old foe, and raised and loved him as his own son. Nevertheless, Odin is firm in his rule and does not hesitate to mete out justice on those who threaten the peace, even if it is his own sons.\n", "Odin was considered to be the wisest king in Asgard's history, admired by all for his leadership, and was thus an exceptional leader. He had effectively led the Armies of Asgard into victory in countless wars over all the Nine Realms. His skill allowed him to conquer the Nine Realms when he sought to conquer all the Realms. However, after realizing peace is the only way to truly unite the Realms, Odin became the benevolent, peace-loving, nearly all-powerful and all-knowing ruler of Asgard and the guardian of the Nine Realms. As such, he was wise and honorable. He was dedicated to using his power for keeping the peace between the Nine Realms. He believed in being responsible (in terms of being careful and responsible for one's actions), duty (in terms of the protection of and keeping the peace between the Nine Realms) and honor (always being a man of his word). However, when angered or upset, he could be very stern to the point of ruthlessness when necessary. As Frigga stated, \"everything he does, he does with a purpose.\" He loved Thor but when Thor went to Jotunheim and nearly started a war in the process, he exiled Thor to Earth, to teach him what it meant to a good warrior and a hero, as well as to bolster his humility.\n", "While he is a good king who cares about the peace of the realms, he was willing to sacrifice as many Asgardians as necessary if Malekith had attacked again, showing to be just as ruthless as Malekith at the time, as Thor noted, due to the intense grief, rage, and need for revenge coursing through him after Frigga's death. Thor realized that Odin, due his lust for vengeance, was not thinking straight and under his rule, Malekith would be able to destroy Asgard.\n", "In his youth, Odin was a ruthless war king who had no qualms violently conquering the Nine Realms with his daughter, Hela. After conquering the Nine Realms, Odin underwent a change upon realizing that only through peace can the Nine Realms truly be united and desisted with further conquest. He then made a transition both societal and personal, shifting from a ruler of a war seeking realm into the wise and benevolent king his sons grew up knowing. Hela was not able to make this transition, which resulted in a conflict that ended with her exile and imprisonment.\n", "He was also criticized by all three of his children and Brunhilde on how he dealt with his problems and past mistakes, most often through secrecy, lies or by covering them up. He hid the original mural depicting his bloody history and conquests with Hela by covering it with a mural that showed him and his family uniting the realms through peaceful methods, and even erased his daughter from Asgardian history. He had never revealed to Loki his heritage, hoping that by hiding it, his adopted son wouldn't feel disparate from his family. Though he loved and respected him, Thor openly admitted his father's faults to others, even commenting that Hela had a right to be angry at him. Odin later showed remorse and regret for how he handled his mistakes and problems in his last moments, implying his exile made him realize had he not used secrets and lies, things would not have escalated to Ragnarök.  \n", "In his exile, Odin apparently thought over all the acts he had done and likely felt remorse over them, as he showed no hostility towards Loki and even noted Frigga would be proud of him. He also admitted he truly loves his sons and expressed remorse for failing to stop Ragnarök. He had made peace with his fate and died peacefully while in the company of his sons, apparently content he would be reunited with Frigga in the afterlife and leave Thor as the King of Asgard. His spirit was much kinder and less strict to Thor, as when Hulk pummeled Thor, instead of being angry and strictly asking him to get up, Odin simply serenely smiles at his son and later openly encouraged Thor that he was stronger than him.\n"], "quotes": [["\"All this because Loki desires a throne.\"\"It’s my birthright!\"\"Your birthright was to die, as a child! Cast out onto a frozen rock. If I had not taken you in, you would not be here now to hate me.\"", "―Odin and Loki[src]"]], "figure_captions": []}