{"id": "Peggy_Carter", "name": "Peggy Carter", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Peggy_Carter", "personality": ["Carter was tough and resilient, standing strong whenever she was mistreated, be it by man or woman. She had a sarcastic streak, and could also become close to a select few people, such as Steve Rogers, Howard Stark, Edwin Jarvis, and a few others. Though she believed in morality, she was willing to lie if the situation called for it, including the period when she was hiding her involvement with Howard Stark from the SSR.\n", "A loyal soldier, Carter was willing to do whatever was needed to get the job done, very nearly having Howard Stark shot out of the sky, when he was endangering the city of New York. Such sacrifices wounded her; she did not enjoy it. Being somewhat no-nonsense, Carter did not take kindly to messing about during a mission or when there was work to be done. She was also quite clever, always able to work her way out of a pinch at a moment's notice. Though her number of dear friends was slim, she was exceedingly appreciative to those she had.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["\"The world has changed, and none of us can go back. All we can do is our best. And sometimes... the best that we can do is to start over.\"", "―Peggy Carter to Steve Rogers", "Captain America: The Winter Soldier"], "description": "Margaret Elizabeth \"Peggy\" Carter was one of the most prominent agents of the Strategic Scientific Reserve during and after World War II and one of the founders of S.H.I.E.L.D.. Originally a code-breaker working at Bletchley Park, she joined the Special Operations Executive following her brother's death. Carter later joined the SSR, formed to fight HYDRA. On the mission in Germany she saved Abraham Erskine from Johann Schmidt. The success of her mission enabled the SSR to start Project Rebirth and develop their Super Soldier Serum to make the army of Super Soldiers. During the project she had befriended Steve Rogers, one of the project's candidates.\n"}