{"id": "Pepper_Potts", "name": "Pepper Potts", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Pepper_Potts", "personality": ["As one of Tony Stark's oldest and closest friends, Pepper knows Stark better than most and has always been there for him, whether he knew it or needed it. Though outsiders would view her as a degrading assistant or lackey, Stark himself appreciates her dedication and how long she took out with him when compared to everyone else and trusted her enough to run Stark Industries but his own self-obsession irritates and occasionally drive her away due to forgetting her birthday and buying her strawberries as a gift, the one thing on earth that she is allergic to.\n", "Despite knowing her place, Potts does not take disrespect to herself lightly. A sarcastic woman, when Christine Everhart condescends to her, she retains her decorum but snidely insinuates Everhart to be trash she needs to take out. With Stark, despite being her boss, Potts is not above a barbed remark for him such as buying herself a birthday gift with Tony's money when he forgot and keeping his Arc Reactor in a glass case, reading; \"PROOF TONY STARK HAS A HEART\". She seems to dislike violence in general, becoming deeply shocked by the explosion of the Hammer Drones at the Stark Expo and disgusted over violently killing Aldrich Killian with Extremis.\n", "Even though Potts has proven to be a defining point for Stark's development and maturity, the relationship between the two of them is a definite struggle. At times, although he originally took up the mantle of Iron Man because the world needed it, Potts became to realize that Stark needed to be Iron Man more, causing strain as his tinkering and his suits were only a distraction to what really mattered in his life. His actions over the anxiety of a world with gods and aliens were designed to protect the ones he loves, which included her. However, this also pushed her away further. Ultron was designed to be the last line of defense for Earth against these threats so Stark being Iron Man would no longer be a necessity, but as his mistake created more problems and thus more reasons why he needed to be Iron Man, Potts could no longer be in a relationship with him and they decided to take a break. Despite these setbacks, Pepper decided to look past them and she ultimately got back with Stark once the Avengers Civil War was over and even helped Stark introduce Peter Parker as the newest member of the Avengers though when he declined, Stark decided to propose to her. When Stark was presumed dead again by the world during the Infinity War, Pepper was one of the few who knew he was alive and she demanded Stark to come back to her when she learned he became Iron Man again.\n"], "quotes": [["\"You are the most capable, qualified, trustworthy person I've ever met.\"", "―Tony Stark[src]"]], "figure_captions": []}