{"id": "Quake", "name": "Quake", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Quake", "personality": ["When first met, Skye was a confident woman obsessed with superhero culture and the shadow organizations that existed within it. She is edgy and can out-talk anyone with her unflappable nature. However, after the ordeal against John Garrett, Skye became more aloof, taking her role as a member of Coulson's new S.H.I.E.L.D. more seriously.\n", "Originally, Skye viewed S.H.I.E.L.D. as a \"1984\", Big Brother-style government organization filled with secrets. When S.H.I.E.L.D. fell, Skye realized its place in keeping order and law enforcement. Presently, she has expressed that Coulson's S.H.I.E.L.D. is now her life, including a desire to stand with her Supervising Officer Melinda May in an unknown situation.\n", "Emotionally, Skye loves her friends deeply and worries for their well being. She harbors deep resentment towards Grant Ward for his betrayal. When she discovered that Simmons was a mole for S.H.I.E.L.D. in HYDRA, Skye had to be reassured by May before believing that Simmons would be safe. She noticed that something was wrong with Coulson when he needed to purge himself of the Words of Creation, though others, except for May, did not. She enjoyed her time on the Bus before the HYDRA Uprising and went there to work when it became available.\n", "When transformed, Skye became frightened by her new powers and how people would react if they found out, especially Jemma Simmons, who had developed a hatred for those with powers after her encounter with Raina. Despite Skye's attempts to get back into the field, she had to resort to shooting herself with an I.C.E.R. to stop herself and when trying to suppress her powers, she inadvertently injured herself in the process. Escaping with Gordon and meeting Lincoln Campbell and Jiaying, Skye soon started to accept her new powers and she was shocked to learn her true heritage from her mother. She also became more compassionate to Calvin Zabo, despite all that he had done in the past, where she also learned her true name. However, she still remains loyal to Phil Coulson as she insisted Gordon teleport her to S.H.I.E.L.D. to help him save Lincoln and Deathlok.\n", "Having gradually accepted her new state of being and her birth name, Daisy became committed to helping other awakened Inhumans come to terms with their new abilities and help make a difference with S.H.I.E.L.D. As such, she becomes greatly emotional when Inhumans are either put in stasis, treated like a disease, or persecuted. This seems to have caused her to develop a ruthless streak, such as when she interrogated a suspected Watchdog supporter by intimidating him with her powers, her reasoning being that the Watchdogs and their supporters gave up their civil rights by spewing hate and destruction.\n", "After being released from Hive's control, Daisy developed self-loathing, blaming herself for all her actions that the dark Inhuman had forced her to carry out. She was adamant that she should be punished for her actions under Hive's sway, refused to listen any attempts by others to forgive her, and later attempted to commit suicide by fulfilling a vision Charles Hinton had shown her of a S.H.I.E.L.D. agent's death, taking Hive with her in the process. This attempt was only averted by Lincoln Campbell, who sacrificed himself in Daisy's place. These two combined traumas likely caused her decision to abandon S.H.I.E.L.D. and become a vigilante known as Quake. Judging by her request that Ghost Rider kill her, a request denied since the Spirit of Vengeance judged her innocent, this self-loathing still persists even after months of hunting thugs and protecting people.\n", "Initially, Daisy didn't trust the Framework version of Ward, believing he was just like the original. But, after spending enough time with him and seeing how much he loved her, she started to warm up to him. Even trying to stop him from staying behind to fight the Framework version of HYDRA. After an emotional talk with Ward, Daisy finally came to understand the real Grant Ward and seemed to have finally forgiven him for everything he did, realizing there was still good left in him, something that the rest of Coulson's team believed to be highly untrue.\n", "Upon traveling to the year 2091, Daisy was at first in denial that she would destroy the world in the future. But after seeing Samuel Voss's apparent proof of her future self's last known actions, Daisy slowly began to fear the possibility, at which she refused to return to the present or even have her powers restored when the Kree implanted a power inhibitor but Coulson took the choice out of her hands. Later on, when Fitz's Framework persona drove him to forcibly remove the inhibitor, Daisy hated him and refused to forgive or even trust him, only not killing him because of Simmons.\n", "Despite being comfortable leading S.H.I.E.L.D. strike teams including the Secret Warriors, Daisy was least comfortable being burdened with the mantle of Director when Coulson was captured by HYDRA. This made her far stricter, especially after Fitz removed her inhibitor, with Deke Shaw remarking that she had become a \"hard-ass\" since that incident.\n", "A quality unique to her is that Daisy has an incredible amount of respect for an individual's autonomy. This is because throughout her life Daisy's autonomy was often disregarded even by those who she trusted greatly. As a result, regardless of circumstance Daisy will always try to avoid taking away an individual's ability to make their own choices even if others disagree. She was even willing to provide Ruby Hale with a pathway for redemption despite all the atrocities the latter had committed against S.H.I.E.L.D.. This was because she considered Hale's abusive and misguided parenting the root cause of Ruby's villainy whilst also seeing Ruby as a kindred soul who also had control taken away from her.\n", "Daisy also has an immense care for children and their well-being and is surprisingly capable of handling them, she first showed these instincts with Ace Peterson and later Robin Hinton. With the former she took as many steps as possible to ensure he was least affected by his father's new reality and with the latter, she ensured that she and her mother would be supported following her father's demise. In addition, with Robin she displayed care and understanding of the later's situation, never forcing her to provide answers even when she was desperate for them.\n"], "quotes": [], "figure_captions": []}