{"id": "Quicksilver", "name": "Quicksilver", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Quicksilver", "personality": ["Pietro is a rather cocky, arrogant, impatient, tenacious, and quick-tempered person. These personality traits are likely a side affect of his super-speed, due to thinking and acting at a much faster rate than most. Despite this, Pietro has a desire for peace as he wished to save his country to the point he was willing to be experimented on by HYDRA, giving him the formidable powers he now possesses.\n", "He also deeply cares for Wanda and the two shared a deep bond though they would occasionally bicker like normal siblings. He looked after his sister and relied on her for support, while also being fiercely loyal and protective of her that he was willing to kill Hawkeye when he incapacitated Wanda with a shock arrow. Wanda was devastated by Pietro's death at the hands of Ultron, to the point she said to Ultron that she just 'died'.\n", "Pietro originally desired to destroy the Avengers and in particular, Tony Stark for revenge, to the point they decided to join Ultron when he said he shared the same goal. However, Pietro chose to betray the A.I. when he found out about his true goal, showing that he is willing to put aside his personal grudges for the greater good.\n", "Out of his relationships with the Avengers, his most complicated was with Hawkeye. Ever since they first met, the two had constantly competed, fought, and taunted each other. Though this initially started out as hatred, their relationship eventually becomes a friendly rivalry and they became good friends and teammates through Pietro helping the Avengers, while still continuing their friendly banter during the Battle of Sokovia. He later proves himself a true hero and Avenger by sacrificing his life to protect Hawkeye and a civilian boy from the Quinjet's gunfire. Hawkeye later named his newborn son, Nathaniel Pietro Barton, showing that he deeply respected Pietro for his choices.\n"], "personality_quotes": [["\"Keep up, old man!\"", "―Quicksilver[src]"]], "figure_captions": [], "quote": ["\"You didn't see that coming?\"", "―Pietro Maximoff to Hawkeye", "Avengers: Age of Ultron"], "description": "Pietro Maximoff was a native of the Eastern European country of Sokovia who grew up with his fraternal twin sister, Wanda. The country, which was embroiled in constant war and strife, became the base of operations for a HYDRA cell operated by Wolfgang von Strucker, who recruited Pietro and Wanda to take part in a series of tests involving the Scepter, giving the twins superpowers. While his sister received a number of mental abilities, Pietro acquired the ability to move at supersonic speeds and other physical features. \n"}