{"id": "Red_Skull", "name": "Red Skull", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Red_Skull", "personality": ["Johann Schmidt is a megalomaniac and egocentric genius who firmly believed in the Nazi Party's long-standing misinterpretation of Friedrich Nietzsche's Übermensch, over-man, a concept where a race of superhuman beings are destined to rule the normal ones. Believing himself to be such a man, he used any means necessary to obtain a central position in Adolf Hitler's army, until his conceit made him arrive at the point of believing himself to be greater than Hitler, and thus starting a plan to overthrow him. Unlike other Nazis, Schmidt doesn't believe that the Germans are the destined \"master race,\" but rather that the superior man has yet to be made. Also, Scmidt did not personally care to follow the Nazis' infamous holocaust plan against the Jewish race, although he nonetheless used it as a threat against Abraham Erskine to force him to make the Super Soldier Serum.\n", "Schmidt is pitiless and cruel, but also a scientific genius, who is able to see beyond appearances and managed to see the truth behind myths believed to be superstition, which is, in reality, fragments of Asgardian origin. While he does believe in myths and arcane mystics, he does not view them in a religious or superstitious manner but instead sees them as a form of science to be studied and used for their own purposes, as he stated to the Church Keeper. \n", "Schmidt was said to be a fully-fledged supporter of the Nazi Party until the incident which left him deformed. The truth is that he worked with the Nazis only so he could use their resources to achieve his own goals, and no longer seemed to share the racial ideals of Nazism. He claims that he was isolated to his HYDRA Headquarters in the Alps because he no longer shares Hitler's image of Aryan perfection. In addition, despite otherwise being proud of leaving humanity far behind to the extent of openly stating that he embraces this without fear, he nonetheless gets angry when reminded of the deformities inflicted by the super serum prototype, especially in an insulting manner, as evidenced by his reaction to Schroeder's reference to him as the \"Red Skull.\" Though he is disillusioned by the Führer's ideals, he is still morally devoid and capable of mass murder. Once a mere professor at the University of Berlin, Schmidt became a cold-blooded killer who would do anything to accomplish his goals. Even his subordinate officers had reasons to fear him as Schmidt had an extremely low tolerance of failure: If they didn't do their job right, death was the only penalty he would give to those who failed him.\n", "After becoming the Stonekeeper on Vormir, Schmidt became much more humble and reserved after years of being unable to take the Soul Stone for himself, to the point of accepting his deserved fate as the guardian of the Soul Stone. As a result of his omniscience, immortality, and wisdom of the Infinity Stones, which he acquired from the Soul and Space Stones respectively, Schmidt has become deeply indifferent towards mortal matters as can be seen with his attitude towards Thanos and Gamora, not caring what happened to either one. He doesn't even care if the Soul Stone is taken though considering that Thanos met the conditions to acquire it, he obviously saw him as worthy of its power.\n"], "quotes": [["\"Schmidt believes he walks in the foot steps of the gods. Only the world itself will satisfy him.\"", "―Arnim Zola[src]"]], "figure_captions": []}