{"id": "Rocket_Raccoon", "name": "Rocket Raccoon", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Rocket_Raccoon", "personality": ["Due to the inhumane experiments done to him, Rocket became bitterly, even bitingly sarcastic and cynical, as well as generally misanthropic, but in recent years seems to have adopted a more calm and temperamental demeanor. He is also easily enraged and extremely aggressive, which, in turn, makes him exceedingly trigger-happy with an innate desire for violence. Despite his toughness, he also possesses a cruel and slightly morbid sense of humor.\n", "Rocket has an obsession with prosthetic limbs, finding it humorous to steal them - especially without the possessor knowing as shown when he asked Peter Quill to get a guy's prosthetic leg to bust them out of jail, lying about the leg to see if Quill would do it and asking him whether the guy was hopping around on one leg, laughing all the while. He later tries pulling a similar stunt with Vorker, one of the Ravagers, saying that he needed the cybernetic eye off for his plan, although he is stopped by Quill. When Groot actually did steal the eye, Rocket burst out laughing into tears. In the Battle of Wakanda, after being assisted by Bucky Barnes in killing a horde of Outriders, he inquired if he can purchase his custom-made machine gun. When he declines the offer, he then offers to purchase Barnes’s new vibranium arm, which is also declined. He chuckles to himself as he leaves the offer to buy it on the table.\n", "He appears to pride himself on his abilities and professionalism, which is indicated by when he spoke harshly to Groot when Groot childishly drank out of a fountain then smiled about it. A true criminal, Rocket has a higher sense of self-preservation and interests than the rest of the Guardians of the Galaxy. In the conflict against Thanos he volunteered himself and Groot to go with Thor to Nidavellir as opposed to going with his fellow Guardians to confront Thanos directly, and Star-Lord points this out. He will cave into pessimism and panic in a situation that is out of his depth as he was the first to consider simply giving the Infinity Stone to Ronan the Accuser after realizing its destructive purposes and instead of fighting the Accuser after coming into the possession of the Stone, planned to run away to \"the furthest corners of the galaxy\" with Groot.\n", "Though he displays a somewhat heroic personality, such as defending Xandar from the kamikaze Necrocrafts, Rocket still has a distorted view of the logical and ethical boundaries of the law as he believes if he wants a possession more than the current possessor of such an item, it was acceptable to steal it from him. Rocket was driven by money before he joined the Guardians of the Galaxy and that trait still remains with him, but he has shown himself to be more compassionate and less greedy as time goes on. Although he does not resort to stealing as like he used to and opts for more acceptable methods by noting if they saved the galaxy twice, they could increase the fee for their services.\n", "Rocket is also stunningly intelligent, as he is much more intelligent than a normal raccoon. He is able to conceive very complex, intricate plans in a very short period of time, such as his plan to escape the Kyln. However, his genius is occasionally superseded by his emotions which appear to be exceedingly strong such as his anger over Quill going back to get Awesome Mix Vol. 1 and his sadness over Groot's apparent demise.\n", "However, deep down, Rocket is incredibly lonely and carries overwhelming pain over the experimentation that was performed on him before he was a Mercenary. He covers his insecurities well, but once he is drunk, he becomes very emotional and if possible, even more violent, speaking of how he did not 'ask' to be made into what he believed was a \"little monster\", implying that the experiments done to him were torturous. It is perhaps because of this loneliness and pain that he despises being derided as a rodent or vermin, going so far as to attack Gamora and Drax the Destroyer over the slight.\n", "Despite Rocket's apparent dislike of people, he is exceedingly attached to Groot, and is the first known individual who was able to understand Groot when he spoke, even while everyone else only heard 'I am Groot.' He is obviously exceedingly attached to Groot, as seen when he started crying when Groot was apparently killed and pleading with Groot to not save them because he knew that Groot would die if he did so. His grief over Groot's apparent death lead him to angrily charge at Ronan, who was armed with his Cosmi-Rod and the Power Stone, while completely unarmed. It was also in this moment of vulnerability that he was comforted by Drax the Destroyer, which he initially flinched at before accepting the caring gesture, showing that he was not used to such gentleness or kindness. He also became very protective of Groot’s offspring, caring for him in a fatherly manner and collapsed to his knees sobbing when he was erased from existence by the Infinity Gauntlet.\n", "As he got to know his fellow Guardians better, he became much more protective of them. An example of this was when he, Groot and Yondu Udonta escaped the Eclector and were going to save Quill. He initially insisted that he wanted to save Quill strictly because he wanted to prove that he was \"better than him\". Udonta managed to break through to the core of what Rocket is truly like on the inside, saying that they are the same type of person in the sense that, while they genuinely care about the people around them, they refuse to show it out of fear and insecurity.\n", "Quill's taste in music seems to have rubbed off on Rocket as he seems to enjoy listening to songs from Star-Lord's era, especially while working such as making sure the Guardians had music to listen to whilst battling the Abilisk, when the Ravagers attacked him on Berhert and escaping the Ravagers with Udonta, the former even Quill found to be distracting.\n", "While captive with Yondu Udonta, Rocket quickly bonded with him due to their similar backgrounds and the fact that they love people without saying it. A great example of his newfound bond with Yondu is when he refused to leave Ego's Planet without him, even though it would mean his death since the planet was about to explode. His bond with Yondu also caused him to call the rest of the Ravagers during Udonta's funeral. While watching his funeral, Rocket stated the his previous team never abandoned him even if \"he yelled at the, and was always mean, and he stole batteries he didn't need\" clearly comparing himself to Udonta\n", "Four years after the Battle on Ego's Planet, Rocket has become slightly more empathetic, showing a growing level of maturity, as seen when he consoled Thor over his multiple losses and became concerned for him after he nearly died activating the damaged neutron star, though he still has his money-driven personality, as seen when he stated they could ask for financial compensation when traveling to respond the Statesman distress call.\n"], "personality_quotes": [["\"I know everything about you. I know you play like you're the meanest and the hardest, but actually you're the most scared of all.\"", "―Yondu Udonta to Rocket Raccoon[src]"]], "figure_captions": [], "quote": ["\"Ain't no thing like me 'cept me.\"", "―Rocket Raccoon", "Guardians of the Galaxy "], "description": "89P13 is a genetically enhanced raccoon turned freelance criminal, calling himself Rocket. Alongside his friend and partner Groot, Rocket traveled the galaxy picking up bounties until they met Star-Lord who then convinced them to assist him to sell the Orb for a massive profit. However as it was discovered that the Orb was one of the Infinity Stones which was being sought out by Ronan the Accuser, Rocket was convinced to risk everything to stop Ronan's plans to destroy Xandar and enslave the world. During the ensuing conflict, Rocket managed to assist his friends in destroying Ronan, despite Groot being killed. He then became a member of the Guardians of the Galaxy alongside the newly planted baby Groot.\n"}