{"id": "Scarlet_Witch", "name": "Scarlet Witch", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Scarlet_Witch", "personality": ["Due to childhood trauma from seeing her parents killed right in front of her, and the constant war-like state of her home, Wanda Maximoff had developed a very aggressive personality. From being involved in protests to volunteering for Wolfgang von Strucker's experiments, and joining the Avengers, Wanda has shown that she prefers to fight directly for what she believes in. Her passionate nature and willingness to engage in violence to achieve her goals led her to mistakenly side with Ultron, which deeply influenced much of her future actions.\n", "Her passion was partly fueled by her hatred of the United States of America and Tony Stark and was strong enough to have her side with a clearly murderous robot for what she believed to be the greater good. She was therefore unfazed when Ultron killed Wolfgang von Strucker and was willing to send the Hulk on a rampage in Johannesburg, costing the lives of both soldiers and civilians. Fortunately, she was not blinded by passion and was capable of reason, clearly being appalled by the level of destruction Ultron was trying to achieve, and promptly sided with the Avengers to make amends. After getting to know the Avengers, she has since let go of any grudge or hatred she previously held against the team as well as the United States.\n", "Due to her past affiliation with Ultron and her role in the destruction of Sokovia, Wanda carried a deep fear of making mistakes and was frequently wracked with guilt and remorse. Her self-doubt and guilt over the mistakes she has made have at times led her to inaction, even though she is generally action-oriented. Despite this, Hawkeye was able to talk her into action, affirming her desire to fight for what she feels is right, despite what others may think of her.\n", "In contrast with her brother, Scarlet Witch displays a more serious attitude and direct anger, not only against Tony Stark but against anyone that she perceives as her enemy, such as Klaue and Thanos. Her anger leads her to be vengeful, as demonstrated when she volunteered for experiments to become a weapon against the United States and Tony Stark, seeking out Ultron's primary body in order to destroy him after he caused the death of her brother, and angrily telling Thanos that he could not understand her pain after she was forced to kill Vision in the attempt to stop him. In the past, she had no qualms about manipulating others mentally in order to achieve what she wanted, though she later regretted doing this.\n", "Wanda became considerably more mellow after joining the team, as she is seen to be more compassionate, level-headed, and less inclined to use the manipulative aspects of her abilities, such as fear projection and mind control. Driven by a desire to fight in the front lines rather than as passive support, Wanda honed her powers to become more combat-oriented, focusing on energy blasts, throws, and barrier projection, relying less on her telepathic abilities. Having become less aggressive and more reluctant to do harm, she has not been seen using her mental manipulation powers since joining the Avengers. Additionally, she rarely uses her powers to deal out lethal force unless completely necessary, using her powers more often to incapacitate her opponents. However, she also is less inclined to hold back in a fight, even against fellow Avengers, as shown when she hurled Black Widow several feet when she attempted to overpower Hawkeye. She has shown a willingness to kill her enemies in extreme circumstances, as shown when she telekinetically threw a carving knife at a perceived assailant before realizing it was Hawkeye, and when she purposefully lifted Proxima Midnight into a Thresher and shredded her to stop the latter from killing Black Widow.\n", "Wanda grew to care for Vision during their time together. She was, however, disappointed that he was more loyal to Stark and the people of Earth than to her. However, in the aftermath of Avengers Civil War, she has put the grudge aside and developed strong romantic feelings for him to the point that after she escaped from the Raft she went off the grid with him to Europe and was in the beginning stages of starting a new life with him. Her feelings grew strong to the point that she tried her best to protect him Thanos and the Black Order despite being at a great disadvantage, and refused to kill him until there was no alternative, resisting even when he himself agreed that his death was for the greater good of the universe. When forced to kill him, Wanda openly wept as she was killing the being she loved more than anything else. Wanda was horrified when Vision was briefly resurrected and emotionally devastated when he was killed a second time by Thanos, sitting at his side in mourning minutes before her death.\n"], "personality_quotes": [["\"What about the core?\"\"I'll protect it. It's my job.\"", "―Hawkeye and Scarlet Witch[src]"]], "figure_captions": [], "quote": ["\"I used to think of myself one way. But, after this. I am something else. And still me, I think. But... that's not what everyone else sees.\"", "―Wanda Maximoff to Vision", "Captain America: Civil War"], "description": "Wanda Maximoff was a native of the Eastern European country of Sokovia who grew up with her twin brother, Pietro. In an effort to help purge their country of strife, the twins agreed to undergo experiments with the Scepter under the supervision of Wolfgang von Strucker's HYDRA cell, and received superpowers as a result, with Wanda attaining various abilities including telekinesis, telepathy, and energy manipulation. When HYDRA fell, the twins joined the robot Ultron to get their revenge on Tony Stark, but eventually switched sides and joined the Avengers when they discovered Ultron's true intentions. Although Pietro was killed during the ensuing Ultron Offensive, Wanda survived and became a member of the Avengers. During the Avengers Civil War, she sided with Captain America and was briefly imprisoned in the Raft before Rogers freed her along with his teammates.\n"}