{"id": "Sharon_Carter", "name": "Sharon Carter", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Sharon_Carter", "personality": ["Sharon is guided by a strong moral compass and is not afraid to speak out when her ethics are challenged. She holds a high opinion of and belief in Steve Rogers, due to stories of him passed down from her aunt and from how often the two would see each other due to her being assigned to watch over him; during this assignment, the two developed a romantic interest in one another, eventually sharing a kiss, the two of them joking that it was \"late\". Because of this, she sided with him despite Rogers protecting the very man which the organization she was by then working for was after, and accepted the trouble she would be in for it.\n", "Sharon was in great awe of the life her aunt Peggy had lived; at Peggy's funeral, Sharon mentioned a picture of Peggy standing next to JFK, describing it as \"cool\" but \"a lot to live up to\". Because of this, she never told anyone prior to this that the two were related, but was nonetheless determined to follow in her footsteps, leading her into joining S.H.I.E.L.D. She was loyal to S.H.I.E.L.D right up until its collapse following HYDRA's uprising, after which she joined the CIA.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["\"I asked her once how she managed to master diplomacy and espionage at a time when no one wanted to see a woman succeed at either. And she said, \"Compromise where you can. Where you can't, don't. Even if everyone is telling you that something wrong is something right. Even if the whole world is telling you to move, it is your duty to plant yourself like a tree, look them in the eye, and say, 'No, you move'.\"", "―Sharon Carter", "Captain America: Civil War"], "description": "Agent Sharon Carter is the great niece of legendary S.H.I.E.L.D. founder Peggy Carter. Following in her aunt's footsteps, Carter became an agent of S.H.I.E.L.D. who had briefly worked undercover as the neighbor of Steve Rogers under the direct orders of Nick Fury. She fought on the side of S.H.I.E.L.D. during the Battle at the Triskelion, facing off against Brock Rumlow to protect millions of lives. In the aftermath of the HYDRA Uprising, Carter left disbanded S.H.I.E.L.D. and joined the CIA, before he stationing in the Joint Counter Terrorist Centre. She continued to have a close relationship with Rogers and sided with him when he chose to protect Bucky Barnes from the government she still worked for, indirectly being responsible for sparking the devastating Avengers Civil War.\n"}