{"id": "Spider-Man", "name": "Spider-Man", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Spider-Man", "personality": ["Outside of his Spider-Man alter ego, Parker lives the life of a normal 15-year-old high school student. He cares deeply for his Aunt May. He is a very intelligent science enthusiast, capable of inventing and building his own Web-Shooters. He gathers both science and comic books in his room, along with his Spider-Man costume, which he hides in a tiny hatch above the ceiling.\n", "Parker is a friendly but shy and awkward individual; he is happy to talk but often stumbles on his own words in a conversation. As opposed to Iron Man or Captain America, Parker makes it a point to keep his identity secret since if such knowledge was made public his aunt would be worried sick and he would have major trouble with the law on the grounds of vigilantism. He even restrained Tony Stark with webbing when Stark implied to tell his aunt his identity. Parker, however, had no hesitation in revealing his identity to people he associates with through his allies, such as when he met Doctor Strange.\n", "Parker is also highly impressionable towards figures of authority, which is likely due to his young age and inexperience. An example of this was towards Captain America, when asked about why he was fighting, Parker stated that it was because Stark had said that Rogers was in the wrong, while he had no opinion of his own on the matter. Parker was also very excited to be in a fight with other superheroes, to the point where people on both Captain America's and Iron Man's teams were asking how old he was, due to his child-like behavior during the Clash of the Avengers. As such, he was also the least experienced fighter at the airport battle.\n", "A neophyte to being a superhero, Parker idolizes Iron Man and sees him as a role model, he even admires and has respect for Tony Stark, even when the latter contemplated telling Aunt May his identity which he was strongly against. Through his first official mission as Spider-Man, Parker showed a strong desire to impress the other superheroes and prove his worth, especially towards Iron Man. As Spider-Man, Parker is courageous and capable, being able to come up with clever strategies due to his scientific expertise. His bravery even led him to secretly board a Q-Ship in an attempt to help Iron Man against the universal threat of Thanos, despite knowing that Parker could lose his life in the conflict to come. He frequently annoys his enemies with fast-talking humor and quipping, prompting members of both Captain America's faction and Iron Man's to ask how old he was during the Clash of the Avengers. Parker and Tony became close to the point where when Parker learned of his impending death at Thanos’ hands he clutched to Stark terrified and weeping over dying and apologizing to Stark before he faded.\n", "During his fledgling career as a superhero, Parker was shown to be stressing over his jokes and trying to make a lasting impression on people. At first, Parker was overly-excited about being Spider-Man and constantly called Happy Hogan asking about \"a new mission with the Avengers\", unknowingly irritating him. He was very displeased about having to stick with minor jobs like stopping a bike theft or helping an elder woman. \n", "Parker gets frustrated when other superheroes do not take him seriously due to his young age. Above anything, Parker wanted to prove himself and the other superheroes that he can handle being the Spider-Man despite being a teenager, but he tends to try too hard which results in him doing reckless actions and annoying others. Parker was particularly angered when he found out Stark was limiting many of his suit's functions with the Training Wheels Protocol and demanded Ned Leeds to hack into the suit to disable it. His lack of familiarity with the suit's full capabilities initially put him at a disadvantage, though he managed to hone his skill with it through the help of Karen.\n", "His over-zealous nature even caused him to get make various mistakes, such as losing his backpack and civilian clothing by leaving them an alleyway where people could take them or restraining a man attempting to get into his car, thinking he was a car thief. His immaturity often causes him to make mistakes while in dangerous situations, especially in combat. He is notably prone to distract himself by making conversation with his opponents, making less effort than necessary to actually defeat them and end their threat, which leaves him open to attack. His loss of focus often times has him lose awareness of his surroundings, which allowed Captain America to trap Parker underneath a jet bridge, caused him to accidentally knock himself out when he jumped against a ceiling he thought was still rendered intangible by a Matter Phase Shifter and allowed Vulture to trap him underneath a gas station. In rare instances, Parker's recklessness has threatened the lives of innocents, as his battle with robbers destroyed Delmar's Deli-Grocery, nearly killing the people in the store, as well as his skirmish on the Staten Island Ferry resulting in it being split in half by Parker failing to contain a weapon used by the Vulture, who himself mocked Parker for attempting to handle things he did not understand. These situations would come to partially humble Parker, who became more aware of his flaws and more determined to rise above them.\n", "Multiple encounters with Vulture and getting crushed under a gas station caused Parker to better understand the dangers of being a superhero and became more serious and determined to capture Vulture on his own while wanting to prove to both himself and Stark that the Spider-Man Suit was not what made him powerful. He does value life, ordering Karen to not make him kill anyone when he activated his 'advanced combat mode'. Parker even tried to stop Vulture from overloading his wings and when it happened, he risked his life to save Vulture from the explosion and resulting fire, despite Vulture attempting to kill him and possessing knowledge of his secret identity. However, he was shown to use a strategy that would threaten the lives of his enemies, as his plan to have Iron Man breach the hull of the Q-Ship they were in resulted in the death of Ebony Maw, who was sucked into the vacuum of space.\n", "Successfully capturing the Vulture led Parker to show signs of becoming a more mature and responsible superhero. When he was finally given the chance to become an official Avenger, he turned it down feeling he still was not ready yet, a decision which Stark himself applauded. When Parker was anointed as an official Avenger, he was shown to be both honored and exhilarated.\n"], "quotes": [["\"When you can do the things that I can, but you don't... and then the bad things happen, they happen because of you.\"", "―Peter Parker to Tony Stark[src]"]], "figure_captions": []}