{"id": "Star-Lord", "name": "Star-Lord", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Star-Lord", "personality": ["Peter Quill was abducted from Earth by the thieves and smugglers called the Ravagers. Their leader, Yondu Udonta raised Quill and showed him how to survive in deep space. Udonta also taught Quill how to be the perfect thief. Peter Quill is naturally upbeat and sarcastic and is known for looking on the bright side. It seems that his 1980s pop culture-laden references his life on Earth.\n", "He is also very protective of his Sony Walkman that was given to him by his mother. This was shown numerous times when he attempted to assault a prison guard who took it, and when during the prison break, when Quill made his way back into the prison just to retrieve the device. Later, Quill's anger for his father was more focused due to Ego breaking the Walkman despite the confession that Ego had also murdered his mother. Being a memento of his mother, it's quite understandable why Quill was so protective and possessive of his Walkman.\n", "Before joining the Guardians, Quill lived in the ways of an average criminal and thug, going so far as killing Korath's men and attempting to kill Korath himself when they seemingly threatened his well being as they were arresting him for interrogation by Ronan. Although, he only attacked them when he was aware that he could get the drop on them and win, as well as when he knew that he could not convince them to let him go. However, he merely stunned and knocked out the guards on the Kyln with his Quad Blasters instead of using lethal force, which shows that he only would kill to defend himself or in battles with foes that are outside the law, such as Ronan and Korath's men. He is very conscientious of his physical weaknesses, which prevents him from acting impulsive as he is always aware of the dangers of his actions, especially in combat.\n", "Quill has shown he can be heroic; he was unwilling to watch Gamora die in space, so he exited his pod giving Gamora his mask, saving her life, nearly at the cost of his own. He was also the one who brought the Guardians together to save Xandar, showcasing his leadership qualities and a certain amount of charisma, since all the members were well-known outlaws. While not showing it often, Quill does have romantic feelings for Gamora, and even though she puts up a serious and cold demeanor towards him, she also reciprocates his feelings. This eventually changed few years later where they both admitted their feelings for each other, with Gamora just moments before being captured by Thanos and eventually dying, confessed that she loved Peter more than anything. Peter likewise was also extremely affected after learning of her death to the point of going into extreme rage and viciously attacking Thanos in retaliation.\n", "Quill can create inventive, and often extremely unorthodox, solutions to problems on the fly. His confrontation with Ronan the Accuser is an example of this, distracting him long enough for Rocket and Drax to put the Enforcer back together to destroy Ronan's hammer to break loose the stone. He even created a more unorthodox but successful plan with the Avengers on how to stop Thanos. This was later unsuccessful as Quill soon broke the plan when he went into rage upon learning that Thanos had killed Gamora.\n", "Due to being raised as a child by aliens, having possibly not learned just how weak humans are compared to other beings, he never suspected that he was half alien himself and assumed his inhuman resilience to be normal for any kind of creature.\n", "Quill is also quite sarcastic, similar to Tony Stark and Stephen Strange. There were many evidences of this such as when he claimed Stark's plan in attacking Thanos was good but dumb and that if he came up with the plan then it would be better.\n", "Quill has a strong love towards his family and loved ones, which drives him to protect those around him and makes him reluctant to hurt his friends. However, his emotions tend to get the best of him, as he is prone to outburst of rage and sadness when confronted by the death of a loved one. This best seen when he learned the truth behind his mother's death and when he found out Thanos killed Gamora. Likewise, Quill had a very hard time accepting his mother's death, shown by how he refused to open the last present she gave him for more than twenty years because he was told to open after she died.\n"], "personality_quotes": [["\"Don't call us plucky. We don't know what it means. All right, we're optimistic, yes. I like your plan, except it sucks, so let me do the plan, and that way, it might be really good.\"", "―Star-Lord to Iron Man[src]"]], "figure_captions": [], "quote": ["\"We're getting no help from Flash Gordon here.\"\"Flash Gordon? By the way, that's a compliment. Don't forget, I'm half-human. So that 50% of me that's stupid? That's 100% you.\"", "―Iron Man and Star-Lord", "Avengers: Infinity War"], "description": "Peter Jason Quill was a half-human, half-Celestial who was abducted from Earth by the Yondu Ravager Clan in 1988. After his abduction, he began building fame as the legendary outlaw Star-Lord. In 2014, he decided to leave the Ravagers and operate individually, starting by stealing a precious artifact known as the Orb, unintentionally becoming a key player in the Quest for the Orb. Following his arrest, he forged an uneasy alliance with fellow inmates Gamora, Drax the Destroyer, Rocket Raccoon, and Groot, and formed the Guardians of the Galaxy team with them a short while later in order to stop Ronan the Accuser from destroying Xandar. After the Battle of Xandar, he left with the other Guardians to do \"a little bit of good and a little bit of bad.\"\n"}