{"id": "Thaddeus_Ross", "name": "Thaddeus Ross", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Thaddeus_Ross", "personality": ["Decisive and ruthless, Thaddeus Ross is an objective man and his main one is to defend the United States of America by advancing the military, often by unconventional means such as a super-soldier project modified from a similar experiment from World War II. However, Ross is largely motivated by his own personal feelings and his vendetta against Hulk. He can be single-minded and shows an inability to learn from his mistakes as his main priority is to defend the United States, and although having witnessed the destructive capabilities of Hulk injuring him, his daughter and murdering several doctors from being unleashed the first time, still planned to replicate Banner's gamma radiation to continue the Super Soldier Program he was working on\n", "Ross can also be a hypocrite: though he loves Betty dearly he has destroyed his relationship with her due to hunting down the man she loves as a fugitive and the fact that he was the one who made him a fugitive in the first place. He blames Bruce Banner for injuring Betty, even though he wasn't in control of his actions at the time when he was Hulk and instead of helping him cure his gamma radiation, which Ross was partly responsible for in the first place, he planned to imprison him forever instead. Ross' methods of defense, and if needed offense, are amounted to a very \"fight fire with fire\" sense. His plans to combat with Hulk was injecting his top soldier, Emil Blonsky with a Super Soldier Serum. Similarly, when Blonsky mutated himself into Abomination and began causing havoc across Harlem, he ordered his men to assist Hulk, believing he was the only one who could match him in a battle.\n", "Despite having a personal incentive to kill Banner, Ross is not without reason to be concerned regarding individuals with near-unlimited power. Having continuously witnessed the casualties and destruction of several incidents regarding powerful super-humans, such as the Battle of Sokovia, events that happened without supervision or jurisdiction from the government which caused the Avengers to run freely, he began viewing the Avengers as loose cannons and that the Sokovia Accords which would keep them on constant government watch was best for the world, although this would later spark a civil war. Even after Helmut Zemo was revealed to be the true culprit behind the Bombing of the Vienna International Centre, he still called Captain America and the other rogue Avengers fugitives and ordered their arrest, thus earning him the anger of James Rhodes, who had once respected him, that the latter got a court martial when he chose to cut Ross off and disobey the Accords during the Infinity War.\n"], "personality_quotes": [["\"You know they're only criminals because you chose them to call them that, right, sir?\"\"God, Rhodes. Your talent for horse-shit rivals my own.\"", "―James Rhodes and Thaddeus Ross[src]"]], "figure_captions": [], "quote": ["\"Tell me, Captain, do you know where Thor and Banner are right now? If I misplaced a couple of thirty megaton nukes, you can bet there'd be consequences. Compromise. Reassurance. That's how the world works.\"", "―Thaddeus Ross to Captain America", ""], "description": "Thaddeus E. \"Thunderbolt\" Ross is a former Lieutenant General of the United States Army. During his career, he was put in charge of the military project called the Bio-Tech Force Enhancement Project, aiming to recreate the Super Soldier Serum. However, the experiment led to an accident which transformed the scientist Bruce Banner into Hulk. After a long hunt, Banner was captured, only for Ross' subordinate officer Emil Blonsky to transform into the monstrous Abomination which forced Ross to accept Hulk as an ally and allow him to escape after the battle in Harlem.\n"}