{"id": "Thanos", "name": "Thanos", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Thanos", "personality": ["Thanos is usually seen by everyone else as the ultimate personification of sadism, cruelty, megalomania, infinite destruction, death, power, and madness, with his search for the Infinity Stones seen by others as his plot to gain dominion over all the civilizations in the universe. Despite this, Thanos is also a more complex and tortured soul given his traumatic past and obsession with completing what he perceives as his destiny leads him to commit horrible actions all in the name of saving the universe even at great personal sacrifice to himself. He desired to use the Tesseract to look beyond the known worlds to find greater ones that it would unveil. He is also relentless as seen by finding children to take as his own so he can raise them as assassins while forcing them to watch as he murders their families and tirelessly searches for the Infinity Stones.\n", "He is extremely intimidating and unforgiving of failures. The Other once warned Loki that he would know a new kind of pain if he did not give them the Tesseract, this was proven true when he ruthlessly murdered Loki for his failure in retrieving the Tesseract for him and when he tried to kill Thanos. Even though Ebony Maw had never failed Thanos, he still feared his master and father enough that he did not dare to go to Titan without having fully taken the Time Stone from Doctor Strange. Thanos threatened Ronan the Accuser to bathe the starways in his blood if he failed to deliver the Orb, visibly terrifying Ronan. He even forbade Gamora from rescuing Nebula when the latter fell into a trap whilst on a mission in the Cloud Tombs of Praxius. He has little to no regard for his subordinates, showing absolutely no empathy when Ronan killed The Other. He is also shown to be an extremely skilled leader, being able to inspire fierce loyalty from the Black Order as well as command the Chitauri and the Outriders, both being highly savage and powerful creatures, unchallenged.\n", "He is extremely confident, to the point of borderline arrogance and being almost impossible to intimidate. He was shown to be smiling when The Other told him challenging the Avengers would be like courting Death. He was even unfazed at the idea of Ronan powered by the Power Stone coming after him despite knowing well that Ronan was already very powerful even without the Stone and the fact that he was backed up by Nebula who had betrayed him, displaying only anger at the betrayal. He also smiled confidently after deciding to hunt for the Infinity Stones himself.\n", "He is also manipulative and mistrustful, sending Ronan to retrieve the Orb for him and not telling him that it contained an Infinity Stone. He is surprisingly patient, as he keeps a low profile, lurking in the shadows and making others do his work for him, even after centuries of failure. He did not make a move for the Infinity Stones directly nor did he openly show he possessed an Infinity Stone until he was finally ready to collect the stones himself in rapid succession, presumably because he knew possessing one or more Infinity Stones would draw unwanted attention, prompting others to attack him and impede his preparations before he was finally ready. \n", "Despite Thanos' reputation, he does seem to care about his children, since they are the only thing he loves in the world, especially Gamora, since she is his \"favorite daughter\", she will inherit his throne, although he sometimes shows it in an extreme manner such as him turning Nebula into a cyborg to make her stronger. When he learned from Doctor Strange that Ebony Maw is dead, he stated the quest for the Infinity Stones \"extracts a heavy toll\" and when Nebula gloated he should have killed her, Thanos claimed it would have been a \"waste of good parts\" even though he would have indeed been better off killing Nebula because she would have eventually tried to kill him with all her cybernetic enhancements including the fact she had almost succeeded in assassinating him. Despite caring for his children, he is brutally strict with them as he does not hesitate to torture them should they failed to meet his expectations, as Maw stated there would be \"judgment\" if he failed Thanos. He also seems to display a soft spot for children, an example being when he met Gamora. Even though Gamora claimed Thanos killed her parents in front of her, in reality, he gently kept her from being a part of the random genocide of her people by having her focus on balancing a dagger he gave her. During the trip to Vormir to acquire the Soul Stone, despite Gamora being the enemy, Thanos took the lead when they ventured to the Soul Stone's shrine and when they encountered Red Skull, not knowing if he was friend or foe, he even made a gesture telling her to stay back. Thanos was also heartbroken when he realized he had to kill Gamora to gain the power of the Soul Stone, to the point where he was shedding tears, but due to his belief that it was for the greater good, he still went through with it, though Mantis noted that he was tormented by guilt and grief during the battle on Titan. \n", "Even though he was shunned by his own people for a hideous mutation he bore, Thanos loved them unconditionally and desperately sought to save them, going as far as to propose wiping out half of his kind so the other half may survive. His plan for saving his homeworld was rejected, leading to the fall of his race. This incident has caused Thanos immense regrets and remorse as he confessed to Gamora that he had ignored the inevitable extinction of his people once when he could have saved them by being more forceful and resolved in carrying out the genocide against his people's wishes. Thus Thanos became more determined in exterminating half of the population of every planet so as to save these civilizations from the same overpopulation tragedy which destroyed his home planet. This is why Thanos truly believes his cause for killing off half of everyone on all planets to be a righteous cause, seeing himself a righteous soul who is doing what is necessary to save all the civilizations of the universe, so they do not face the same tragedy as his home planet. As such, he stated that the Zehoberei did not suffer from environmental hazards, global hunger or any other form of violence anymore, due to him killing off half of their population. Regardless of his campaign to murder trillions, Thanos’ viewpoint was killing them in an admittedly painless and quick manner of disintegration was mercy compared to all life forms suffering the fate of starvation his own people endured.\n", "Thanos has shown a dark sense of sarcastic humor and is able to remain calm and unfazed in situations that would frighten and shock most others, as he remained fully composed even after thwarting Loki's assassination and mocked him for choosing the word \"undying\" and even was not at all angered by Loki defying him before dying by saying he will never be a god. He even remained unfazed after being badly injured by Thor and even mocked him for not striking him in the head.\n", "Thanos has also shown himself to be surprisingly honorable. He does not go back on the end of the deal he made with others and would honor them even when angered, as he was still willing to destroy Xandar for Ronan should he retrieve the Orb even though he was angry at Ronan for coming to him empty-handed and alienating his favored daughter Gamora. He extends this even to his enemies, as he did not kill Iron Man after acquiring the Time Stone as he promised to Doctor Strange and instead simply left Titan. He also is capable of praising others should they prove worthy, as he said that he wished people would remember the heroism and will that Iron Man fought with if he was removed from existence once he used the Infinity Gauntlet and praised Doctor Strange for his mastery in the Mystic Arts to be able to single-handedly go up against him with the Infinity Gauntlet. He was also complimentary of Star-Lord as he was going to kill Gamora, saying that he \"liked him\" for doing what would have been necessary in order to stop Thanos on his quest to obtain the Infinity Stones. He also showed some empathy towards Scarlet Witch's killing Vision despite the fact that she destroyed the Mind Stone, which was necessary for his goal, as he too had killed Gamora for the Soul Stone.\n", "Interestingly, despite being usually considered as an incredibly cruel and cunning being, Thanos did not take his genocidal motives as a pretext to eliminate potential foes who could be able to exact revenge on him. Indeed, he kept his intent to make his genocide as random and dispassionate as he intended, resulting in the survival of several members of the Avengers and the Guardians of the Galaxy who had done everything they could to stop him.\n"], "personality_quotes": [["\"The hardest choices require the strongest wills.\"", "―Thanos[src]"]], "figure_captions": [], "quote": ["\"I know what it's like to lose. To feel so desperately that you're right... yet to fail, nonetheless. It's frightening. Turns the legs to jelly. But I ask you, to what end?  Dread it, run from it... destiny arrives all the same. And now, it's here. Or should I say... I am.\"", "―Thanos", "Avengers: Infinity War"], "description": "Thanos is the genocidal warlord from Titan, whose own main objective was to bring stability to the universe, as he believed its massive population would inevitably use up the universe's entire supply of resources and condemn it. To complete this goal, Thanos set about tracking down the Infinity Stones, as the combined might could wipe out half the universe. Thanos forged alliances with Loki and Ronan the Accuser in order to track down some of the Stones, however both alliances cost Thanos much of his resources, including the Mind Stone and the loyalty of his daughters, Gamora and Nebula. Fed up with all his subordinates' continued failures, Thanos forced Eitri to create the Infinity Gauntlet for him, while Thanos then opted to seek out the location of the six Infinity Stones himself.\n"}