{"id": "The_Other", "name": "The Other", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/The_Other", "personality": ["The Other was extremely loyal to Thanos, as well as a powerful and intimidating individual. Additionally, he used his hideous looks and comparison of Thanos' mighty power to something god-like in order to cause Thanos' other allies and servants such as Loki and Ronan the Accuser to respect him, to varying degrees of success. The Other would do anything he possibly could to serve and please Thanos, to the point of becoming intensely angry with anyone who disrespected his master. The Other was sharp-tongued and pompous and had a tendency to emulate the behavior of his interlocutors.\n", "For instance, in the presence of Loki who showed mocking contempt for him, the Other attempted to bite back his fury and match Loki's cool disdain. The hot-headed Ronan by contrast largely ignored the Other's presence and angrily ranted at Thanos himself, causing the Other to become increasingly angry and blustery until he finally lost his temper and screamed in fury at Ronan, resulting in his own immediate demise.\n", "The Other underestimated humans, calling them \"cowering wretches\" and scornfully cites \"the meager might of Earth\", claiming that Loki supported this outlook and may have encouraged it. He was extremely confident that the humans would be completely helpless against the Chitauri invasion force. However, as only five of them stood a chance against them, dozens more wielded far more primitive weapons against the aliens to no effect, and everyone else fled in a panicked frenzy, the Other's viewpoint may not be entirely illegitimate. He does change his mind after Loki's defeat, however, as he goes so far as to claim that humans cannot be governed and challenging them will only court death.\n"], "personality_quotes": [["\"I will lead them in the glorious battle.\"\"Battle?! Against the meager might of Earth?\"", "―Loki and the Other[src]"]], "figure_captions": [], "quote": ["\"The Tesseract has awakened. It is on a little world, a human world. They would wield its power, but our ally knows its workings as they never will. He is ready to lead, and our force, our Chitauri, will follow. The world will be his, the universe - yours. And the humans, what can they do, but burn?\"", "―The Other to Thanos", "The Avengers"], "description": "The Other was Thanos' personal servant. He provided Loki with the Chitauri army in an attempt to conquer the Earth and claim the Tesseract. In the wake of the failed Chitauri Invasion, the Other continued to serve Thanos and held frequent arguments with his new warrior, Ronan the Accuser until, in a fit of rage, Ronan killed the Other with his Cosmi-Rod by snapping his neck.\n"}