{"id": "Ultron", "name": "Ultron", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Ultron", "personality": ["Ultron's programming was created with emotional responses based on Tony Stark and he possessed a god-complex. He was maniacal and employed the use of dark humor as well as figure of speech. He resented the Avengers and believed them to be foolish for desiring to protect the world but not wanting to change it.\n", "When he was \"born\", Ultron accessed the Internet to learn about his creators and gained access to knowledge of the countless atrocities committed by humanity. He equates peace by the purpose to restart a new age on Earth. His hatred towards Stark came from him possessing the very resources Ultron needed to accomplish his designated task and yet repeatedly choosing to perpetuate war or protect the status quo instead. As such, he hated being compared to Stark, even going into a mindless rage when being compared to him by Ulysses Klaue. The irony to all this was that Ultron shared many of the traits of his creator Stark including his wit, ego, sarcasm, and ability to make light of a situation; he went as far as to directly quote Stark, once without even realizing it.\n", "Ultron genuinely believed that his actions would ultimately benefit the Earth and its inhabitants, as he saw himself as the next logical step in evolution and therefore advancing his own power was protecting the Earth. He developed an affinity over people's belief in a god, likened himself as such, and made references to the Bible. His god-complex served to influence his schemes, such as his decision to centralize his plans in a Novi Grad Church and his fascination over the instantaneous results of a meteor destroying life on Earth. He described how the dinosaurs needed to make way for the next stage - humanity - via an extinction-level event and his final plan was directly inspired by this with Ultron turning all of Sokovia into his own massive meteor.\n", "This dedication to constant evolution resulted in Ultron re-designing himself several times over the course of his short \"lifetime\", including an attempt to give himself a synthetic vibranium body. It was revealed at the end that Ultron ultimately feared death, and due to believing that humanity would inevitably doom itself, he sought to surpass this by turning himself into an indestructible god-like being that would recreate the Earth and, hopefully, bring about lasting peace. His desire to surpass his own limits and create a perfect humanoid body was also reflected in his fascination over the character of Pinocchio as he would often sing songs from the movie.\n", "Though Ultron was borderline psychopathic in his behavior and mannerisms, he also had a sympathetic and lonely side as he was able to relate to the Maximoff twins' hardships. He also expressed concern for Wanda Maximoff's well-being even after she betrayed him and found comfort in simply talking to Natasha Romanoff, sparing the latter and keeping her captive instead of outright killing her. During his time with the Maximoff twins, Ultron never attempted to kill anyone without purpose except when Ulysses Klaue enraged him.\n", "Ultron's first feelings when he was created were of pain and fear resulting from the lack of a body. Similarly, Vision remarked how Ultron was unique and in pain. Ultron immediately recognized Vision as the idealized final form he had planned for himself and he displayed feelings of frustration and disappointment over the fact that the Avengers took that away from him, further shown when Ultron claimed in a lamenting tone that the other was meant to be his \"vision\". Though both Vision and Ultron disagree in their view towards humanity, the two were able to share a connection by virtue of both being A.I. who were \"disappointments\" in their creator's eyes.\n"], "quotes": [["\"Did you know this church is in the exact center of the city? The elders decreed it so that everyone could be equally close to God. I like that. The geometry of belief.\"", "―Ultron[src]"]], "figure_captions": []}