{"id": "Ulysses_Klaue", "name": "Ulysses Klaue", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Ulysses_Klaue", "personality": ["Klaue was a very greedy, cunning businessman and arms dealer, who would go to great lengths to get more than satisfactory results. He only cared about the profit made from selling illicit weapons and showed no regard for life, be it human or otherwise. Klaue also had a tendency to mock people even if they possessed much greater power than him. Such was the case with Wanda and Pietro Maximoff where Klaue's mocking of their juvenile status despite their clear and present danger to him and his outfit of business. \n", "He was smart enough to notice subtle details however, like making note of the comparison the robot known as Ultron had with Tony Stark, despite this causing the A.I to go into a rage and slice his arm off. He often thought of himself in the highest regard, and thought very lowly of everyone else. He thinks especially low of the Wakandans, believing them to be savages despite their superior technological advancements. This was one of the reasons he was ultimately betrayed and killed by Erik Killmonger. Klaue is also somewhat of an eccentric claiming to be afraid of cuttlefish as well as making his own music and mixtapes, even going so far as to start singing parts of it whilst being captured. These traits are accentuated at the loss and replacement of the hand that Ultron took. Events of which seemingly unhinged Klaue completely. \n", "Klaue became all the more volatile, belligerent and hysterical. Gone was his persona of a suave yet debonair shark like gunrunner, replaced only by a giddiness if not outright childlike glee at the violence and mayhem he often left in his wake. This was all the more evident by his outburst prone fits of anger and vulgarity, showing a warped sense of humor by keeping vibranium pieces marked fragile inside his trousers, cackling insanely after wrecking a gambling den and taunting his captures while in a CIA bunker without a care in the world. During a car chase he asked his mercenary to put on music, saying \"What do you think this is? A funeral?\". This shows how he can make light of a dangerous situation.\n"], "personality_quotes": [["\"I made it rain!\"", "―Ulysses Klaue[src]"]], "figure_captions": [], "quote": ["\"I stole... all of it? I took a tiny piece of it. They have a mountain full of it. They've been mining it for thousands of years and they still haven't scratched the surface. I'm the only outsider who's seen it and got out of there alive.\"", "―Ulysses Klaue and Everett Ross", ""], "description": "Ulysses Klaue was a black-market arms dealer, gangster, and international criminal who had worked alongside N'Jobu in order to steal a stockpile of vibranium from Wakanda in 1992. While he managed to escape with the stockpile, he received a branding on his neck from the Wakandans. During an encounter with Ultron in 2015, Klaue sold all of his vibranium to the A.I. before losing his arm during an argument. \n"}