{"id": "Valkyrie", "name": "Valkyrie", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Valkyrie", "personality": ["Valkyrie embodied all that the Valkyrie were renowned for; she was selfless, brave, noble, loyal and dedicated to her people, to her Valkyrie sisters, and to Asgard.\n", "Sadly, the Massacre of the Valkyrie by the Goddess of Death Hela inflicted deep psychological scars on Valkyrie, traumatizing her greatly. The final blow came as she witnessed a fellow Valkyrie sacrifice herself to save her from Hela's attack. With the overwhelming grief combined with anger against Odin for sending them against Hela, and with the shame of being the only survivor, Valkyrie abandoned Asgard and fled into exile on Sakaar. \n", "Valkyrie's overall personality underwent a drastic change during her time on Sakaar. She became a notorious alcoholic, seeking to eventually drink herself to death, and adopted a rude, sardonic, gung-ho and generally selfish attitude towards everyone besides the Grandmaster and Hulk. Feeling no remorse or empathy, she delivered numerous contenders to the Grandmaster for years, filling in any spare time with drinking, fighting, training, or hunting - sometimes all at once. She developed a strong bitterness toward Asgard and the monarchy but her deep-rooted fear of Hela and the trauma from their last encounter remained with her even though she was eventually able to bury the memories of the massacre deep in her subconscious. \n", "When she encountered the Asgardian prince Thor, Valkyrie initially remained apathetic and unmoved by his efforts to get her to help him and Hulk escape. Valkyrie took a sharp turn however when in an encounter with Loki, he unlocked the memories of the Valkyrie massacre that she had buried long ago, forcing her to finally confront her fear and guilt and enabling her to begin moving past it at last. Thus, Valkyrie finally resolved to help Thor and Hulk escape Saakar and help save the Asgardian people from Hela. By the time she reached Asgard, she was essentially her old self again except her penchant for heavy drinking remained. Nonetheless, she bravely charged into battle against Hela's Berserkers and helped distract Hela long enough to cause the Goddess' eventual downfall at the hands of Surtur. Following this, she rejoined her people as a lieutenant of the new Asgardian king Thor.\n"], "personality_quotes": [["\"You must be a traitor or a coward because the Valkyrie are sworn to protect the throne!\"\"Listen closely, Your Majesty. This is Sakaar, not Asgard, and I'm a scrapper, not a Valkyrie.\"", "―Thor and Valkyrie[src]"]], "figure_captions": [], "quote": ["\"I've spent years, in a haze, trying to forget my past. Sakaar seemed like the best place to drink, and to forget, and to die. One day.\"\"Well, I was thinking that you drink too much and it was probably gonna kill you.\"\"I don't plan to stop drinking. But... I don't wanna forget. I can't turn away anymore. So... if I'm gonna die, well... it might as well be driving my sword through the heart of that murderous hag.\"", "―Valkyrie and Thor", ""], "description": "Brunnhilde[1] is an Asgardian Valkyrie who was part of an elite group of warriors called the Valkyrie. She resided on Sakaar as a bounty hunter named Scrapper 142 after her defeat at the hands of Hela. Years into her self-imposed exile, Valkyrie found the Asgardian prince Thor and sold him to the Grandmaster, only to grow towards him when he told her of Hela's new invasion of Asgard. Joining the Revengers, Valkyrie escaped from Sakaar and assisted Thor to defeat Hela, witnessing the destruction of Asgard as a result before she then joined all of the remaining survivors traveling towards Earth, only for the Statesman to be attacked by the Black Order. She was one of the few survivors from Thanos's attack, helping lead the remaining Asgardians to safety before the Mad Titan destroyed the ship and killed the remaining forces, and ultimately survived the Decimation.[2]\n"}