{"id": "Vision", "name": "Vision", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/Vision", "personality": ["According to Tony Stark and Bruce Banner, Vision's personality is an amalgam of their own, Ultron's and J.A.R.V.I.S.' and an unknown amount of variables derived from the Mind Stone. Vision is a polite, calm, and thinking being, in a similar manner to J.A.R.V.I.S., shown when he apologizes to the Avengers and the twins after just being brought to life. Unlike Ultron, he values all forms of life. He is also shown to be blunt when Vision told Stark that Ultron hates him the most. He prefers to reason with his enemies, and will only attack when threatened. However, when he was first created, Vision lunged at Thor, who was the first person he saw, though only because he felt confused about his surroundings as he glanced around.\n", "When Vision encountered Ultron for the final time, both admitted that they cannot understand humans, whom they view as doomed to die out. However, Vision can see the beauty in humanity, due to their potential and imagination, and was happy to serve alongside them. He also regretted having to destroy Ultron, recognizing the latter as \"unique\" and \"in pain\", but he ultimately knew that it was necessary, given the great threat that Ultron posed to humanity. Vision showed a great desire to directly protect life, shown when he defended humans from Ultron and his forces, and when he personally saved Wanda Maximoff from Novi Grad's destruction, as it was blown up by Thor and Iron Man.\n", "Vision frequently struggles to understand human behavior due to being a non-human sentient lifeform, as such he tends to come off as awkward and/or uncomfortable to others, such as when he casually phased through a wall and interrupted a talk between Rogers and Maximoff instead of using a door. He makes judgments based on logic and treats choices as equations, and makes decisions based on what his calculations deem as the best choice or the lesser of two evils. This is best seen when he agrees to the Sokovia Accords by analyzing the relationship between the Avengers and threats to the world as an algorithm which describes the correlation between both concluding that oversight was a good idea. Despite that, Vision continuously attempts to improve his understanding of the human mind and therefore attempted to open up to Maximoff and comfort her over her fears over her powers.\n", "Despite his feelings towards Maximoff, the events leading up to and during the Avengers Civil War make it clear he is more loyal to Tony Stark and the people of Earth than to her. As a result of his supercomputer brain, he follows the most logical options available immediately being able to see the Accords as the path of least resistance when it came to helping the people of the world. Much like Stark, he could be very pragmatic and selfless should the situation call for it suggesting the destruction of the Mind Stone as a way to prevent Thanos from completing his goals in spite of such an act potentially costing Vision his own life.\n", "Befitting his status as one of the few capable of wielding Mjølnir, Vision was capable of great mercy, outright stating he did not wish to kill Ultron in his first few minutes of life. He again displayed this attitude during the Avengers Civil War, acknowledging that Rogers and his faction believed themselves to be in the right while also taking great care to limit his powers so as to minimize any harm that might befall the rogues, even comforting Maximoff after she had fallen. After the conflict, Vision reached out to her over the next two years in an attempt to mend their relationship.\n"], "quotes": [["\"Humans are odd. They think order and chaos are somehow opposites and... try to control what won't be. But there is grace in their failings. I think you missed that.\"", "―Vision to Ultron[src]"]], "figure_captions": []}