{"id": "War_Machine", "name": "War Machine", "fandom": "marvelcinematicuniverse", "url": "https://starwars.fandom.com/wiki/War_Machine", "personality": ["James Rhodes is a proud and highly distinguished officer of the United States Air Force. Though he is supportive of his best friend Tony Stark and generally enjoys being involved in his revelries, he is sometimes annoyed by Stark's flippant and reckless behavior. Stark's disrespect of government officials and refusal to relinquish his Iron Man armors to them often puts Rhodes in a difficult position since he has to balance his responsibilities to his superiors and respect his friendship with Stark. As liaison to Stark Industries, Rhodes strives to maintain a copacetic relationship between Stark and the United States Government.\n", "As a military man, he is a firm believer in people being held accountable for their actions and a proper chain of command. This made signing the Sokovia Accords an easy decision for him as it would make the Avengers accountable for their actions and a show of good faith for the public. He was also pleased to see Tony believe the same thing. As a result of this, he has a dislike of those who believe their actions to be \"right\" and would flout the law to accomplish them, shown when he confronted Captain America's faction during the Clash of the Avengers. However as time progressed, Rhodes became increasingly frustrated with the restrictions imposed on the Avengers, as well as Thaddeus Ross and the United Nations labeling his friends as criminals so much so that he chose to receive a court martial when Ross demanded Rogers and his team arrested.\n", "For the most part, Rhodes maintains a sense of professionalism and strives to do whatever he feels is the right thing for the people. This often causes tension between him and Stark, though the two nonetheless maintain a strong mutual respect and friendship. Rhodes also takes great personal pride in his work; when attending the party following the retrieval of the Scepter, he enjoys getting laughs from recounting stories of his work as War Machine, and his ego is somewhat deflated when he doesn't get the reaction he's looking for from Stark and Thor. Despite becoming partially paralyzed as a result of siding with Stark against Captain America over the Sokovia Accords, he freely admits having no regrets, as he believes it was the right thing to do. This would in time change, as he later openly admitted his disappointment and frustration that the Accords had ultimately done more harm than good by fragmenting the Avengers, forcing many of them to live in hiding in a time they were needed. After the friendly fire incident that left him paralyzed he also held no animosity against Captain America and his team.\n", "Despite his sense of professionalism, however, he enjoys wearing the War Machine suit as he believes it makes him a badass, and is largely disappointed when it underperforms, such as when the Ex-Wife Missile installed in his suit doesn't deliver when fighting Whiplash. Though he states that being rebranded as Iron Patriot comes across well as it's less aggressive, he secretly prefers being referred to as War Machine, and quickly goes back to this persona following the end of the latest crisis. However, he is often left in awe when faced with more extreme super-powered individuals; the sight of Aldrich Killian breathing fire alone was enough to make him immediately surrender despite actually winning against his men, and when preventing several Ultron Sentries from fleeing was left wondering what he had just witnessed when Vision did his job for him.\n"], "quotes": [], "figure_captions": []}