{"id": "Yondu_Udonta", "name": "Yondu Udonta", "fandom": "marvelcinematicuniverse", "url": "https://marvelcinematicuniverse.fandom.com/wiki/Yondu_Udonta", "personality": ["As leader of the Ravagers, Yondu Udonta appears as an unscrupulous thief. He is willing to kill, threaten and betray if his well-being is in danger or he desires something of value, sometimes reneging on his employers for a benefit such as turning Peter Quill into a Ravager when he was supposed to deliver him to his father. Yondu's true nature is: Good, smart, altruistic and affectionate. Though he claims that the Ravagers have a code of honor, as Quill states that code is virtually steal from everyone. It should be noted that Udonta may have some morality as he stopped the Ravagers from eating the young Quill - an act which he continued to throw in his face.\n", "With Quill, Udonta has a complicated history. As numerous of his men have stated, he had always been soft on him and protected his well being - at times costing his credibility amongst the Ravagers but he was willing to use Quill as an example to his men, if not apologetically. Despite being a thief, he has a level of trust in Quill but due to being betrayed beforehand, an equal level of mistrust and disappointment. For example, he took Quill's word in defending Xandar from Ronan the Accuser for the Infinity Stone but vowed to kill Quill and the Guardians of the Galaxy if they double-crossed him. Yondu beat Peter in front of his men to seem tough and threatened to kill him as an example. However, both of these instances were ruses as Yondu knew that Peter would talk his way out of both instances, while having no intention of actually killing his adopted son. When given the Orb containing the Stone, he did not seem particularly angered to find out that Quill gave him a fake Orb. Quill does state that Udonta is the only family he has.\n", "Udonta also has a habit in which he collects oddities and places them on the console of his chair, with the most recent one being a Troll Doll that was given to him by Quill in the place of the Infinity Stone.\n", "Even with his flaws and unscrupulous attitudes, Yondu is not a heartless person: in spite of being an alien thief, he has a level of humanity and a soft spot for Peter Quill, his adopted son. When he found a Troll Doll instead of the Infinity Stone inside the Orb, he smiled and choose to forgive this deception instead of lashing out in anger. It is also revealed that Yondu did not deliver Peter to Ego because he learned what happened to Ego's other children and kept Peter away from his father to keep him safe. Yondu was also surprisingly patient with the incompetence of baby Groot, even affectionately nicknaming him \"Twig\".\n", "He also kept the Ravagers from attacking the Guardians when he was not given the Infinity Stone he was promised and cleverly kept his intentions hidden by saying the Nova Corps would be after them since their actions on Xandar had made the Guardians of the Galaxy allies to the Nova Corps. Yondu sacrificed his own life to save Peter and even inspired him to stand up to his megalomaniac father. In his dying moments, he told Peter while Ego was his biological father, he was not Peter's dad since he did not raise him and that Yondu was his dad. This act shows how much he loved Peter, as he sacrificed himself to ensure his survival. When Peter began frantically trying to remove his spacesuit, Yondu gently patted his face, granting Peter some genuinely fatherly affection at last.\n"], "personality_quotes": [["\"Yondu didn't have a talking car but he did have a flying arrow. He didn't have the beautiful voice of an angel but he did have the whistle of one. Both Yondu and David Hasselhoff went on kick-ass adventures and hooked up with hot women and fought robots. I guess David Hasselhoff did kind of end up being my dad after all, and it was you, Yondu. I had a pretty cool dad.\"", "―Star-Lord about Yondu Udonta[src]"]], "figure_captions": [], "quote": ["\"I may be as pretty as an angel, but I sure as hell ain't one.\"", "―Yondu Udonta", ""], "description": "Captain Yondu Udonta was a Centaurian, leader of an exiled faction of the Ravagers and adoptive father to Peter Quill. When Quill betrayed the Ravagers and stole the Orb for himself, Udonta led the hunt for his former ally. Eventually Udonta caught up with Quill but he was convinced to help him in the war against Ronan the Accuser, who was threatening to use the Power Stone within the Orb to destroy Xandar, with Quill ensuring Udonta did not get the Infinity Stone at the end. Despite losing the stone, Udonta chose not to get revenge against Quill, leading to mistrust among all of his own men.\n"}