{"id": "Aberforth_Dumbledore", "name": "Aberforth Dumbledore", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Aberforth_Dumbledore", "personality": ["Aberforth generally seems cynical and bad-tempered, such as when he sarcastically pointed out to Harry Potter how little Albus Dumbledore had really told him even while putting an enormous responsibility on his shoulders. However, despite this, Aberforth proved himself worthy of being a Griffindor, displaying an astonishing amount of bravery despite his cynical personality and he also seemed to be not so entirely without an ability to tolerate those who had angered him in the past. For example, despite generally disliking his older brother for his glory-seeking, and blaming him for their younger sister's death, Aberforth still considered Albus his brother and maintained contact with him, with their relationshipe being deemed cordial by Elphias Doge, and Aberforth joined the Order of the Phoenix, which Albus founded and led, and attended Albus's funeral. Also, in spite of claiming earlier that \"You-Know-Who's won, it's over, and anyone who's pretending different's kidding themselves\" and also showing still his resentment of Albus's true nature, Aberforth was shocked into silence as he contemplated what Harry had revealed: that Albus had never forgiven himself for Ariana's death and was always tortured by the fact that he was responsible for it. Ultimately forgiving his brother, Aberforth then fought bravely and selflessly at the Battle of Hogwarts, which may be out of a desire to honour his older brother's memory by protecting the school Albus had led for so long possibly sparked by the regret of never even considering Albus had regretted Ariana's death and also that he never managed to reconcile with his brother. His unwillingly courageous nature shows itself in one of his last conversations with Harry; after Harry thanked him for saving his and his friends' lives twice, Aberforth gruffly retorted, \"Look after 'em, then. I might not be able to save 'em a third time\".[7]\n", "Aberforth did not discriminate against Muggles, despite the attack that traumatised his sister, and was disgusted at the thought of Albus and Grindelwald's quest for Muggle domination. Albus considered his brother to be more honourable than he could ever be. Indeed, Aberforth even had the determination to duel both his brother and Grindelwald, despite knowing full well he could not overpower them. This feat was more impressive by the fact that he previously had been subjected to the Cruciatus Curse by Grindelwald.\n", "Aberforth was rather willing to use underhanded tactics against his foes, as he suggested to Harry to hold Slytherin students hostage against their parents who also served as Death Eaters.\n"], "personality_quotes": [["Ron Weasley: \"The silver doe. Was that you too?... Someone sent a doe Patronus to us!\"\n", "Aberforth: \"Brains like that, you could be a Death Eater, son. Haven't I just proven my Patronus is a goat?\""]], "figure_captions": [], "quote": ["My own brother, Aberforth, was prosecuted for practising inappropriate charms on a goat. It was all over the papers, but did Aberforth hide? No, he did not! He held his head high and went about his business as usual! Of course, I'm not entirely sure he can read, so that may not have been bravery...", "—Aberforth's unconventional personality\n", "Harry Potter and the Goblet of Fire"], "description": "Aberforth Dumbledore (b. 1883/1884) was a half-blood wizard, the second son of Percival and Kendra Dumbledore, younger brother of Albus, and older brother of Ariana. He attended Hogwarts School of Witchcraft and Wizardry between 1895 and 1902. His father — who had been sentenced to prison for attacking three Muggles — died in Azkaban when Aberforth was young, and his mother and sister were later accidentally killed. Aberforth blamed his brother Albus for the death of their sister, Ariana and thus their relationship was rather strained.\n"}