{"id": "Alastor_Moody", "name": "Alastor Moody", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Alastor_Moody", "personality": ["Alastor Moody was tough, brave and a consummate survivor, as well as an excellent fighter. He had a gruff, surly disposition. Having encountered many dangerous experiences throughout his career, he was hyper-paranoid and thought of by many as being delusional.\n", "Moody prepared all of his own meals and drank only from his personal flask in case someone tried to poison him. He was also very distrusting of most people, being very careful of who he relayed facts about his personal life to. He kept what he considered to be important information back even from his colleagues and superiors in the Ministry of Magic, such as his birthplace and which house he was sorted into during his attendance at Hogwarts. The latter probably with keeping in mind that the house could identify some of his more essential personality traits, making it easier for the enemy to find weaknesses in his psychological defences.\n", "Despite his paranoia Moody was a brave individual. He never hesitated to go up against powerful dark wizards, including Lord Voldemort himself. Indeed his plan for getting Harry to safety involved using himself as a decoy knowing that Voldemort would likely go after him. This demonstrates both confidence in his own skill and a willingness to protect the rest of the Order members from Voldemort. It's likely that he knew that he could easily be killed during this encounter suggesting that he didn't fear death. Indeed he seemed to see being killed in battle as something to be proud of, as shown by his proud descriptions of the deaths of members of the previous Order of the Phoenix.\n", "He also had a well-known habit of being set off by sudden noises or movements in his presence and even attacked a witch who shouted “boo” at him on April Fool’s Day. He even destroyed a birthday present carriage clock, believing it was a cleverly disguised basilisk egg, and was described in a Daily Prophet article as having left the Ministry when deemed \"Unable to tell the difference between a handshake and attempted murder.\" This only intensified after he was freed from nine months of being imprisoned inside his own trunk.\n", "Moody was a great wizard in his day and the most effective Dark Wizard hunter that the Ministry of Magic ever had. Nearly half of the cells in Azkaban were full because of Moody. He had the ability to think like a Dark wizard, which helped him track so many down. This also allowed him to outwit Voldemort during the Battle of the Seven Potters where he accurately predicted that Voldemort would believe Harry to be guarded by the most powerful members. He was also a staunchly loyal friend and supporter of Albus Dumbledore and one of the Order of the Phoenix's most powerful and reliable allies. He despised those who practised the Dark Arts, labelling such people as \"filth\" and relished the idea of Dark wizards being left at the mercy of the Dementors.\n"], "personality_quotes": [["Molly Weasley: \"Your father thinks very highly of Mad-Eye Moody.\"\n", "Fred Weasley: \"Yeah, well, Dad collects plugs, doesn't he?\""]], "figure_captions": ["Barty Crouch Jr, disguised as Moody at the Yule Ball"], "quote": ["You need to know what you're up against! You need to be prepared!", "—Moody's famous quote\n", "Harry Potter and the Goblet of Fire"], "description": "Alastor \"Mad-Eye\" Moody (d. 27 July, 1997[3]) was a pure-blood[4] Scottish[2] wizard, considered to be the most famous Auror of all times.[12] He was also a pivotal member of the Order of the Phoenix during the First and Second Wizarding Wars. Moody served with distinction during the first conflict, gaining a considerable reputation, as well as losing an eye, leg, and part of his nose while fighting the Dark Arts. He was also responsible for many of the inhabited cells in Azkaban, having caught innumerable Dark Wizards. As a result, Moody became overly-cautious and paranoid about his security.\n"}