{"id": "Albus_Dumbledore", "name": "Albus Dumbledore", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Albus_Dumbledore", "personality": ["Considered by many to be the most powerful wizard of all time, Dumbledore was benevolent and wise, a great wizard in the vein of Merlin. He had an almost unearthly calm and relaxed demeanour and almost constantly gave off an aura of serenity and composure, rarely displaying intense emotions of anger or fear. He was known for typically speaking in a calm, collected voice, and being firm, but reasonable and kind. He was always courteous, even to people who he found rude or in the case of Fenrir Greyback, disgusting. However, despite his benign nature, it is said that Dumbledore was the only wizard Lord Voldemort ever truly feared.\n", "Dumbledore was notably eccentric. He was quite fond of knitting patterns and frequently wore flamboyant clothing (at one point, he is seen wearing a flowered bonnet that he received from a Christmas cracker). In particular, he had a somewhat odd taste in sweets: he enjoyed Muggle sweets relatively unknown in the wizarding world (particularly sherbet lemons) and the password to his office, supposedly that of his current favourite sweet, was often peculiar choices such as Acid Pops and Cockroach Clusters. In addition, he had a liking for chamber music as well as ten-pin bowling. He often used humour to make people feel comfortable in his presence. Dumbledore has been known to be quite philosophical; often, very few people have the understanding (or patience) to comprehend his philosophies.\n", "As a supremely talented wizard, Dumbledore showed numerous examples of extraordinary abilities. His capabilities as a wizard were combined with his extraordinary intellect and extremely cunning and subtle mind that allowed him to comprehend human nature and turn the better aspects of humanity (trust, love and friendship) to Voldemort's disadvantage in particular. Due to this, Dumbledore wielded extraordinary powers of deduction that allowed him to be completely unfooled by any charades who could fool even the entire wizarding world and recognise instantly any deception that may have initially fooled him at the slightest of slip ups, as shown repeatedly when he quickly figured out Quirell was distracting him with a letter he faked was from the Minister of Magic, was never fooled by Lockhart's books due to having knew what he truly was and quickly realised the truth, and deduced that Moody was actually Crouch Jr the moment he asked Harry to be brought to his office. During his Hogwarts career, especially as headmaster Dumbledore always maintained his composure, even in situations that would terrify others. Being attacked by Ministry officials, the opening/re-opening of the Chamber of Secrets, having Dementors at the school, being surrounded by a plethora of Inferi and soon thereafter, staring death in the face (although they may have made him uneasy for the safety of others) did not frighten him. This was shown best at his duel with Voldemort, when he engaged in small talk with him in a calm, almost sardonically humorous way, despite Voldemort's tremondous duelling prowess and his attempts to murder him. Dumbledore was verbally and utterly unafraid of death and was obviously never scared of Voldemort himself, but rather what he may/could do to those he cared for and he was also not afraid of being exposed to great torment. An example of this was in The Cave, when knowing that the Potion would cause him severe pain and distress without knowing exactly what would happen to him, Dumbledore did not hesitate to drink it. Despite this, Dumbledore was capable of fear and feared, above all else, that he had actually cast the spell that ended his sister Ariana's life. However, he was capable of facing his fears, as shown by how he indirectly confessed his guilt to Leta Lestrange, and by how he later ultimately mustered the strength to confront Grindelwald and end the Global Wizarding War after years of watching Grindelwald's rampage. Therefore, Dumbledore's Boggart is said to be his sister's corpse.[9]\n", "While Dumbledore (at least in his later years) never displayed arrogance or conceit, he had no use for false modesty either, and if a situation warranted it, was perfectly willing to acknowledge his virtually peerless intelligence and power. However, Dumbledore also understood that he had his weaknesses and blind spots just as any other man, and worked hard to keep them in check.\n", "More than anything else, Dumbledore was motivated by his belief in the power of the human spirit. He also had a deep capacity for love, frequently reminding Harry that love was the greatest magic of all. Dumbledore believed in the good in everyone and insisted on giving second chances. He notably argued strongly against the expulsions of Newton Scamander, and later Rubeus Hagrid, as well as refraining from expelling Jacob's sibling, despite the latter repeatedly breaking school rules. Dumbledore also allowed Remus Lupin to be a pupil at his school and later a professor, despite the fact that Remus was a werewolf. He had a great friendship with Hagrid, despite many not trusting the half-Giant. The greatest example of this, however, is Dumbledore's relationship with Severus Snape, in whom Dumbledore was willing to hold a considerable amount of faith after Severus had shown remorse. Dumbledore even saw a possibility for good in Tom Riddle as a child, and was open to giving him a second chance, despite the fact that Tom had already revealed himself to be a cruel sociopath and bully even at a young age, though he kept a careful eye on Tom Riddle during his Hogwarts career rather than simply hoping for the best. Although he was devoted to Riddle's defeat after he became Voldemort, Dumbledore was genuinely regretful on how the days he could have easily intimidated Riddle into admitting his wrongdoings and taking responsibility for them were long gone, proving he felt a level of remorse for never managing to do anything significiant to change Riddle. In addition, Dumbledore also believed the rumours of Grindelwald showing remorse for his crimes during his time in prison and showed a level of respect and gratitude for Grindelwald's concealment of the true location of the Elder Wand for a shred of redemption even if it was in vain.\n", "Dumbledore was highly perceptive and emotionally intelligent; his knowledge of people's true personality went beyond being simply a good judge of character. This is never more apparent than in his complex insights into Voldemort's psyche, which he pieced together with Harry to deduce where the Horcruxes were hidden. However, this insight also made him extraordinarily good at manipulating people, which he was perfectly willing to do if he thought it necessary. Perhaps the most blatant example of this was with regard to Severus Snape, as he used Snape's love for the late Lilly Evans to manipulate him into helping him protect Harry Potter, her son, despite all the risks it entailed and despite Snape's bitterness and hatred towards Harry's father. Another note worth mentioning in this area, is Dumbledore conjured a bottle of gin to help ease Mrs Cole during their conversation. He did not offer her a glass, but simply produced it, knowing she would drink it. A lesser note of his emotional insight was with Gilderoy Lockhart: despite Lockhart having fooled every inhabitants in the wizarding world with his books, Dumbledore, having knew what he truly was, was completely unable to be tricked by Lockhart and he was able to effortlessly manipulate Lockhart into taking the job of DADA Professor by slyly hinting Harry Potter was in Hogwarts attending his second year so he can expose him.\n", "In spite of Dumbledore's many extraordinary qualities, he was also a somewhat Machiavellian figure.[29] He could be stoically pragmatic and was extremely prone to secrecy. He spent a short portion of his youth concocting plans with Gellert Grindelwald for global domination over Muggles, in the process treating his ill sister with neglect. Whilst Dumbledore was never a deliberately cruel man, at times, he was too far-sighted, making choices that he believed to be for the benefit of humanity even if it deeply hurt some of the people around him. For example, he placed Harry Potter with the Dursley family despite knowing that they would be unlikely to treat him well, as pointed out by Professor McGonagall, all for the sake of keeping him alive.\n", "Dumbledore's greatest personality flaw, which he explained to Harry in 1998,[16] was his desire for power. Particularly in his younger days, he acknowledged that he had been quite selfish and that because of his extraordinary abilities, he had wanted fame, power, and glory for himself. When he and Gellert Grindelwald were in school, they made plans to enslave Muggles and re-establish wizards as the natural rulers of the world. However, when his sister Ariana Dumbledore was killed during a duel between himself, Aberforth Dumbledore, and Grindelwald, any desire to accomplish this goal left him. The incident led to him declining any attempts by others to offer him positions of great political authority, and he refused to take the post of Minister of Magic at least three times.\n", "Dumbledore, while often kind and calm, did have a very serious side of himself and was capable of a terrifying wrath. This was rarely seen, but appears to be well known and combined with his exceptional magical abilities, made very few of his allies willing to cross him and almost all of his enemies feared him, to the point that even Lord Voldemort and Gellert Grindelwald were known for fearing him, despite their own incredible magical powers, wrath and status as the two most dangerous dark wizards in history. Just a slight exertion of Dumbledore's serious side and anger could intimidate the likes of Harry Potter, and even the Minister of Magic Cornelius Fudge, evidenced when they both were shocked when Dumbledore made it clear quite firmly that Hagrid did not open the Chamber of Secrets, despite Dumbledore not openly showing anger. At the apex of Dumbledore's wrath, which happened extremely rarely, such as when he apprehended Barty Crouch Jr, who impersonated Moody and almost killed Harry, Dumbledore was described as \"being struck with cold, ancient fury\". In fact, during this rare moment of intense anger (caused by Dumbledore's realisation that, not only had Voldemort been resurrected, but also that he had been expertly deceived for an entire year), Dumbledore was so terrifying, that even Minerva McGonagall and Severus Snape, both extremely powerful and stern wizards who rarely displayed emotions, were clearly uneasy. Harry himself (who was also slightly terrified of his reaction) fully understood then why Dumbledore was the only wizard that Voldemort ever feared.\n", "Dumbledore was haunted by his sad family history. In particular, he was riddled with guilt over the circumstances surrounding the death of his sister. He felt enormous remorse for his selfishness and was tortured for the rest of his life by the possibility that he might have been the one who cast the spell that killed his sister, to the point that he delayed facing Grindelwald until there was no other choice, due to him fearing what his former friend might have known about the death of Ariana. However, he had enough sense to realise that he will inevitably have to duel Grindelwald and therefore he took the position as the Professor of DADA to prepare students for the upcoming dark times. Additionally, Dumbledore's own guilt allowed him to comfort Leta Lestrange over her own guilt in the role she had in her brother Corvus' death. Indeed, it was Dumbledore's advice to Leta that induced her to save Credence Barebone from Yusuf Kama's revenge.\n", "Dumbledore wasn't afraid of death as he believed \"to the well organized mind, death is but \"the next great adventure.\" Even during his short time in Limbo, he expressed his excitment o Harry for what awaits him. At time Dumbledore could feel the pressure of his role in the world acutely, and relied on his Pensieve to deal with them. He kept vials of memories which he could view in his Pensieve, some of which were his own. He often used this to find connections he might have missed before, and also when he felt he had \"too many memories\".\n"], "personality_quotes": [["Albus Dumbledore: \"Welcome! Welcome to a new year at Hogwarts! Before we begin our banquet, I would like to say a few words. And here they are: Nitwit! Blubber! Oddment! Tweak! Thank you!\"\n", "Harry Potter: \"Is he — a bit mad?\"\n"], ["\"As I have already proven to you, I make mistakes like the next man. In fact, being — forgive me — rather cleverer than most men, my mistakes tend to be correspondingly huger.\"", "—Dumbledore talks to Harry about his Horcrux theory, and the possibility of his making a mistake[src]\n"], ["\"I knew my brother, Potter. He learned secrecy at our mother's knee. Secrets and lies, that's how we grew up, and Albus... he was a natural... How can you be sure, Potter, that my brother wasn't more interested in the greater good than in you? How can you be sure you aren't dispensable, just like my little sister?\"", "—Aberforth Dumbledore bitterly describes his brother's inner nature[src]\n"]], "figure_captions": ["Dumbledore's flamboyant attire", "Albus Dumbledore proving to a young Tom Riddle that the Headmaster is a wizard", "Albus Dumbledore in thought", "Dumbledore's grief", "Dumbledore's excitment"], "quote": ["Albus Dumbledore was never proud or vain; he could find something to value in anyone, however apparently insignificant or wretched, and I believe that his early losses endowed him with great humanity and sympathy. I shall miss his friendship more than I can say, but my loss is as nothing compared to the wizarding world's. That he was the most inspiring and the best loved of all Hogwarts headmasters cannot be in question.", "—Dumbledore's obituary\n", "Harry Potter and the Deathly Hallows"], "description": "Professor Albus Percival Wulfric Brian Dumbledore, O.M. (First Class), Grand Sorc., D. Wiz., X.J. (sorc.), S. of Mag.Q.[15] (c. Summer[1] 1881[3] – 30 June, 1997[3]) was an English half-blood wizard, who was the Defence Against the Dark Arts Professor, later the Transfiguration Professor, and later Headmaster of Hogwarts School of Witchcraft and Wizardry. Professor Dumbledore also served as Supreme Mugwump of the International Confederation of Wizards (?–1995) and Chief Warlock of the Wizengamot (?–1995; 1996–1997). He was a half-blood, Muggle-supporting wizard considered to have been the greatest wizard of modern times, perhaps of all time. The son of Percival and Kendra Dumbledore, and the elder brother of Aberforth and Ariana. His father died in Azkaban when Dumbledore was young, while his mother and sister were later accidentally killed. His early losses greatly affected him early on, even at his death, but, in turn, made him a better person. \n"}