{"id": "Amycus_Carrow", "name": "Amycus Carrow", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Amycus_Carrow", "personality": ["He was also a coward, however, as Amycus planned to blame the Ravenclaw students for allegedly forcing Alecto to press her Dark Mark so that they would be punished by Voldemort instead of himself and his sister. This demonstrated a sense of naivety as Voldemort would have likely known he was lying either through Legilimency or simply because the lie was somewhat unbelievable. He did show genuine concern for his sister when he found her unconscious, suggesting that he did care about her at least. He was also incredibly arrogant as he demanded that McGonagall would support him.[5]\n", "Moreover, Amycus did not seem to be very bright, as he was unable to answer the riddle to get into Ravenclaw Tower when asked by the eagle knocker on the door, or to give a reason why Harry Potter would go into Ravenclaw Tower when he was of Gryffindor House, when asked by Minerva McGonagall. He also didn't seem very suspicious about Severus Snape's true loyalties, suggesting that he truly believed that Snape was on their side.\n"], "personality_quotes": [["Eagle door knocker: \"Where do Vanished objects go?\"\n", "Amycus Carrow: \"I dunno, do I? Shut it!\""]], "figure_captions": ["Amycus Carrow"], "quote": ["We can push it off on the kids. Yeah, that's what we'll do. We'll say Alecto was ambushed by the kids, them kids up there, and we'll say they forced her to press her Mark, and that's why he got a false alarm... He can punish them. Couple of kids more or less, what's the difference?", "—Amycus' selfishness and cowardice\n", "Harry Potter and the Deathly Hallows"], "description": "Professor Amycus Carrow was a Dark wizard, brother of Alecto Carrow and a Death Eater. Amycus fought in the First Wizarding War along with his sister. They did not search for Lord Voldemort after his first downfall but were forgiven after Voldemort's return in 1995 and joined the Death Eater ranks in the Second Wizarding War. \n"}