{"id": "Arabella_Figg", "name": "Arabella Figg", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Arabella_Figg", "personality": ["In Harry Potter's youth, the Dursleys left him in Mrs Figg's care at least once a year,[10] and during their time together, she had often forced him to look endlessly at photos of \"all the cats she'd ever owned\".[3] In 1995, she admitted that, though she didn't enjoy it, she had intentionally kept Harry bored and miserable, as the Dursleys would never have left him with her if they thought he enjoyed it. Though Harry only thought of her as his \"batty old cat-obsessed neighbour\"[6] before discovering she was a Squib, she appeared to be a clever woman with a bit of a temper. She physically attacked Mundungus Fletcher when he left his post of watching Harry Potter, and prior to that, had been quite sarcastic, even slightly insulting, during her conversation with Harry. \n", "She appeared nervous, even timid, during Harry's disciplinary hearing, though that was likely due to the stigma surrounding being a Squib, as well as the fact that she had to testify before the entire Wizengamot. Regardless, she was a brave, vigorous woman, who, despite her lack of magical ability, did her best to support the Order of the Phoenix. Arabella felt rather offended when she found out that the Ministry did not register her in their records due to her status as a Squib.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Harry Potter: \"Why didn't you tell me you're a Squib, Mrs Figg? All those times I came round your house — why didn't you say anything?\"\nMrs Figg: \"Dumbledore's orders. I was to keep an eye on you but not say anything, you were too young. I'm sorry I gave you such a miserable time, Harry, but the Dursleys would never have let you come if they'd thought you enjoyed it. It wasn't easy, you know...\"", "―Harry Potter and Arabella Figg in the summer of 1995", ""], "description": "Mrs Arabella Doreen Figg was a Squib, a dealer of cross-bred cats and kneazles,[2] and a member of the Order of the Phoenix. She lived on Wisteria Walk in Little Whinging, in a house that smelled strongly of cabbage; she also owned and extensively photographed at least four part-kneazle cats, named Mr Tibbles, Snowy, Mr Paws, and Tufty.[3]\n"}