{"id": "Arthur_Weasley", "name": "Arthur Weasley", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Arthur_Weasley", "personality": ["Arthur was fascinated at how Muggles were able to go about their lives without magic. Whenever he found himself in close proximity to them, he had a hard time containing his enthusiasm. During Harry's stays at the Burrow, he liked to sit next to Harry, in order to ask him questions about living with them and had at various times attempted to engage the Dursleys in conversation about electricity. In 1992, when he learned Harry had never travelled by the Floo Network, he joyfully began to ask about the \"escapators\" in the London Underground. When the Weasleys and Harry met Hermione Granger in Diagon Alley that same year, Arthur was ecstatic to meet Hermione's parents, both Muggles, who were exchanging money at Gringotts. While the other family members went shopping for school supplies, Arthur insisted on taking Mr and Mrs Granger for a drink in the Leaky Cauldron.[13] In addition to his Ford Anglia, Arthur also collected a number of other Muggle items. He had a large collection of plugs and batteries, as well as other undisclosed items in his shed. After successfully transporting Harry to The Burrow in the aftermath of the Battle of the Seven Potters, Arthur showed Harry the remains of Sirius' motorcycle and told him he was eager to learn how the brakes worked and that he also wanted to put it back together when Molly was not around. In time, Arthur did put it back together and returned it to Harry.[16]\n", "Because of his fondness for Muggles, in 1992, he drafted a proposition for the Ministry called the Muggle Protection Act. Many pure-blood wizards took offence to this, and Lucius Malfoy attempted to sabotage Arthur's plans; by planting Riddle's diary on Arthur's daughter, he hoped to discredit Arthur and bury the legislation.[13] So adamant in protecting Muggles, he was outraged at Fred and George's prank on Dudley Dursley, even though the twins did not target Dudley because he was a Muggle, but rather he was a horrible boy. When he took his family, Harry and Hermione to the Quidditch World Cup in 1994, he was adamant about remaining incognito. He insisted on putting up their tents by hand and cooking their food outside with a fire. While somewhat familiar with the concept, he had trouble with a Muggle matchbox; he would light a match and subsequently drop it in surprise. In the end, he managed to get the fire lit with Hermione's help and seemed to have a great time. When Death Eaters started a riot after the cup, Arthur was one of the people who acted to protect Muggle victims.[15]\n", "His wall in the Misuse of Muggle Artefacts Office was covered with Muggle pictures, including several of Muggle cars (one of which was a disassembled motor) Muggle post boxes, which he appeared to have cut out of a Muggle children's book and a diagram of how to wire a plug. His greatest ambition was to find out how Muggles were able to keep aeroplanes airborne. Arthur's love of engineering and Muggle technology was inherited by his sons Fred and George in that they too possessed Arthur's ingenuity and almost compulsive need to invent or modify things from their intended purposes, resulting in many of the twins' joke items.\n"], "quotes": [["\"That's what's held Arthur back at the Ministry, honest as the day is long, reliable, trustworthy and able... all qualities guaranteed to stop you moving forward at the Ministry these days.\"", "—An attendee of the Wedding of William Weasley and Fleur Delacour[src]\n"], ["\"But you're Muggles! We must have a drink! What's that you've got there? Oh, you're changing Muggle money. Molly, look!\"", "—Arthur Weasley's fascination with Muggles[src]\n"]], "figure_captions": ["Arthur with Mr and Mrs Granger in Flourish and Blotts", "Harry Potter surrounded by Arthur's collection of muggle objects"]}