{"id": "Barty_Crouch_Jr.", "name": "Bartemius Crouch Junior", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Barty_Crouch_Jr.", "personality": ["Barty appeared to have been diabolical, extremely intelligent, very arrogant, cunning, and intensely hateful. He was obviously a quite powerful wizard, having demonstrated sufficient magical ability to Confound the Goblet of Fire into believing that four schools participated in the Triwizard Tournament in order for Harry to participate in the contest despite the object's power. Barty was also perceptively observant and exceptionally manipulative; his keen attention to the habits and motivations of others enabled him to impersonate Alastor Moody so accurately that he even managed to fool Albus Dumbledore.[15] Dangerously clever and fearsomely determined, Bartemius proved capable of orchestrating the events of the Triwizard Tournament so that Harry Potter would be transported to Voldemort, in order to ensure his master's return. Barty's high intelligence also made him bitingly cynical and he remarked how easy some people were to manipulate — he was capable of concern for his plans, and expressed his fear that Harry would have failed the Second Task. He also expressed frustration for how slowly Harry progressed in Barty's plans, citing Harry's weakness of pride as the reason.\n", "Barty was extremely devoted to Voldemort and regarded him as a father figure. His loyalty was matched only by fellow Death Eater Bellatrix Lestrange. He also seemed to know much of Voldemort's father, comparing him with his own father. This may imply that Barty was aware of Voldemort's status of being half-blood, but did not care, in contradiction to the Death Eaters' belief of pure-blood supremacy, or that Voldemort simply superseded the blood status. However, Barty's immense loyalty to Voldemort blinded him to those who truly loved him, namely his mother and the family's devoted house-elf Winky. They sacrificed much to give him a second chance at a happy life, which Barty tragically wasted in his obsession to reunite with Voldemort. As with many other Death Eaters, Barty had deluded himself into believing that he alone understood Voldemort, and that they were closest to each other due to their commons, to which was in fact not true as Voldemort never desired a friend nor understood human affections.\n", "One reason for Barty's behaviour may be the fact that his father neglected him during his childhood and/or teenage years, and later forced him to spend years under the Imperius Curse in relative isolation, possibly affecting his mental stability. The year he spent in Azkaban also furthered his mental decline, due to the effects of the Dementors. He was also likely very sadistic, not only did he possibly participate in torturing the Longbottoms, but forced their son Neville Longbottom to watch a demonstration of the Cruciatus Curse on a spider, despite the latter's bizarre and panicked response. However, this latter act could have been what the real Moody would have done himself, and possibly it was indeed to teach the students the harsh truths about the Curses.\n", "Crouch also loved Quidditch in his youth, a fact mentioned by Winky. Also, as a young man, he was extremely emotional, weeping and screaming before he was sent to the Dementors and pleading violently with his father to grant him leniency. He screamed constantly in Azkaban — but this can be supremely expected among the prisoners of Dementors. He was prominently hypocritical, and snarled at the Death Eaters for hiding and refusing to brave Azkaban in Voldemort's name, when this is exactly what he can be accused of also.\n", "Barty was one of the only known wizards to call Voldemort by his name 'Voldemort' instead of using 'the Dark Lord' or a different version of it, saying his name while talking to Harry after the Third Task. He was also the only known Death Eater to do so; even defectors such as Severus Snape and Regulus Black referred to Voldemort as \"the Dark Lord\", while fellow fanatically loyal Death Eater Bellatrix saw it as a sign of respect not to speak the name.\n"], "quotes": [["\"...decent people are so easy to manipulate.\"", "—Barty to Harry Potter[src]\n"]], "figure_captions": []}