{"id": "Barty_Crouch_Sr", "name": "Bartemius Crouch Senior", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Barty_Crouch_Sr", "personality": ["Crouch spoke in a curt voice,[12] and seemed to be an overly serious person in contrast to his peers and colleagues: he did not smile or wave when his name was announced in the introduction to the Triwizard Tournament at Hogwarts School of Witchcraft and Wizardry, whereas Ludo Bagman, Head of the Department of Magical Games and Sports, waved jovially and enthusiastically, though this probably had something to do with the Imperius curse he was under.[7] He was known to be a strict rule-follower, someone who would not hesitate to either give his own son to the Dementors, or dismiss a highly devoted and loyal house-elf.[10]\n", "Having devoted his entire life to eradicating the dark forces, Crouch was well known for despising the Dark Arts and those who practised them, but the methods he used were just as brutal and cruel as those he worked to prosecute, as he legalised the usages of the Unforgivable Curses and went under the principles of kill rather than capture, shoot first and ask questions later, and so he would unethically imprison many people, including Sirius Black, without trials. To this end, he disregarded true justice for no good reason other than to make himself look good in the public's eyes, so as to further his own career and work his way up to becoming the Minister for Magic. If anything even looked like it might destroy his reputation, he would make it his first priority to remove it, even to the point of publicly disowning and imprisoning his son in order to make it clear that he had nothing to do with anyone who was even remotely suspected of being connected to the Dark Arts. He would later dismiss his devoted house-elf just for being at the wrong place at the wrong time (though the true reason is he deemed her unreliable, since she had almost let his subjugated son get away). In order to make progress, he even accepted a plea bargain with Death Eater Igor Karkaroff, granting him pardon in exchange for the names of other Death Eaters.\n", "Despite his ruthlessness and apparent selfishness, he was not completely unreasonable, as he was capable of feeling true love, since he agreed to his wife's dying request of saving their son from prison, despite his high position, reputation and general dislike for the Dark Arts and was willing to use the son, breaking the rules to restrain his son, breaking the laws he was so adamant in enforcing. He was willing to listen to Winky's persuasion of letting Barty Jr to see the Quidditch World Cup for a taste of freedom and fresh air, though it did take her many months of effort to achieve this. In this sense, he was more of a hypocrite than anyone but Sirius could have imagined. The reason he was seen as an unloving workaholic was due to him placing his public image and career over his family, having set his entire life into following rules and eradicating dark forces and would spend little to no time on his family life. Indeed, Sirius found it extremely weird when Crouch was calling in sick, as the Barty he (and the public) knew would never miss a day of work for any simple reason such as sickness. This tough love for his family made his own son see it as neglect, leaving a negative impact on the young man's perception and choices.\n", "Crouch's rule-abiding, ruthless, selfish and neglectful nature however ultimately turned out to be his undoing, especially after losing his popularity in the Wizarding World and keeping his son under the Imperius Curse for years to fulfil his wife's wish and to prevent him rejoining Voldemort's service. After Voldemort freed his son from the Imperius Curse Crouch put on him, Crouch's sanity was damaged by the Imperius Curse Voldemort put on him, leaving him in a delusional and weakened state after he managed to fight the Imperius Curse, and resulted in his death at the hands of his own son. While he became delusional to the point that he was at times unaware of his point in time, his location and mistook a tree for Percy Weasley, in one of his sane moments, he expressed remorse over his mistakes and attempted to warn Dumbledore by telling Harry about Voldemort's rising power. This demonstrated that in spite of his ruthlessness and hypocrisy, his ability to feel true love meant that he was still capable of realising and admitting his own faults.\n"], "quotes": [["\"Crouch fought violence with violence, and authorised the use of the Unforgivable Curses against suspects. I would say he became as ruthless and cruel as many on the Dark Side.\"", "—Sirius Black on Crouch's actions as Head of the Department of Magical Law Enforcement[src]\n"]], "figure_captions": []}