{"id": "Bellatrix_Lestrange", "name": "Bellatrix Lestrange", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Bellatrix_Lestrange", "personality": ["Bellatrix was slavishly devoted to Lord Voldemort, believing that she proved her loyalty by her time in Azkaban, which seems to have furthered her mental decline. She was Voldemort's most trusted and loyal follower. Bellatrix was also one of his cruellest Death Eaters, always eager to inflict the Cruciatus Curse on enemies and her family members; Harry Potter noted that Bellatrix was as \"mad as her master.\"[14]\n", "Bellatrix was egotistical and arrogant, described by Harry Potter as \"treat[ing] everyone like scum.\" She was obsessed with blood purity and took immense pride in the aristocracy and pure-blood of her family. Like all the rest of Lord Voldemort's followers she was vehemently against all: blood traitors, half-bloods, Muggle-borns, Muggles, and half-breeds. Also she was not above killing members of her own family who displeased her. Ironically Voldemort himself was half-blood. Given her reaction to Harry's words that Voldemort is half-blood, it is likely that she didn't know that her master was not pure-blood or at least was in denial.\n", "Bellatrix was a natural leader and took charge in tricky situations, such as during the Battle of the Department of Mysteries and the Skirmish at Malfoy Manor. She also had immense confidence in her skills and never hesitated to jump into battle against any auror or Order of the Phoenix member; she did however choose to flee when Dumbledore arrived suggesting that like her master she held a degree of fear for the powerful wizard. Another mark of her decisiveness and ruthlessness was that Bellatrix took no unnecessary prisoners (preferring to kill them instead) as she planned to do with a group of Snatchers who attempted to defy her in Malfoy Manor in 1998.[12] In ways, Bellatrix was like Minerva McGonagall; both were very powerful witches who were unfailingly devoted to their cause and their leader's greatest deputy. However, McGonagall (like most on her side) only trusted Snape because Dumbledore did, whereas Bellatrix never trusted Snape despite her master doing so.\n", "Despite her cruel personality, she was not incapable of caring for a few people. She was obsessively in love with her master, Lord Voldemort. She was also sexually attracted to him and the two eventually conceived a child (a daughter named Delphini) born between the Battle of the Department of Mysteries and the Battle of Hogwarts. Bellatrix hid her daughter as a secret from the world. Bellatrix also did not seem to care for her husband, due to her having an affair during their marriage. She had a close relationship with her younger sister, Narcissa Malfoy. She grudgingly went with Narcissa to Severus Snape's house when Narcissa wanted to ask Snape to help Draco and did not tell her master of Narcissa's deception. She also showed affection for her nephew Draco Malfoy, teaching him Occlumency and possibly other skills.\n"], "personality_quotes": [["\"Let him watch while we torture the little girl. I’ll do it.\"", "—Bellatrix gleefully threatens to torture Ginny Weasley[src]\n"]], "figure_captions": ["Bellatrix cruelly laughing at Longbottom's reaction to Harry Potter's apparent death"], "quote": ["Potter, you cannot win against me! I was and am the Dark Lord's most loyal servant. I learned the Dark Arts from him, and I know spells of such power that you, pathetic little boy, can never hope to compete!", "—Bellatrix regarding her own loyalty and skill\n", "Harry Potter and the Order of the Phoenix"], "description": "Bellatrix Lestrange (née Black) (1951 – 2 May, 1998) was an English pure-blood Dark witch, the eldest daughter of Cygnus and Druella Black (née Rosier) and elder sister of Andromeda Tonks and Narcissa Malfoy. She was a member of the House of Black, an old wizarding family and one of the Sacred Twenty-Eight. Bellatrix started her education at Hogwarts School of Witchcraft and Wizardry in 1962 and was Sorted into Slytherin House.\n"}