{"id": "Bill_Weasley", "name": "William Weasley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Bill_Weasley", "personality": ["Bill was laid back and easy going, and described as \"cool\". However, he had a serious side, being a high academic achiever as a student and being Hogwarts Head Boy his seventh year. He took his studies seriously, as he referenced History of Magic, which normally many students would fall asleep due to the teacher's dull style of teaching, during his discussion with Harry regarding goblin's ideals of ownership. He was knowledgeable about wizard-goblin relations for his work. Despite being the eldest of seven children, he had a lively sense of humour and knew how to have fun.\n", "He was very brave, working as a Curse-Breaker and joining the Order of the Phoenix to fight against Lord Voldemort. He is also of great compassion and loyalty, as he was displeased with how Ron would abandon Harry and Hermione over a little argument, but did not pursue the issue seeing Ron's clear regret, and allowed him to stay for the time being. After his mauling at the hands of Fenrir Greyback, it was feared that his personality would change and that he would take on some wolfish characteristics. However, Bill's personality remained intact, although he did develop a liking for very rare steaks.\n", "When Bill met Harry Potter for the first time in 1994, Harry was taken by surprise at Bill's cool, laid-back demeanour; from everything Harry had heard from Ron, he had always pictured Bill as an older version of Percy, who was more serious and stuffy than all his siblings.\n"], "personality_quotes": [["\"Bill's not that down-to-earth. He's a Curse-Breaker, isn't he, he likes a bit of adventure, a bit of glamour...\"", "—Description of Bill's personality[src]\n"]], "figure_captions": ["Bill and Charlie jousting with tables at the Burrow"], "quote": ["What do I care how 'e looks? I am good-looking enough for both of us, I theenk! All these scars show is that my husband is brave.", "—Fleur Delacour regarding Bill's bravery\n", "Harry Potter and the Half-Blood Prince"], "description": "William Arthur[6] \"Bill\" Weasley (b. 29 November,[1][2] 1970[3]) was the first child of Arthur and Molly Weasley (née Prewett) and the eldest brother of Charlie, Percy, Fred, George, Ron, and Ginny. He attended Hogwarts School of Witchcraft and Wizardry from 1982-1989 and was both a prefect and Head Boy. \n"}