{"id": "Cedric_Diggory", "name": "Cedric Diggory", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Cedric_Diggory", "personality": ["Cedric was said to be an embodiment of the qualities of Hufflepuff House. He had a sense of fair play: during the 1993 Gryffindor/Hufflepuff match, despite his capture of the Golden Snitch (which ensured his team's victory), Cedric immediately offered to replay the match once he found out that his opponent, Harry Potter, had fallen from his broom due to the influence of the Dementors.[5] Later on, he provided Harry with information as to how to decipher the golden egg clue for the Second Task. After Harry saved him in the maze, Cedric realised that Harry was the one who truly deserved to take the Triwizard Cup, and had no qualms with openly acknowledging it, which actually resulted in an argument of sorts between them. This sense of fair play and his ability to accept there were those who were better than him is a definite testament to his nobility and his grace.\n", "He also appeared to possess a strength of character that was not unlike Harry's. This came into play when Fleur's turning the force of her Veela charm on him while asking him to be her date for the Yule Ball. He refused, for he already had a date. Hence, it could be said that Cedric was a man of his word with remarkable inner strength, especially given how he was able to successfully resist the allure of Veela charm (which could be overwhelming) and keep his previously made promise.\n", "Besides all this, Cedric was genuinely modest, telling his father that his victory in the Gryffindor/Hufflepuff Quidditch match had not been a truly fair one. All the female Gryffindor Chasers described him as being \"strong and silent\", suggesting that he was sensible enough to speak only when it was absolutely necessary. He was also courteously polite to foreigners: though he supported Ireland during the 1994 Quidditch World Cup final, he was still civil to Viktor Krum (who was from Bulgaria). The fact that his spirit's last request to Harry had only been to take his body back to his parents also proved that he loved his parents dearly.\n", "While this side of him was never seen in the original timeline, he appeared to have a sense of honour and importance for his title at the school. This was proved by the fact that in one of the alternate timelines, in which he was humiliated during the Triwizard Tournament, this feeling of embarrassment eventually led him to join the Death Eaters. This means that if his pride or status was to ever been shot down enough, this feeling of anger would have turned him over to the Death Eaters.\n"], "personality_quotes": [["\"We'll celebrate a boy who was, kind and honest, and brave, and true right to the very end.\"", "—Dumbledore regarding Cedric's character[src]\n"]], "figure_captions": ["Cedric laughing at Draco Malfoy's expense"], "quote": ["Remember, if the time should come, when you have to make a choice between what is right and what is easy, remember what happened to a boy who was good, and kind, and brave, because he strayed across the path of Lord Voldemort. Remember Cedric Diggory.", "—Albus Dumbledore's eulogy to Cedric\n", "Harry Potter and the Goblet of Fire"], "description": "Cedric Diggory (September/October, 1977 – 24 June, 1995) was a British wizard who was the son of Amos Diggory and his wife. He started attending Hogwarts School of Witchcraft and Wizardry in 1989, and was sorted into the  Hufflepuff House. During his time at school he was a prefect and captained the Hufflepuff Quidditch team, playing as Seeker. In his sixth year Cedric put his name forward to compete in the Triwizard Tournament.\n"}