{"id": "Cho_Chang", "name": "Cho Chang", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Cho_Chang", "personality": ["Generally polite, sweet, and well-mannered, Cho was easy to get along with and was a popular student at Hogwarts, with a large group of friends and many boys who admired her for her extreme beauty (including Harry Potter himself).\n", "Having been sorted into Ravenclaw House, Cho was presumably intelligent, enforced by her mastery of all defence magic that Harry taught her, including the Patronus Charm, though she did admit that she was unable to stun anything before Harry taught her. She was also an avid Quidditch fan (having supported the Tutshill Tornados since she was six years old) and a good athlete, playing Seeker for her House's team. She was also loyal and brave, having been loyal to the Tutshill Tornados for many years as opposed to jumping the bandwagon, joining Dumbledore's Army in defiance with the Ministry both out of support of Harry and in order to avenge the death of her late boyfriend Cedric, sticking up for her friend Marietta when the rest of the group ousted her for her treachery, and returning to Hogwarts in her seventh year in order to fight alongside her comrades and defend the school from Death Eaters.\n", "For the most part, Cho was often found around Hogwarts with a gaggle of girlfriends, though after one of her emotional breakdowns over Cedric's death, they apparently left her during her depression. Despite this, Cho was a very loyal person (perhaps even to a fault); when she and her friend Marietta Edgecombe joined Dumbledore's Army, she insisted on bringing her friend along even when her friend expressed disinterest and cynicism to the club's effects. Later, even though Marietta eventually sold out the DA to Umbridge and the Ministry of Magic, Cho stood by her and insisted to the accusatory Harry that Marietta was a \"lovely person\" who \"just made a mistake.\" Her loyalty and courage were shown again when she came back to Hogwarts to fight even after she had graduated, and offered to show Harry up to the Ravenclaw Tower, indicating that she harboured no hard feelings against them despite their previously fallen out romantic relationship.\n", "Cho was perceived by Harry Potter and Ron Weasley to be excessively emotional, though as Hermione stated, much of this characterisation was attributed to her behaviour and actions directly after her boyfriend's death, pushing her way through the trauma and grief that is only observed from the periphery. During her grief, she was prone to many crying spells and a difficult control over her emotions, leading to a prying sort of aggression when she dated Harry to get the details of Cedric's death, and also the irrational jealousy and paranoia that ensued when Harry would bring up Hermione Granger for what Cho saw to be flippant insensitivity from Harry's end. Hermione, for her part, did not seem to blame Cho at all, understanding her grief and depression and stating that it had interfered with many aspects of Cho's life, including Cho's grades and her position on the Quidditch team.\n", "Cho has also said that she and Roger Davies used to date; after Ravenclaw's loss of the House Cup in 1995, Ginny Weasley said that Michael Corner had gone to comfort Cho. Later in life, she married a Muggle.\n"], "quotes": [["Ron Weasley: \"You're well out of it, mate. I mean, she's quite good-looking and all that, but you want someone a bit more cheerful.\"\n", "Harry Potter: \"She's probably cheerful enough with someone else.\""]], "figure_captions": ["Cho in her seventh year"]}