{"id": "Cornelius_Fudge", "name": "Cornelius Fudge", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Cornelius_Fudge", "personality": ["During his tenure as Minister for Magic, he appeared in the early years as a bumptious, good-natured wizard trying to manage and smooth over the occasional crisis, such as Harry Potter's misuse of magic to inflate his Aunt Marge in 1993.[19]\n", "Fudge seemed to favour people born with high status, particularly the Malfoys, over lower class, such as the Weasleys, as seen in his friendship with Lucius Malfoy and neglect of Arthur Weasley, all the while being unable to tell Lucius was manipulating him. Also, despite being accepting towards Muggles, Fudge appeared to favour pure-bloods, and showed little respect for Squibs and half-breeds, as he spoke in disinterest when interrogating Arabella Figg, while accusing half-giant Olympe Maxime of murdering Barty Crouch; Fudge neglected Arthur due to believing the man's obsession with Muggles to be a telltale sign of lacking \"proper wizarding pride\". When Dumbledore offered to summon the house-elf Dobby to the hearing for testimony, Fudge blatantly stated that he had no time to listen to house-elves, showing his disregard for what he considered to be an inferior species, and his overall belief that the elves are lower than wizards.\n", "His favouritism had limits, though, for he was not so hasty to imprison Rubeus Hagrid, possibly due to the half-giant's relationship with Dumbledore. Even so, he turned a blind eye to Lucius Malfoy's own record as a Death Eater because he was cleared in the past (as Lucius lied about being under the Imperius Curse) as well as his vaunted position in Wizarding society and frequent cash donations. He was rather tactless, as he was making crude body gestures to communicate with the Bulgarian Minister for Magic and revolted aloud the moment he saw Marietta Edgecombe's disfigured face, having little sensitivity to the girl's feelings. Upon discovering Harry was a Parselmouth, Fudge caved into prejudice, and started to doubt Harry simply because he could speak a language that was usually affiliated with the Dark Arts. He was also arrogant enough to award himself with the Order of Merlin, First class medal, which caused controversies throughout the community, as it was common view that Fudge's career was \"less than distinguished\".[12]\n", "Although Fudge started out as a well-meaning man, he favoured peace and tranquillity for the sake of his own position over a truth that would cause disruption of that peace. This was demonstrated when he was reluctant to tell Harry Potter the supposed reason for Sirius Black's escape from Azkaban, due to not wanting to worry Harry, despite the importance to Harry's safety. Preferring to tell the public what they wanted to hear instead of what they needed to hear, and deluding even himself with such lies, Fudge would use virtually any means to cover up the truth as long as he deemed the evidence to be insufficient, and was perfectly willing to ruin the reputation of those who dared to oppose him, even if it meant abusing the powers of his position and making changes in the laws to do so. Even prior to his dismissal, Fudge attempted to persuade Harry to lie to the wizarding world that the Ministry was performing well in security and maintenance, despite how he mistreated Harry for an entire year, as well as the fact that his inadequacy had already endangered the entire world by denying Voldemort's return; he was seemingly more desperate in saving his own career and reputation than repairing the damage he inflicted to the community's defences against the Death Eaters. Due to the power going to his head, Fudge had spiralled into corruption and used falsified propaganda to maintain his own position at the expense of those who he believed were his enemies, even if that so-called enemy was someone who had helped him out for many years, to which he had no trouble in being ungrateful, and then later shamelessly asking favours from people he had offended.\n", "Fudge also appeared to be more reactive than proactive; he would often wait for a solution to appear, rather than take the initiative and create a solution. Because of his indecisive nature, he would often ask Dumbledore for advice in his early days as Minister. Unfortunately, when Fudge did take the initiative and make his own decisions in attempt of accomplishing his job, they were often misguided and led to disastrous consequences, such as when he placed Dementors at Hogwarts to recapture Sirius Black, which led to students being traumatised and Harry Potter to nearly receive the Dementor's Kiss at the end of the school year. He later insisted on summoning a Dementor to Barty Crouch Jr's interrogation for his own protection, despite knowing that Barty had been restrained and guarded by Professor McGonagall, and the possibility that the Dementor would attack the prisoner on sight, which did happen, resulting in the destruction of their most critical piece of evidence at that time.\n", "However, the mistake that led to Fudge's undoing was when he led a smear campaign against Dumbledore and Harry Potter, denying the wizarding world the chance to protect themselves and effectively allowing Voldemort a full year to build his forces uninterrupted. Even after his folly had been exposed, Fudge was more concerned about his own reputation than actual security and attempted to deceive the community by persuading Harry to tell them the Ministry under him was achieving positive results, which would have endangered them further by giving them a false sense of security. Despite this, he was willing to stand against Voldemort, refusing to step aside as Minister when threatened, though due to poor preparations Fudge failed to prevent Voldemort from causing the Brockdale Bridge to collapse.\n", "The only known case where Fudge was reluctant to act against his better judgement was the case of Hagrid in spring 1993. While he knew that Hagrid's record was against him, he didn't wish to send him to Azkaban for supposedly opening the Chamber of Secrets without definitive evidence. But Fudge couldn't put off the pressure from the Ministry forever. The situation wasn't entirely hopeless: Fudge promised that if proven innocent, Hagrid would be released and given an apology. In the end, the Minister proved as good as his word.\n", "Fudge grew more and more paranoid over the years, believing himself to be the smart one, and Dumbledore a troublemaker who conspired to overthrow him for the post of Minister for Magic (despite the fact that Dumbledore had previously refused the post three times when offered) and apparently being more ungrateful for Dumbledore's years of friendly and helpful advice. This was partly due to Fudge remembering Dumbledore's superiority and popularity in the past and present. This paranoia was usually kept suppressed, as Fudge continued to respect Dumbledore over the years, and accepted many of Dumbledore's decisions.\n", "As he became more and more overwhelmed, however, his paranoia rose and began to cloud his judgement; by ignoring Dumbledore, Fudge had metaphorically shot himself in the foot. With Dumbledore's help over the years, Fudge grew more confident on his own, which made him delude himself into believing that his poorly made choices were correct. His increasing lack of preventive action affected his popularity with the wizarding world: despite Fudge's efforts of keeping control, several people chose to believe Dumbledore and Harry over him, and by the summer of 1996, he had been forced to resign from office in disgrace and replaced by the more proactive Rufus Scrimgeour.\n", "However, despite all his faults, Fudge did have a compassionate side to him. He protested Dumbledore's suspension as Headmaster of Hogwarts, even though the motion had already been carried. He also intended to protect Harry from the recently escaped Sirius Black to the best of his ability. After hearing that the Dementors had attacked Harry twice within Hogwarts' grounds, he had the sense to order them immediately away from the school. At times, Fudge could develop a sense of humour as well: he once assured Harry that \"the Ministry doesn't send people to Azkaban for blowing up their aunts\". He also sarcastically responded that Harry might have \"a twin brother\" when Dumbledore attempted to absolve him of forming the DA.\n", "Although his behaviour throughout 1995 made him appear to be such, Fudge was not a totally unreasonable man, as he simply buried himself in his own self-denial, love of office, delusions and paranoia. He was capable of admitting when he was wrong, but only with damnable and solid evidence which he could see with his own eyes. After witnessing Voldemort's return with his own eyes, Fudge could no longer bury himself in lies and cleared Dumbledore's and Harry's names alongside the names of notable members of the Order of the Phoenix unjustly persecuted by the Ministry (most notably Rubeus Hagrid, Arthur Weasley, Sirius Black), at the price of him being removed from his position. For instance, he was able to admit to the Muggle Prime Minister, with somewhat humbleness, that starting a ruthless manhunt for Sirius Black may have been aimless since he was in fact innocent all along, which Fudge realised when he learned that Black was killed by his own cousin in the Battle of the Department of Mysteries (despite incorrectly believing earlier that the two were working together). Interestingly, however, in the article in the Daily Prophet absolving Dumbledore and Harry, it states the two of them prevailed despite being constantly slandered, ignoring the fact that it was Fudge who ordered the Daily Prophet itself to do such.\n"], "personality_quotes": [["\"He's going to get us all killed just because he can't face the truth.\"", "—Hermione Granger's reaction to Fudge's Daily Prophet interview about the Azkaban mass breakout of 1995[src]\n"]], "figure_captions": [], "quote": ["You are blinded by the love of your office, Cornelius! You place too much importance, and you always have done, on the so-called purity of blood! You fail to recognise that it matters not what someone is born, but what they grow to be!", "—Fudge's faulty and inaccurate values\n", "Harry Potter and the Goblet of Fire"], "description": "Minister Cornelius Oswald[8] Fudge, O.M. (First Class), was a British wizard who was the Minister for Magic from 1990-1996. He thus had complete control of the Ministry of Magic, the main governing body of the British wizarding world. Fudge began his career in the Ministry as Junior Minister in the Department of Magical Accidents and Catastrophes. He then succeeded Millicent Bagnold as Minister for Magic, and thus had the responsibility of meeting with the Muggle Prime Minister when necessary.\n"}