{"id": "Dean_Thomas", "name": "Dean Thomas", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Dean_Thomas", "personality": ["Dean was open-minded. When Dolores Umbridge referred to Remus Lupin as a \"dangerous half-breed\", he jumped to his former teacher's defence. On two occasions, he told her and Professor Snape that Lupin was the best Defence Against the Dark Arts teacher that his class group ever had. \n", "Dean was generally an easy-going and good-natured person, able to get along well with many people. He never displayed any anger towards Harry Potter during their sixth year, especially when his ex-girlfriend Ginny Weasley started dating Harry shortly after breaking up with her. This was because he was aware of Ginny's childhood crush on the Boy Who Lived since she came to Hogwarts.[8] He also easily established a friendship with Luna Lovegood, whom many would consider bizarre.[9]\n", "Dean was brave and loyal. He was eager to participate in the defence of his school against Death Eaters, despite not even having a wand,[9] and never lost his faith in Harry Potter. He believed Harry's claim that Lord Voldemort had returned[7] and had faith that Harry would eventually defeat the Dark Lord.\n", "Dean was apparently willing to violate school rules, if doing so would help a friend. In his third year, when Harry was not allowed to go to Hogsmeade because his uncle had not signed his permission slip, Dean offered to forge the signature (unfortunately Harry could not accept, as he had already mentioned to Professor McGonagall that his form was not signed).[3]\n", "Dean was a skilled artist and also enjoyed reading the comic book Loony Nonby v.s. Cornish Pixie, showing an interest in art.\n"], "personality_quotes": [["Dolores Umbridge: \"You have been exposed to some very irresponsible wizards in this class, very irresponsible indeed — not to mention, extremely dangerous half-breeds.\"\n", "Dean: \"If you mean Professor Lupin, he was the best we ever —\"\n"]], "figure_captions": ["Dean was supportive of Harry Potter during his tough years at Hogwarts"], "quote": ["We're fighting, aren't we? The message said Harry was back, and we were going to fight! I'll have to get a wand, though....", "—Dean's determination to fight\n", "Harry Potter and the Deathly Hallows"], "description": "Dean Thomas (b. 1979/1980) was an English half-blood wizard, the son of a wizard and a Muggle mother.[2] When Dean Thomas was very young, his father died and his mother married another man, giving Dean several half-siblings.[2] Since Dean's father never told his mother that he was a wizard and was eventually murdered by Death Eaters when he refused to join them, Dean grew up thinking he was Muggle-born.[2]\n"}