{"id": "Dobby", "name": "Dobby", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Dobby", "personality": ["Dobby was a brave, loyal house-elf, willing to put himself in dangerous situations when he knew it to be the right thing to do. He was also very loyal to the few friends he had. He considered himself to be a good house-elf, though other house-elves seemed to find his desires and proclamations of being a free house-elf to be shameful. Despite this, he was still a hard worker. When he went to work at Hogwarts he refused Dumbledore's original offer of ten Galleons a week and weekends off, opting instead for one Galleon a week and one day off per month. He explained to Harry, Ron, and Hermione that he liked freedom very much, but he liked work better. Dobby thought of Harry as his best friend.\n", "Because of his loyalty to his friends, Dobby tries everything he can to save them if they are in danger, even if it hurts them (this led to Harry asking Dobby to never try to save him again after setting him free), and once attempted to seriously injure Harry Potter, hoping that if he was hurt badly enough he would be sent home. He did not make the rogue bludger chase Harry out of malicious intent, but because he was trying to save him from Lucius Malfoy's plot to open the Chamber of Secrets. When Harry found out, he was furious but Dobby explained why he had tampered with the bludger and by the end of the year Harry had forgiven him.\n", "One most noticeable trait was his capacity to self-harm whenever he believed he had done something wrong, usually using something to hit his head or going as far as to iron his own hands. Dobby clearly had a strong conscience, and punished himself even when he had done \"wrong\" things that house elves should not do, even if they were for the right reasons.\n", "Dobby's favourite gift to receive was socks, likely because he was freed from his enslavement to the Malfoys with a sock. He would get confused when he would get two of the same style as he preferred to have two brightly coloured or patterned mismatched socks and would often give socks as gifts as well.\n", "Dobby referred to himself in the third person and tended to get his verb conjugations mixed up. Examples of his strange speech pattern include \"I has seven now sir\" or \"Dobby must punish himself most grievously for coming sir\". Dobby also referred to Ron as Harry's \"Wheezy.\"\n", "He was extremely devoted to Harry Potter after Harry freed him in 1993, helping him out on several occasions, ultimately at the cost of his own life. He also tried to help Winky after she was dismissed by Crouch, getting her a job at Hogwarts as well, and looking after her whenever she became drunk on butterbeer.\n"], "quotes": [["\"Dobby has come to save Harry Potter, of course. Dobby will always be there for Harry Potter.\"", "—Dobby's loyalty[src]\n"]], "figure_captions": ["Dobby protecting Harry in 1993"]}