{"id": "Dolores_Jane_Umbridge", "name": "Dolores Umbridge", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Dolores_Jane_Umbridge", "personality": ["Dolores Umbridge was an evil woman, nothing short of a sociopath who characterised the worst aspects of political power. She was ruthless, cruel, brutal, corrupt, fascistic, misanthropic, and devoid of a moral or ethical centre. She was depicted using any means to maintain her personal power and the political power of her bosses, often flaunting that power during her time in Hogwarts. She committed attempted soul-removal (via the Dementor attack on Harry), solicited bribes, and tortured children to achieve her goals. Her draconian ideals of discipline, such as having victims write lines in their own blood using a Black Quill, which carves the words into the back of the writers hand, were considered by Harry and Ron to be \"sick\".\n", "Her cruelty was disguised by her quiet, childish, high-pitched voice (which both took Harry aback and made the hair on his neck stand up straight, as he had expected a croak), as well by decorating her office with paraphernalia related to kittens, chocolate cakes, biscuits, tea, and other cute things to the point of being sickening. Her personality has been described as \"poisoned honey,\" and it was said on various occasions that the sweeter her voice was, the more dangerous or infuriated she became. \n", "She also tended to give her signature fake cough, \"Hem-Hem,\" when she wanted someone's attention, rudely interrupting them, as well as usually speaking to people she felt were beneath her in a very condescending tone, as if they were simpletons or very young children. (On one occasion, Professor McGonagall brushed off the fake cough by offering her a cough sweet.) Although she likes kittens (hence her decorations relating to them), she finds that real kittens are too much of a mess to take care of, and instead focuses on decorations.[1]\n", "Umbridge was fanatically prejudiced against part-humans (such as werewolves and half-giants), which she called \"half-breeds.\" It was her prejudice that caused her to pass a series of anti-werewolf legislation, which made it almost illegal for those afflicted with lycanthropy to hold jobs. Her prejudice also led to her mistakenly believe that mermaids and centaurs were part-humans, when in fact they were separate species, and in her haste of prosecuting them she would forgo her usual feigned politeness, and be outright rude. However, after the incident with the Hogwarts centaurs, she developed a phobia of centaurs. An odd derivative from this prejudice was that, despite her hatred of half-breeds, Umbridge did not seem to hate part-goblin Filius Flitwick (most likely due to lack of knowledge of Flitwick's ancestry and his undeniably skilled teaching methods), as Fred Weasley stated that she marked him well on his inspection.\n", "Umbridge was a pure-blood supremacist, stemming from her childhood when her brother was discovered to be a Squib. Hating her mother for being a Muggle, Dolores would blame her for being the cause of her brother's lack of magical powers. After bribing her father to quietly leave public sight, Dolores lied to everyone that she was a pure-blood, believing it would give her social respect and status, later bolstering her credentials by falsely claiming that she was related to the Selwyn family. She was known to spout very uncharitable views on the non-magical community when intoxicated, to the point that even fellow pro-pure-blood coworkers were shocked by her. While sober, Dolores would put up a facade of politeness for Muggle-born, repressing her prejudice for them to maintain her public image; only when Voldemort took over the Ministry did she unleash her cruelty over them, tormenting them with sham trials and sadistically sending them off to Azkaban.\n", "Her lust for power and social status seems to cause her to have no feeling for genuine love. Despising her Muggle mother and Squib brother as second class citizens while ashamed of her lowly janitorial employee of a father, Dolores would never speak of any of them again while shunning her father with a bribe, and went onto inventing her ancestry to make herself seem more noble to the higher ups. Dolores also attempted to seduce her superiors into marriage, not out of love, but for the social elevation and security it would provide (hence she had no preference to any particular individual). Her lack of true love behind her attempts, however, was clear, as none of her superiors could truly like her due to knowing her nasty personality underneath her hard work and feigned politeness.\n", "She placed a blind faith in authority, believing that it could not possibly be wrong, and even after it was proven wrong she did not change her opinion. This went hand-in-hand with her self-serving nature;[21] she liked power a lot, naturally siding with those who would give her the most authority (as was clearly seen when she was loyal to Fudge over Dumbledore, rather than accepting the truth, and then abandoning Fudge when he was ousted from his office). Umbridge was as ruthless in maintaining her power as she was in seeking it. She desired to exercise complete control over everyone and everything around her. Even as a student, she was resentful that the school did not grant her any position of power and responsibility, and felt that she was deprived of a chance to exercise authority over her peers.\n", "From her perspective, free speech, dissent, diversity and multiple points of view could not be tolerated. Therefore, Umbridge also represented the qualities of a totalitarian government. She led not by consensus and respect, but rather by fear and intimidation; she had no trouble using any methods available in order to make people obey her, even attempting to use the restricted Veritaserum and then the Cruciatus Curse on Harry Potter when he would not give her desired information.\n", "Umbridge was known to rapidly resort to cruel and unusual punishments over perceived slights and take great pleasure in such punishments. Umbridge also liked to showcase her statuses, as she arrogantly told the centaurs in the Forbidden Forest of her many titles, and mounted plaques on her office doors to display these titles. Unaware that she was in possession of Salazar Slytherin's Locket, she falsely claimed it was a family heirloom and proof of her relation to the Selwyn family.\n", "When Fudge was dismissed, Umbridge continued to support the Ministry (such was her devotion to authority) and seemed to try to get to the same position of power she had had with the new Minister Rufus Scrimgeour. Even when the Death Eaters took over, she stood by their side and persecuted Muggle-borns for them. Although she was not a Death Eater, she showed no qualms about indirectly supporting them with her work at the Ministry while it was under Lord Voldemort's control, and freely espoused many of their virtues (even before they gained control of the Ministry).\n", "She showed a particular hatred for Harry Potter, as she violently punished Harry during detentions, and deemed him \"Undesirable No. 1\" during the Death Eaters' reign, because she was never able to get her way with him and because he embodied everything she hated and could not tolerate. During her year as a professor at Hogwarts, she acted as disciplinarian, insisting the students to greet her loudly and clearly in a monotonous style at the beginning of every class, and answer her questions in the same manner.\n", "Despite (or perhaps because of) her feigned politeness, the other teachers found her infuriating. Umbridge became more openly authoritative and cruel as she gained influence over the school, especially during her time as the High Inquisitor, as seen when she interrupted teachers with her leading questions, passive-aggressive comments, and disruptive note taking. She was especially insulting to Hagrid, whom she knew to be a \"half-breed,\" and was blatantly condescending and rude to him during her inspection of his class. She interrupted Dumbledore during his speech at the Start-of-Term Feast, and delivered a very dull speech while being ignorant of the students' restlessness, to the point that Harry speculated that she would have continued with it even if a full-scale riot broke out under her nose.\n", "Umbridge rarely expressed the extent of her anger openly, casually making decrees and handing out torturous punishments with a smile (most notably, forcing Harry to carve \"I must not tell lies\" into the back of his hand with a Black Quill). She created several new rules and regulations in order to increase control and chances to punish students, despite many of them being ridiculous and unfair.\n", "Umbridge occasionally lost her temper, when she did not have things her way, such as when Fred and George Weasley began a rebellion against her during her time as Headmistress. When Marietta Edgecombe's memories were secretly modified by Kingsley Shacklebolt and she did not tell the truth about Dumbledore's Army, Umbridge physically shook Marietta very hard, and only stopped when Dumbledore pointed his wand at her. She also had a tantrum when the gargoyle of the Headmaster's office refused to let her in when she became Headmistress, and an outburst against \"half-breeds\" led her to be carried away by centaurs in the Forbidden Forest.\n", "Umbridge often made hypocritical statements, claiming during the Start-of-Term Feast that she assured the students that they would all be very good friends, she admitted later that she actually hated children. Despite claiming to be a \"tolerant woman\" who did not stand for disloyalty, she frequently attempted to silence those with whom she disagreed. Her hatred of both \"half-breeds\" and \"Mudbloods\" demonstrated her intolerance, while her constantly shifting attachment to the currently most powerful showed her opportunism. Despite her incessant claims that telling lies was wrong, she was perfectly willing to lie without shame when it suited her.\n", "Umbridge was presumably capable and fairly intelligent, as she was high-ranking in the Ministry at a relatively young age, although her general magical knowledge seemed limited. She unreasonably demanded Snape to brew Veritaserum in less than the required month after she squandered an entire bottle on one previous interrogation, although Snape had told her that three drops would suffice. She also could not figure out how the students were suffering from the symptoms of \"Umbridge-itis,\" nor how to remove the Weasleys' Wildfire Whiz-bangs and the Portable Swamp left by Fred and George Weasley, which Flitwick cleaned up in a matter of seconds. \n", "Her style of teaching students was also simply having them read from the textbook, while avoiding any practical lessons and answering students' questions, showing that she was inadequate in teaching, something Professor McGonagall made clear during Harry's Careers Advice; indeed, Umbridge believed that theories were enough for students to get by exams and mastering self-defence, which in many situations proved her wrong, though she refused to acknowledge that fact. Despite her wickedness and support of Death Eaters, she was at least known by reputation not to be a Death Eater herself. In what appears to be an ironic twist or inconsistency, she could produce a Patronus Charm. \n", "Umbridge also understood the importance of Argus Filch's knowledge of the school's geography, and made efforts to befriend him in order to advantage herself, despite his status as a Squib, which many would consider a sign of a second-class citizen in the wizard community. However, she was not above blaming him for her own faults, to the point of irrationality, such as when she stunned one of the Weasleys' Wildfire Whiz-bangs causing it to explode, she called him out not to stun them despite his genetic inability to do so in the first place.\n"], "personality_quotes": [["Sirius Black: \"I know [Umbridge] by reputation and I'm sure she's no Death Eater —\"\n", "Harry Potter: \"She's foul enough to be one...\""], ["Umbridge: \"Not with your quill, you're going to be using a rather special one of mine. Now I want you to write, I must not tell lies.\"\n", "Harry Potter: \"How many times?\"\n"], ["Umbridge: \"Yes?\"\n", "Harry Potter: \"Nothing.\"\n"], ["\"You know... I really hate children.\"", "—Umbridge showing her true opinion of children[src]\n"]], "figure_captions": ["Dolores Umbridge at her desk with her kitten plates", "Umbridge trying to exert her power over McGonagall", "Umbridge happily tormenting Muggle-borns", "Umbridge slaps Harry in a fit of anger", "Harry's hand due to Umbridge's punishments with the Black Quill", "A pink and smiling Umbridge in the Great Hall next to Snape"], "quote": ["When they entered the Defence Against the Dark Arts classroom they found Professor Umbridge already seated at the teacher’s desk, wearing the fluffy pink cardigan of the night before and the black velvet bow on top of her head. Harry was again reminded forcibly of a large fly perched unwisely on top of an even larger toad.", "—A negative impression of Dolores\n", "Harry Potter and the Order of the Phoenix"], "description": "Madam Undersecretary Professor Dolores Jane Umbridge (b. 26 August, year unknown) was a half-blood[6] witch and Ministry of Magic bureaucrat who served as Senior Undersecretary to the Minister for Magic under Ministers Cornelius Fudge, Rufus Scrimgeour, and Pius Thicknesse.\n"}