{"id": "Draco_Malfoy", "name": "Draco Malfoy", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Draco_Malfoy", "personality": ["Draco was, in general, an arrogant, spiteful bully. Like Dudley Dursley, his narcissistic nature most likely stemmed from his being spoiled by his parents throughout his childhood, though according to Harry himself, Draco is even less sympathetic than his cousin. He believed himself superior to most people because of his family's pure-blood lineage as well as great wealth and social standing. He frequently behaved cruelly to Muggle-borns, so-called blood traitors, Gryffindor students, and anyone who was a supporter of Harry Potter or Albus Dumbledore. For much of his youth, Draco took after his bigoted father, Lucius Malfoy, as a role model, and frequently boasted about his family's influence and wealth.\n", "However, something began to change in Draco's psyche in his sixth year at Hogwarts. After Lord Voldemort made him a Death Eater, he gave Draco the task of assassinating Albus Dumbledore by the end of the year, something that Draco was very eager to do at first. After a number of feeble attempts, Draco began to crack under the enormous pressure that Voldemort was putting on him. He was uncertain of his ability to fulfil the mission and was terrified that he and his family would pay the price for his failure; the stress led him to be reckless as his two feeble attempts were noted to be foolish by Snape, and he attempted a Cruciatus Curse on Harry, despite the consequences of a life sentence in Azkaban.\n", "Over the course of the year, the mission also led Draco to neglect other aspects of his school life that he would previously have abused or enjoyed: he rejected his Prefect duties that he once would happily abuse; he feigned illness and paid another student to take over his stead in order to avoid playing Quidditch himself, as opposed to three years earlier when he would ensure the entire match was postponed by exaggerating a minor injury in order to suit the team's interest; he missed two Transfiguration homework assignments; he would distance himself from his friends Crabbe and Goyle and order them to be on lookout without telling them anything; and he would also spend less time mocking Harry and his friends despite the many opportunities. Ultimately, Draco was unable to kill Dumbledore, lowering his wand and being tempted to take Dumbledore's offer of protection for his parents. Also, during the Battle of Hogwarts, he showed genuine concern for Crabbe and Goyle, something he rarely did.\n", "Draco was intelligent and quick-witted, capable of deducing things and coming up with clever plans based on a small amount of information; his father had expected him to obtain top marks in school after his first year, and showed disappointment that Hermione beat him. He figured out through Montague's experience that the Vanishing Cabinets in Hogwarts and Borgin and Burkes were linked and that he could use that passage to his advantage. However, his plans could have limitations based on his own arrogance when dealing with people. When he attempted to sabotage Harry during the Gryffindor-Ravenclaw Quidditch match in their third year, his whole plan was based solely around the idea that the Dementors' appearance scared Harry, ignorant of the fact that it was the effect the Dementors had on him that caused Harry problems. Draco was also adept at compartmentalising his emotions, as is evidenced in his success with Occlumency.\n", "For the rest of the Second Wizarding War, Draco became disillusioned by the Death Eater lifestyle. He reluctantly participated in Death Eater activities and by the end of the war, remained on the fence. When Harry Potter was captured in his home, Draco showed great hesitation in identifying him before the Death Eaters.\n", "It is implied that, as an adult, Draco regretted joining the Death Eaters and lost some of his bigotry, as he has a civil, if not friendly, relationship with old school rivals and evidently raised his son Scorpius to be a better person than he was. He later admitted to Harry that he never truly craved power like his father and that his ambition was actually to become a star Quidditch player, but he wasn't good enough, and mainly he just wanted to be happy.[22] He also envied Harry's friendships, as he only ever had Crabbe and Goyle.[23]\n", "Draco was a very loving and devoted husband to Astoria, having told her that he didn't care if he ended the Malfoy bloodline in order to protect her from her family's curse which made childbirth dangerous and detrimental to her health. Draco was also rather wise in his later years, having never given in to his desire to use his family's secret Time Turner to see his wife for one more minute, having far too much respect for her desires and her memory to risk jeopardising the timeline for his beloved Astoria. This shows just how deeply Draco was capable of loving someone, to the point where even when the power was within his grasp to alter time to be with them, that he could resist such overwhelming temptation. This showed an immense change in his character by the age of forty.\n", "He also had a great deal more faith in others by this time. In the wake of his wife's death, he implicitly trusted Albus Potter to reach his son in a way he couldn't to keep Scorpius from completely isolating himself in grief and to help him get back on his feet. This shows that, despite his history with Albus's father, Draco bore him no grudge for it, even having implied to have a friendly relationship with the boy.\n"], "personality_quotes": [["\"You've picked the losing side, Potter! I warned you! I told you you ought to choose your company more carefully, remember? When we met on the train, first day at Hogwarts? I told you not to hang around with riff-raff like this! Too late now, Potter! They’ll be the first to go, now the Dark Lord's back! Mudbloods and Muggle-lovers first! Well — second — Diggory was the first —\"", "—Draco taunting Harry Potter after Voldemort's return and the murder of Cedric Diggory[src]\n"]], "figure_captions": ["Draco's arrogant demeanour"], "quote": ["I really don't think they should let the other sort in, do you? They're just not the same, they've never been brought up to know our ways. Some of them have never even heard of Hogwarts until they get the letter, I imagine. I think they should keep it in the old wizarding families.", "—Draco shows his prejudice at a young age\n", "Harry Potter and the Philosopher's Stone"], "description": "Draco Lucius[9] Malfoy (b. 5 June, 1980) was a pure-blood wizard and the only son of Lucius and Narcissa Malfoy (née Black). The son of a Death Eater, Draco was raised to strongly believe in the importance of blood purity. He attended Hogwarts School of Witchcraft and Wizardry from 1991-1998 and was sorted into Slytherin House. During his years at Hogwarts, he became friends with Vincent Crabbe, Gregory Goyle, Pansy Parkinson, and other fellow Slytherins, but he quickly developed a rivalry with Harry Potter.\n"}