{"id": "Dudley_Dursley", "name": "Dudley Dursley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Dudley_Dursley", "personality": ["Dudley was an unpleasant and spoiled child. His parents spoiled him to the point of becoming grossly obese, demanding, selfish, and manipulative, but most of all, extremely ungrateful. During his eleventh birthday, he screamed when he received one gift fewer than the previous year, making his parents promise to buy him two more, and pretended to cry when he realised Harry would have to come with him for his birthday trip to the zoo.\n", "Dudley had an awful habit of bullying children who were weaker and as much as five years younger than he was, and when he forgot his fear of Harry's powers, callously insulted him in any way possible, even jeering at Harry about his obviously disturbing nightmares.\n", "Despite being fairly manipulative, Dudley appeared to have a low level of intelligence. In 1991, whilst Rubeus Hagrid was attempting to enter the Hut-on-the-Rock, he foolishly quoted \"Where's the cannon?\" showing poor common sense. In the school holiday of 1994, he received a dismal school report from Smeltings Academy, which included very poor academic results as well as reports of bullying others.\n", "However, in 1995, Dudley faced dementors for the first time. Though a Dementor attack typically forced a person to re-live the worst moments of their life, Dudley's life-so-far of luxury and greed contained no \"worst moments,\" and therefore, during the attack, Dudley saw himself the way he truly was: spoiled rotten and a cruel bully. He was thus forced, rather harshly, to realise he needed to change his ways. This led to him regretting his treatment of Harry and his later attempts at reconciliation.[11] The cousins would have a relatively good relationship by 2017: Dudley and Harry visited each other, while their children played together.[13]\n"], "personality_quotes": [["\"We had to write an essay about our hero at school, Mr Mason, and I wrote about you.\"", "—Dudley being paid to flatter the Masons when they arrive for dinner[src]\n"]], "figure_captions": ["A photograph of a very spoiled Dudley"], "quote": ["I don't think you're a waste of space.", "—Dudley's farewell to his cousin Harry Potter\n", "Harry Potter and the Deathly Hallows"], "description": "Dudley Dursley (born c. 23 June, 1980[1]) was the Muggle son of Vernon and Petunia Dursley and cousin of Harry Potter. He was obese and insolent as a result of his parents spoiling him throughout his childhood, although he became muscular in his teens. He and his gang often tormented Harry, taking after the example set by his parents, as well as other weaker and younger children in their neighbourhood and at school.\n"}