{"id": "Ernie_Macmillan", "name": "Ernest Macmillan", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Ernie_Macmillan", "personality": ["Ernie did however seem to have a habit of jumping to conclusions regarding Harry Potter; in his second year, he believed and ultimately spread a rumour that Harry was the Heir of Slytherin. During his fourth year, Ernie made his disapproval of Harry's participation in the Triwizard Tournament as an illegal fourth champion clear, claiming Harry had done it to steal the spotlight from Hufflepuff.[9]\n", "Despite being a pure-blood and proud of it, Ernie never displayed any prejudice towards those of different blood status, as many other pure-bloods did. In fact, his two closest friends at Hogwarts were a Muggle-born, Justin Finch-Fletchley, and a half-blood, Hannah Abbott, and he looked out for both of them throughout his studies. His friendship with both of them technically made him a blood traitor by association, which may contradict on how proud he was of his wizarding lineage, or he may simply not care who he associated with. Ernie was also one of the first to openly express his support of Harry and Albus Dumbledore during the Ministry's smear campaign against them.\n"], "personality_quotes": [["\"I must say, I'm looking forward to seeing Malfoy's mother's face when he gets off the train.\"", "—Ernie shortly after helping Harry Potter hex Draco Malfoy[src]\n"]], "figure_captions": [], "quote": ["Personally I think this is really important, possibly more important than anything else we'll do this year, even with our O.W.L.s coming up. I, personally, am at a loss to see why the Ministry has foisted such a useless teacher on us at this critical period. Obviously, they are in denial about the return of You-Know-Who.", "—Ernie Macmillan's opinion of Dumbledore's Army\n", "Harry Potter and the Order of the Phoenix"], "description": "Ernest \"Ernie\" Macmillan (b. 1980) was a pure-blood[3] wizard who attended Hogwarts School of Witchcraft and Wizardry from 1991-1998. He was in the same year as the famous Harry Potter and was sorted into Hufflepuff House. He was also born into the Macmillan family, one of the Sacred Twenty-Eight.\n"}