{"id": "Ernie_Macmillan", "name": "Ernest Macmillan", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Ernie_Macmillan", "personality": ["Despite being somewhat pompous, Ernie was loyal to his friends and always honest, traits of a true Hufflepuff. He would usually shake Harry's hand in a portentous manner and speak in a somewhat ostentatious and presumptuous manner. He was never afraid to speak his mind, and could readily admit when he was wrong. As a student, he was hard-working and strived to get good marks, which was particularly evident in his fifth year, when he claimed to be revising for his O.W.Ls around nine hours a day.[13][10] He also displayed great bravery and loyalty in his participation in the Battle of Hogwarts.[14]\n", "Ernie did however seem to have a habit of jumping to conclusions regarding Harry Potter; in his second year, he believed and ultimately spread a rumour that Harry was the Heir of Slytherin. During his fourth year, Ernie made his disapproval of Harry's participation in the Triwizard Tournament as an illegal fourth champion clear, claiming Harry had done it to steal the spotlight from Hufflepuff.[9]\n", "Despite being a pure-blood and proud of it, Ernie never displayed any prejudice towards those of different blood status, as many other pure-bloods did. In fact, his two closest friends at Hogwarts were a Muggle-born, Justin Finch-Fletchley, and a half-blood, Hannah Abbott, and he looked out for both of them throughout his studies. His friendship with both of them technically made him a blood traitor by association, which may contradict on how proud he was of his wizarding lineage, or he may simply not care who he associated with. Ernie was also one of the first to openly express his support of Harry and Albus Dumbledore during the Ministry's smear campaign against them.\n"], "quotes": [["\"I must say, I'm looking forward to seeing Malfoy's mother's face when he gets off the train.\"", "—Ernie shortly after helping Harry Potter hex Draco Malfoy[src]\n"]], "figure_captions": []}