{"id": "Fenrir_Greyback", "name": "Fenrir Greyback", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Fenrir_Greyback", "personality": ["Fenrir, having forsaken his humanity long ago, was driven by his animal hedonism. He enjoyed attacking people, particularly children, and took pleasure in his brutality. At some point he became cannibalistic, greatly enhancing his notoriety.[1] During his capture of Hermione Granger, his threats to her had both cannibalistic and sexual overtones.[3] Greyback was also greedy, as he kept arguing with the Malfoy family about who would claim the bounties and glory of catching Harry Potter.[3] Despite his savagery, he did display fear towards those more powerful than him, as shown when he backed away cowed when Snape arrived to kill Dumbledore, or when he was too wary to approach Bellatrix after she brought him to his knees violently. He was well aware of the lack of respect he received from the Death Eaters, and that the Ministry would have claimed all the glory had they brought Harry Potter to them instead of directly to Voldemort.\n", "Unlike most werewolves, Greyback took both pleasure in and advantage of his abilities and savagery when transformed, and stationed himself near his targets. He enjoyed attacking them and specialised in biting children, hoping to infect them and raise them to hate humanity, though sometimes killing them when going overboard. Despite his ideology of thinking werewolves deserve blood, and his attempt to recruit more werewolves for his cause, Greyback would ultimately seem to be just a primal savage who enjoyed killing. Greyback's savagery was what differed him from most other werewolves: while most of them bit and infected unintentionally during only their transformed state, Greyback actually went as far as eat and kill purposely whether in his human or werewolf form. Greyback is feared more than most werewolves due to his brutality, even Dumbledore was shocked that Draco Malfoy allowed Greyback to enter Hogwarts, and was slightly disgusted after learning about Greyback's cannibalism. Despite his savagery, Greyback had a sense of fear and wariness as shown when he quietly stood aside when Severus Snape arrived to kill Dumbledore, and later when he only mildly protested when Bellatrix Lestrange brutally attacked him along with the rest of his Snatcher gang and seemed too scared to approach her afterward.\n", "Being a werewolf and therefore not subscribing to the Death Eaters' views on racial superiority, Greyback was not branded with the Dark Mark, despite being invited into the ranks of the Death Eaters and permitted to wear their robes.[3] This may have been because Lord Voldemort was prejudiced against Werewolves as well as Muggles and Muggle-borns. Therefore he would not allow Greyback to become an actual Death Eater, yet he was too valuable of an accomplice not to have in his ranks. Greyback showed clear resentment at the lack of respect he received but sided with the Death Eaters because of the amount of victims he would have access to. Most Death Eaters seemed to regard him with disgust, with Yaxley throwing a curse at him in the Astronomy Tower for attacking without permission and Bellatrix Lestrange forcing him to his knees before her in Malfoy Manor. The revulsion that the other Death Eaters felt towards Greyback was likely because of his lycanthropy as well as his implied sexual perversions. Indeed, it's very likely that if Voldemort had won the Second Wizarding War, he would have tossed Fenrir aside once he was no longer useful. Fenrir has also proven he had a low tolerance for insults and holds grudges, as he took vengeance on Lyall Lupin for an offensive remark by attacking his son.\n"], "quotes": [["\"Reckon she'll let me have a bit of the girl when she's finished with her? I'd say I'll get a bite or two, wouldn't you, ginger?\"", "—Greyback to Ron Weasley regarding Hermione Granger[src]\n"]], "figure_captions": ["Greyback at the height of his brutality and savagery"]}