{"id": "Filius_Flitwick", "name": "Filius Flitwick", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Filius_Flitwick", "personality": ["Flitwick was an emotional fellow, who seemed to have a gentle spirit. During the 1992–1993 school year when Ginevra Weasley was taken into the Chamber of Secrets, he burst into tears, and in 1993's Valentine's Day, when Gilderoy Lockhart called him a \"sly old dog\", he buried his face in his hands. During one Charms lesson, Neville Longbottom, while fumbling with attempts at casting a Banishing Charm, ended up sending Flitwick sailing across the room; Flitwick accepted this resignedly instead of losing his temper.\n", "He was also shown to have a sense of mischief and fun. He sarcastically remarked to Dolores Umbridge that, while he easily had the ability to remove Fred and George's rampaging fireworks, he wasn't sure if he had the authority. He also discretely cheered the Weasley Twins' escape from the school, and left a small patch of the twin's Portable Swamp under the window, which Ron believed he had done as a monument to Fred and George. He also covertly sneaked Harry a box of Sugar Mice so as to reward him for speaking out about Voldemort in the Quibbler because he couldn't talk about it aloud, murmuring a little 'shush' to Harry afterwards. During the approach to the Yule Ball in 1994, Flitwick gave up trying to teach his students when he saw their minds were elsewhere, and allowed them to play games in class — something that many other teachers did not follow suit.\n", "Nevertheless, he commanded respect in spite of his sensitive nature and small stature. When he encountered Harry Potter and Draco Malfoy on the stairs discussing Harry's new Nimbus 2000, Malfoy treated him just like any other teacher with no hint of the sarcasm he used with Remus Lupin.\n"], "personality_quotes": [["\"Splendid! Well done, dear!\"", "—Professor Flitwick congratulating Hermione Granger, one of his students[src]\n"]], "figure_captions": ["Professor Flitwick carrying a pile of books"], "quote": ["Speaking of eccentrics, you'll like our Head of house, Professor Filius Flitwick. People often underestimate him, because he's really tiny (we think he's part elf, but we've never been rude enough to ask) and he's got a squeaky voice, but he's the best and most knowledgeable Charms master alive in the world today. His office door is always open to any Ravenclaw with a problem, and if you're in a real state he'll get out these delicious little cupcakes he keeps in a tin in his desk drawer and make them do a little dance for you. In fact, it's worth pretending you're in a real state just to see them jive.", "—Description of Professor Flitwick\n", "Pottermore"], "description": "Professor Filius Flitwick (b. 17 October[1] 1958 or earlier[3]) was a part-goblin wizard[11] who attended Hogwarts School of Witchcraft and Wizardry and was sorted into Ravenclaw House,[12] being an intelligent young man and a model student.[13] Some time after his graduation, Flitwick returned to Hogwarts and became the Charms Master, as well as the Head of Ravenclaw House.[7]\n"}