{"id": "Fleur_Delacour", "name": "Fleur Delacour", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Fleur_Delacour", "personality": ["Fleur also had a very blunt nature, always speaking her mind, and therefore often came off as rude and snobbish. She once made insulting comments about the state of the Hogwarts Christmas decorations and later even about Mrs Weasley (her future mother-in-law)'s home.[30] This snobbish attitude was what made most other women, especially Molly and Ginny Weasley, dislike her.\n", "However, despite her high opinion of herself, Fleur's softer side was warm and caring. She fretted over the safety of those she loved, and if someone she cared about was in trouble she would always try to help them.[7] She was also not a superficial person. In 1997, after the Battle of the Astronomy Tower — when her fiancé, Bill Weasley, was in the hospital wing, Fleur insisted on treating his wounds herself, taking the ointment from Molly Weasley. When Molly lamented over how the wedding was to be cancelled because of Bill's wounds, Fleur took offence at the implication of her being a shallow person and retorted that she loved Bill for more than his good looks, even stating that his acquired scars were — to her — proof of her husband's bravery. This genuine demonstration of her valuing true worth over surface glitter was what made those who initially disapproved of her (such as Molly and Ginny) finally begin to accept her.\n", "After being married in the summer of 1997, one could see more of Fleur's positive qualities: true courage and fierce loyalty. She never forgotten that Harry once saved her sister's life. This caused her to volunteer to escort Harry Potter from 4 Privet Drive, risking both her life and that of her fiance's. She also allowed Harry to stay at her home and even honoured his request that the goblin, Griphook, be allowed to stay as well. While she played host to Harry, Hermione, Ron, and the others at her home, Harry noticed she had become a lot more like her mother-in-law, Molly Weasley. She displayed traits such as, worrying and fussing in a maternal fashion over him and his friends.[35]\n"], "quotes": [["\"She's as much a fairy princess as I am.\"", "—Barty Crouch Jr (disguised as Alastor Moody) regarding Fleur's personality[src]\n"]], "figure_captions": []}