{"id": "Fred_Weasley", "name": "Fred Weasley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Fred_Weasley", "personality": ["Fred Weasley was the more outgoing, daring, and sarcastic of the twins. During the rescue from the Dursleys in 1992, George picked the lock on Harry's bedroom door with a hairpin, while Fred insisted Muggle tricks were important to know, even if it was \"a bit slow\"[8], and \"accidentally dropped\" a Ton-Tongue Toffee for Dudley Dursley to find and eat. Fred concocted the scheme of trying to fool Albus Dumbledore's Age Line to get into the Triwizard Tournament, though it was unsuccessful, and was in favour of blackmailing Ludo Bagman after he defaulted on a bet, while George had reservations.[13]\n", "Fred tended to take the ringleader role in their pranks, but was also crueller in his humour or in dealing with those he disliked[17]; for example, he and George had absolutely no compunction in forcing Montague into a Vanishing Cabinet, an act which, according to Malfoy, nearly killed him. However, it is possible that he was unaware that the cabinet was broken and thought Montague would have stumbled out of another cabinet, too confused to remember to dock points from them, as he initially was planning to do. Fred could be quite callous in dealing with the victims of his pranks, particularly his older brother Percy, but was more compassionate when he did not feel that the victim deserved it; he immediately provided Hermione Granger with bruise removal paste after she was accidentally given a black eye by the twins' boxing telescope.[9] Fred was also the first to forgive Percy when he reconciled with the family.[10]\n", "Both he and George were renowned for their senses of humour; they were able to make people laugh and relax even in very trying times. Neither Fred nor George took school very seriously, but they were both very talented wizards, and demonstrated their ingenuity in their inventions and their business sense in running a highly lucrative shop. They were also staunchly loyal to their loved ones and very brave,(as evidenced by their been sorted into Gryffindor) and unafraid to stand up against what they thought was wrong, whether it was Dolores Umbridge's tyranny at Hogwarts or Death Eaters.\n"], "personality_quotes": [["Arthur Weasley: \"That wasn't funny, Fred! What on earth did you give that Muggle boy?\"\n", "Fred: \"I didn't give him anything. I just dropped it... it was his fault he went and ate it, I never told him to.\"\n"]], "figure_captions": ["George and Fred dragging an invisible Harry Potter as he tries to sneak to Hogsmeade"], "quote": ["The thing about growing up with Fred and George, is that you sort of start thinking anything's possible if you've got enough nerve.", "—The twins' audacity and boldness\n", "Harry Potter and the Order of the Phoenix"], "description": "Fred Weasley (1 April, 1978 – 2 May, 1998) was a pure-blood wizard, a son of Arthur Weasley and Molly Weasley (née Prewett), brother to Bill, Charlie, Percy, Ron, and Ginny Weasley, and twin brother to George Weasley. Fred's first few years were marked by the height of the First Wizarding War and when Lord Voldemort fell for the first time. \n"}