{"id": "Gellert_Grindelwald", "name": "Gellert Grindelwald", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Gellert_Grindelwald", "personality": ["Grindelwald was a driven, charismatic, determined and brilliant individual, even in his youth. Albus Dumbledore himself confessed that Grindelwald was extremely charming, so much that it had induced him to fall in love with him, and it was partly the reason Dumbledore had been initially blind to just how dangerous Grindelwald truly was. His attraction to the Dark Arts was not necessarily malevolent in its initial stages[17], but was more of a personal interest that swelled over time in Durmstrang, a school that was rather notorious for its acceptance and study of the Dark Arts. During his formative years, Grindelwald also proved himself highly intelligent, magically talented, idealistic, as well as ambitious to the point of ruthlessness, with a ferocious temper; when Aberforth Dumbledore challenged his and Albus's plans and tried to convince his brother to abandon them, Grindelwald \"lost control\" and used the Cruciatus Curse on Aberforth, showing his willingness to cause pain to people who challenged him.[10] Grindelwald resorted to physically striking Credence Barebone when he grew impatient with the boy, briefly shedding the soft and comforting façade that he adopted earlier. Later on, when Grindelwald duelled Newt Scamander, he swiftly overpowered his opponent but in his rage of Newt's interference, he fiercely unleashed bolts of lightning upon the Magizoologist in order to first incapacitate him in a painful manner. After his skull-hookah was destroyed, Grindelwald's rage prompted him to try to destroy all of Paris. Dumbledore himself expressed horror in what Grindelwald truly was, stating that he had always (unconsciously) sensed something dangerous in him. He was also not above killing Muggle infants, although he seemingly didn't like to do it, such as after arriving in Paris, Grindelwald heard the cries of a Muggle baby, and after a brief moment of consideration, walked out of the room after giving permission for his follower Carrow to murder the baby with the Killing Curse.\n", "As a revolutionary operating outside the law, Gellert Grindelwald grew to become a man who lived in service to his ideals and, as he saw it, in humanity, and was fully convinced that his For the Greater Good revolution to bring wizardkind out of hiding and \"rise up and take [their] rightful place in the world\", above the non-magical population, was truly For the Greater Good, and would bring order, purpose, and direction to the world while providing benefits for mankind in the long run, and tirelessly endeavoured to fulfil this vision. While both willing and capable of achieving his own ends by force, he also knew better than to presume, for all his power, that he could take on the whole world by himself and possibly come out on top. As such, he relied equally much on his outstandingly genius-level intellect and excellent mastery in the use of tactics and strategy.\n", "Aside from his ability to create carefully-woven plans to achieve his goals, Grindelwald was incredibly clever and composed, as well as an extremely persuasive orator; he had a phenomenal command of the art of public speaking, allowing him to mystify and terrify his audiences, allies and enemies alike, inspiring fanatical loyalty with each word, and gaining widespread following for his cause, followers whom he affectionately referred to as his as \"brothers and sisters\" and called \"friends\". When appearing in front of an audience at a rally, Grindelwald was treated as a revered celebrity, as was expected of someone with his charisma. He also recognised that while a brilliant wizard, he was not infallible, and thus Grindelwald openly confided in a carefully selected group of six Acolytes that constituted the innermost circle of the army of Dark witches and wizards that he marshalled to his side. Additionally, while escaping his Incarceration Carriage and killing all of the accompanying Aurors, Grindelwald went out of his way to let Rudolph Spielman live, seemingly in order for the frightened Head of Incarceration to tell the International Confederation of Wizards how great of a threat Grindelwald truly was.\n", "Grindelwald could also work very independently when he had to, however, such as when he seemingly single-handedly infiltrated the MACUSA, and was able to mimic the personality of Percival Graves for an extended period time without arousing suspicion — even when having his followers denounced as fanatics by Newton Scamander, Grindelwald was mostly unfazed and only chuckled the only time he truly aroused anyone's suspicion was when he interrogated Newt Scamander and labelled the hostless Obscurus as \"useless\", which roused Newt to angry disbelief, and appeared to baffle former Auror Tina Goldstein. Thus, Grindelwald either momentarily lapsed in his facade at this point, or incorporated his own ruthlessness and calculative nature into that of Percival Graves, either way, Grindelwald was quick enough to quell Newt's realisation by sentencing both him and Tina to death, before the conversation could go any further. \n", "Grindelwald showed himself to be immensely charismatic — he effortlessly exploited Credence Barebone by appealing to the boy in a way nobody else tried to and offering to accept the boy into his ranks. Even after it became clear that Credence, as an Obscurial, was extremely powerful and phenomenally dangerous, Grindelwald calmly continued to try and exploit him, and was outraged when the MACUSA President opted to have her Aurors seemingly destroy him. Grindelwald was idealistic to an extreme,[18] having absolutely no complaints about the murder of hundreds of innocent people as long as that accomplished his long-term goals. Indeed, Grindelwald's idealism even prompted him to truly break his disguise in New York, expressing his disgust for being forced to hide from Muggles, and then proceeding to attack the MACUSA Aurors who had seemingly killed Credence. Even then, however, his anger was not expressed on his own behalf, but rather on that of the cause he was fighting for, which more or less spurred his life and deeds. Grindelwald spoke scornfully towards President Picquery when she insisted the Obscurial's destruction was on her orders, mocking the fact that history would note this, and that it wasn't right. Grindelwald noticeably paused before engaging the Aurors, indicating that he couldn't see any other way out of it. Throughout all of this, Grindelwald maintained a stern pride in his own skill: even as he was unexpectedly apprehended by the Aurors after Newt Scamander had attacked and subdued him from behind, Grindelwald was unfazed, and simply questioned President Picquery's ability to contain a wizard of his reputation and power. He did not even blink when faced with the President, fixing her with a fierce stare until she was out of his sight, showing his unwillingness to show fear to his enemies.\n", "As shown at his Paris rally, Grindelwald inspired fanatical loyalty in attendees by praising Wizardkind for being \"rare souls\", and only labelled tyrannical Muggles as the true enemy, claiming that what he and his For the Greater Good revolution were actually opposing was the future Second World War that the Muggles would start, and that it was the Aurors, rather than his Acolytes who were the truly violent wizards. Indeed, Grindelwald even persuaded the peaceful, kind, and compassionate Queenie Goldstein to join his cause by promising to abolish such laws as Rappaport's Law, thus promising to bring Queenie and others a newfound freedom to love whomever they please. Grindelwald also showed a great trust in his followers, as seen by his trusting Vinda Rosier and his other Acolytes to \"spread the word\" of his ideology across the Wizarding World. Grindelwald was extremely persuasive even in his time in prison, where he kept convincing his jailers to join his side, forcing the MACUSA to change his guards three times, and to cut out Grindelwald's tongue.\n", "He demonstrated his manipulative skills and the willingness to use them for his own purposes. Judging by Aberforth Dumbledore's testimony, Grindelwald had little interest in, or patience with, those he considered beneath him. He considered Albus Dumbledore an equal, and praised the tremendous potential of the Obscurial Credence Barebone, for instance, but was dismissive of the less talented and intelligent Aberforth, the permanently damaged Ariana, and also, initially, Credence, whom Grindelwald initially callously discarded when he seemingly became no longer useful, mistakenly believing Credence to be a Squib, whom it would be impossible to magically train. In addition, while disguised as Percival Graves, Grindelwald questioned Newt Scamander, who he seemingly found to be an average wizard, in an interrogation as to why Dumbledore would have such faith in Newt, indicating an interest in further understanding both Dumbledore and Newt's abilities. Grindelwald's dismissal of Credence as a Squib suggested that Grindelwald, in his (somewhat arrogant) awareness of his own brilliance, was so secure in his own Seer judgement as to having grown a weakness for jumping to conclusions. Grindelwald was also criticised by Newt for deeming magical creatures too simple to raise his interest, being only turned towards more complex forms of magic, unaware that one such creature, a Niffler, actually stole his Blood pact vial. \n", "However, Grindelwald was ultimately not a totally amoral and cruel man and his capability for evil was considerably lesser than what his successor Lord Voldemort would show, which caused him to be pushed out of the title of the most dangerous dark wizard in history. Grindelwald's decision to stun, not kill Gregorovitch, when he acquired the Elder Wand from the latter, and also not bother finishing off Porpentina Goldstein even though he could have easily did it, hints at a willingness not to kill simply as a matter of course. However, this might have been a calculated decision, perhaps considering that people were more likely to give credence to Gregorovitch's claims that he'd had the Elder Wand if he was murdered, as that was the traditional method of passing it on,[17] while his sparing of Tina was likely because Grindelwald didn't view her worth the time he could instead have used to try to persuade Credence. After all, Grindelwald killed his own pet Chupacabra Antonio after deeming him \"too needy\", he killed numerous Aurors while escaping the MACUSA, he ruthlessly killed many people who did not display enough loyalty to him to enter his circle of blue fire (disintegrating his own inadequately loyal Acolyte Krall, although while he didn't spare Krall, he somberly closed his eyes, indicating some regret and remorse, at seeing Krall painfully die as he tried to reach out to him as he reached out to Grindelwald, in addition to also offering the Aurors who attacked him a chance to join his army rather than just simply immediately massacring all of them and when Leta Lestrange asked him to stop, Grindelwald seemed rather willing to spare Newt and Theseus had Leta joined him, having stopped his attempts to burn them alive and only having the black flames thwart them instead of killing them), and Grindelwald even had no objections to Vinda Rosier and Carrow murdering a family of Non-Magiques, including their infant son, to secure a temporary headquarters for the Acolytes in Paris, although he seemed a bit reluctant in killing the baby and chose not to witness his acolytes kill him.\n", "Nonetheless, Grindelwald's ideology was considerably less extreme than that of Voldemort - while he considered his own wizarding kind superior, Grindelwald's intended new world order only seemed to oppose tyrannical and hateful non-magical individuals, such as the No-Maj Second Salemers, and the Muggle executors of the future atrocities of the Second World War. Whereas Voldemort genuinely desired the destruction of all non-magic individuals, Grindelwald only ever wanted to subjugate them, believing that the beast of burden would always be necessary.  \n", "Proof of his lesser dark nature compared to that of Lord Voldemort, was how that while Voldemort was completely without empathy and unable to feel remorse, Grindelwald seemed to genuinely pity Credence for the greatly unjust treatment he was exposed to not only by his own mother, but also by the magical community, as displayed by his rage of Credence being destroyed by MACUSA. He later expressed sympathy for how Mary Lou Barebone had nearly destroyed her own adopted son. After many years of imprisonment in Nurmengard, as he sat alone in his former fortress, Grindelwald was reportedly known for having contemplated his past misdeeds and felt remorse and shame for the horrifying things he had committed during his attempted rise to power over the magical and non-magical worlds. This clearly influenced his decision to hide the location of the Elder Wand from Voldemort, despite being confronted and certainly about to die at the hands of the only Dark Wizard ever considered possibly more dangerous than himself, which Dumbledore acknowledged to be out of a desire to achieve a shred of redemption. This remorse and redemption is in stark contrast to Voldemort, who showed not an ounce of remorse for the countless atrocities he committed.\n", "Grindelwald is also proven to be capable of fear, judging from the fact that he fled in fear of his life after the intense duel between himself, Dumbledore, and Aberforth that resulted in Ariana's death, and how he resorted to being more cautious around Credence upon realising that he was the Obscurial (in the knowledge of how dangerous and volatile Obscurials were). He never attempted to extend his power to Britain for fear of facing Dumbledore (most likely due to the circumstances of their last encounter, and the fact that he recognised how powerful Dumbledore was, but notably also due to their Blood pact making Grindelwald unable to directly confront Dumbledore. Grindelwald's statements of how he was the only wizard apart from Credence capable of slaying Dumbledore, although Dumbledore had proven to triumph when they actually duelled, it seemed to indicate Grindelwald would have been willing to take on his former friend had the blood pact not prevented it). Not only does this suggest that Grindelwald was actually capable of contemplating Dumbledore being equivalently powerful or dangerous as himself, but that he was also capable of respecting Dumbledore. It would seem that despite Dumbledore being the cause of his downfall, Grindelwald still genuinely considered Dumbledore his friend in the end to an extent, as Harry Potter noted Grindelwald had also intended to prevent Dumbledore's tomb from being desecrated when he lied on the Elder Wand. It should also be noted that despite his claims of wanting to unleash Credence upon Dumbledore, Grindelwald was never known to attack Britain even after he had Credence, as Britain was always acknowledged as the only place safe from Grindelwald, which seemed to imply Grindelwald, even at his worst, did not want Albus dead unless he had interfered in his plans.\n", "When trapped and unarmed in Nurmengard, facing certain death at the hands of Lord Voldemort, Grindelwald was openly defiant and even mocking, goading Voldemort into killing him by saying that he welcomed death, but that it would not \"bring him what [he] seek\" and saying there is so much he \"doesn't understand\". Indeed, he seemed to exhibit a grotesque remnant of the \"merry, wild\" temperament of his youth. Grindelwald's last words consisted of the dressing-down of Voldemort, and a rather enthusiastic outlook on \"the next great adventure\", all of which seems clear in its connection to his old friend, Albus Dumbledore.  \n"], "quotes": [["\"They say he showed remorse in later years, alone in his cell at Nurmengard. I hope that is true. I would like to think that he did feel the horror and shame of what he had done. Perhaps that lie to Voldemort was his attempt to make amends... to prevent Voldemort from taking the Hallow...\"", "—Dumbledore discussing Grindelwald after his death[src]\n"]], "figure_captions": []}