{"id": "George_Weasley", "name": "George Weasley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/George_Weasley", "personality": ["George was the quieter, gentler of the twins,[20] George's sense of humour was not harsh, and he was inclined to make fun of himself on occasion as well — even when he was injured and lost an ear.[11] He also appeared to be slightly more moral, as he was against blackmailing Ludo Bagman when the former Quidditch player defaulted on a bet at the Quidditch World Cup.[17] However, he still displayed a slight vindictive streak when it came to dealing with people he loathed; for example, he and his brother Fred had absolutely no compunction in forcing Graham Montague into a Vanishing Cabinet, an act which nearly killed him, according to Draco Malfoy. When Draco Malfoy insulted his parents and Harry's mother due to his team losing the Quidditch match, both he and Harry gave him a severe beating and was not at all remorseful of doing it.\n", "George's prankster nature is enjoyed by nearly everyone in his family, aside from his brother Percy and his mother, who both consider jokes to be immature and childish. However, his pranks targeted at Percy were usually good-natured, and the only thing that got hurt was Percy's pride. He and Fred particularly enjoyed teasing Percy and their younger brother Ron,[8] while they were especially close to their sister Ginny, who was similar to them in temperament.[14] However, they were protective of their siblings, and eventually extended this familial protectiveness towards Ron's friends Harry Potter and Hermione Granger (who later became their in-laws).\n", "Both he and Fred were renowned for their senses of humour; they were able to make people laugh and relax even in very trying times. Neither George nor Fred took school very seriously, but they were both very talented wizards, and demonstrated their ingenuity in their inventions and their business sense in running a highly lucrative shop. They were also staunchly loyal to their loved ones and very brave, (as evidenced by their been sorted into Gryffindor) and unafraid to stand up against what they thought was wrong, whether it was Dolores Umbridge's tyranny at Hogwarts or Death Eaters.\n"], "personality_quotes": [["George: \"What made you see sense, Perce?\"\n", "Percy Weasley: \"It’s been coming for a while... I managed to make contact with Aberforth and he tipped me off ten minutes ago that Hogwarts was going to make a fight of it, so here I am.\"\n"]], "figure_captions": ["Fred and George's antics before they try to cross the Age Line"], "quote": ["The thing about growing up with Fred and George, is that you sort of start thinking anything's possible if you've got enough nerve.", "—The twins' audacity and boldness\n", "Harry Potter and the Order of the Phoenix"], "description": "George Weasley (b. 1 April, 1978) was an English pure-blood wizard, son of Arthur Weasley and Molly Weasley (née Prewett), brother of Bill, Charlie, Percy, Ron, and Ginny, and twin brother of the late Fred Weasley. George's first few years were marked by the height of the First Wizarding War and Lord Voldemort's first fall. He attended Hogwarts School of Witchcraft and Wizardry from 1989-1996 with Fred, and was Sorted into Gryffindor House. He and Fred were popular students, becoming Beaters for the Gryffindor Quidditch team in their second year, and members of Dumbledore's Army in their unfinished seventh year. \nA born prankster and inventor, George left Hogwarts prior to graduation to become a successful entrepreneur, alongside his twin brother, and opened the joke shop Weasleys' Wizard Wheezes at 93 Diagon Alley. He was a member of the Order of the Phoenix and fought in the Battle of the Seven Potters and the Battle of Hogwarts; in the latter, Fred died, leaving George devastated.\n"}