{"id": "Gilderoy_Lockhart", "name": "Gilderoy Lockhart", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Gilderoy_Lockhart", "personality": ["Gilderoy Lockhart's defining characteristics were his extreme arrogance and exceeding vanity, conceit, egomania, narcissism and self-obsession. He was a voracious self-promoter and claimed to have done many great deeds, though in actuality he was a fraud and merely took credit for other wizards and witches' accomplishments and whose claims about himself were for the most part nothing but conceit, self-praise, and vanity and whose claims about other things were idle speculations, gross exaggerations, and sensationalisations; he went as far as to claim his winning of the Witch Weekly's Most Charming Smile Award five times in a row is more impressive than Harry Potter defeating Lord Voldemort. \n", "He also made outrageous claims and suggestions, whether about other people's professions or in times of danger, in order to make himself look more important and powerful than he truly was. Like Stan Shunpike, Gilderoy tends to come up with made-up concepts on the spot rather frequently just to impress his admirers. Even as a student, he already made far-fetched claims of his goals such as creating a Philosopher's Stone before graduation, intending to captain England's Quidditch team to World Cup glory, before knuckling down to becoming Britain’s youngest Minister for Magic, none of which he accomplished. His attempts to earn himself more fame also led him to attempt spells without fully understanding them (such as removing Harry's bones instead of mending them, and launching a snake into the air instead of making it vanish). It is also speculated that he invented some incantations and names for spells that do not actually exist, such as Peskipiksi Pesternomi, the Transmogrifian Torture, and the Homorphus Charm. Indeed, much of his books contain a large number of invented details to promote his supposed feats.[1] Lockhart was very proud of his books, since his falsely-acquired achievements recorded within were highly popular with its readers, and would always make reference to them whenever giving advice based on his so-called experience.\n", "In addition to his self-promoting nature, he was also highly impractical, to the point of being reckless, in many situations. When the Chamber of Secrets opened, he made many pointless suggestions and false volunteers despite the seriousness of the situation, and his \"morale booster\" outright disturbed classes instead of building up confidence. His school lectures and materials were simply selling his overly expensive autobiographies while reading out chapters from these uninformative books and even theatrically reenacting them, thus lacking any educational purposes. He insisted on mass-producing his own shampoo despite the ingredients being too dangerous and expensive to procure, especially for something as superficial as hair-care. With a little flattering, Hermione Granger was able to get Lockhart to sign a permission form for a book within the library's Restricted Section, to which Lockhart did not even bother to look at the book she wanted, much less question her for reasons for wanting a potentially dangerous document, which other teachers would not be so reckless. Later, being the only teacher to not take the reopening of the Chamber of Secrets seriously, he neglected his duties of leading his students to their next class when Harry and Ron flattered him, as Ron pointed out, in order to fix his hair. Even in his time as a student, his antics of garnering attention caused huge amounts of trouble that earned him scorn and dislike instead of the popularity he desired.\n", "Lockhart's overbearing self-centredness and insensitivity irked most of the people he encountered who were not included among his fans. His unprofessional behaviour earned him the dislike of the Hogwarts faculty, as well as many of the students. However, his arrogance did have limits and he recognised that Albus Dumbledore, his employer and Headmaster of Hogwarts, was a greater wizard than he was, as he never displayed that he believed himself to be above Dumbledore. Also, like many magical folk (human and nonhuman alike) Lockhart feared Voldemort to the point where he couldn't call him by his name. Lockhart was overall considered a joke by Hogwarts, and when he left due to memory loss, the majority (if not the entirety) of the school was elated to see him go.\n", "He also seemed to be completely oblivious to the reactions he elicited from other people or misinterpreted them completely. When Ron looked revolted at his ostentatious peacock quill, Lockhart thought Ron was admiring it. He ignored Harry's many attempts to contradict his theories of enjoying his company and attention, as well as Harry's pleas for Lockhart to leave his broken arm alone, and also completely failed to notice the looks of hatred he received from the rest of the faculty for his ignorance. He asserted that Hogwarts was safe from the monster of Slytherin after Hagrid was arrested, claiming extra security was no longer necessary, and though proven wrong almost immediately, Lockhart stubbornly refused to retract his earlier claims, and continued to complain about how the extra security was tiring him out. His ignorance, arrogance, and self-serving nature ultimately led to his downfall when he attempted to use Ron's damaged wand to perform the complex Memory Charm despite seeing the backfires it has caused over the year (mainly in the Duelling Club), evidently forgetting the dangers of attempting such a feat (or that the wand was even damaged).\n", "When faced with true danger, Gilderoy showed his true nature of a self-serving coward. He attempted to flee from Hogwarts when the other teachers pressured him into entering the Chamber of Secrets after Ginny Weasley's abduction, and claim that his books can be misleading, contradicting his past vain support on them. Even after the location of the Chamber's entrance was discovered, he was willing to leave Ginny Weasley to die, attempting to modify Harry and Ron's memories to cover himself.\n", "Although Lockhart started out as a clever and very skilled student, being sorted into Ravenclaw house, his main flaw was that he would never try in his studies (or anything) unless he was the very best at it, having been spoiled by his mother's overly affection and his own ego. Even in his childhood, he already expected the students and teachers to greet him with admiration and excitement, as he deluded himself into thinking he is a genius above all others of undeserved rights, and was very disappointed and dulled when he was not given any special treatments. He studied not for education, but for attention and awards, and spent much of his time with annoying vanity projects for fame and glory that instead earned him a small notoriety. He was never an unskilled wizard, just a lazy one who increasingly directed his talents to insincere shortcuts and cowardly dodges; his gifts wasted away, as the only spell he focused on was the Memory Charm. His abilities eventually deteriorated nearly beyond the point of recovery, which went past that point when he was struck with his own backfiring Memory Charm.\n", "Despite his ineptitude in most other areas of magic due to long-term neglect and misuse, Lockhart was skilled in Memory Charms, it being the one spell he focused on for his entire life, and was conniving enough to deceive other wizards and witches to thoroughly reveal their work to him before erasing their memories and claim the credits for himself. He also appeared to have been a skilled writer, publishing many books consisting primarily of his embellishments of other people's achievements, taking credit for them as his own. Given his propensity for lying, however, it cannot be said for certain that Lockhart himself actually wrote any of the books, though he did understand that the readers would not be nearly half as interested in his books if they realised his feats were no more than fictionalised plagiarism. He also added many invented details in such feats to promote himself further, distorting facts with fictional concepts.[1] Lockhart's fraudulent lifestyle has proven a certain degree of cunning, resourcefulness and disregard for rules, qualities that fall under the specifics of Slytherin, which he was narrowly able to avoid being sorted into.\n", "In addition to his other flaws, Lockhart may have had a spiteful streak in him. After learning from Hagrid that the Gamekeeper hadn't read any of his books and that Harry Potter was more famous than Lockhart without trying, Lockhart was put out and later insisted that Harry serve detention with him so he could show off his fan mail to Harry and gloat about it. After Hagrid's arrest, Lockhart openly claimed to be certain that Hagrid was truly guilty, but whether this was a real hint of ill will or another sign of Lockhart's ignorance is unknown.\n", "By his own claims (written in his many published works), his favourite colour is lilac, his secret ambitions are to rid the world of evil and to market his own range of hair care potions, and that he desires harmony between magic and non-magic peoples as a birthday present. Given his egotistical and self-serving cowardice attributes, some of these may be fabrications to boost Lockhart's own reputation as opposed to truth. His empty ambitiousness shown since his studentship, such as claiming to create a Philosopher's Stone before graduation, captain the England Quidditch team into championship before knuckling down to become the youngest Minister for Magic yet accomplishing none of which he speak, it is very likely his \"secret ambition\" and \"ideal birthday present\" are just the same meaningless claims to gain attention.\n", "After losing his memory, however, Lockhart became a much more humbler and happier person even if he didn't particularly know it. Upon seeing Harry and Ginny after the spell hit him, he said hello to them very cheerfully and spent most of the time humming to himself absentmindedly. When addressed as Professor, he expressed surprise at the idea and remarked that he must have been hopeless at it without any reluctance at all. Despite forgetting his desire for fame and attention, he continued to enjoy signing autographs and responding to fan letters, a trait that Harry noted has not changed.\n"], "personality_quotes": [["\"Yes, yes, I know what you're thinking! 'He's an internationally famous wizard already!' But when I was twelve, I was just as much of a nobody as you are now. In fact, I'd say I was even more of a nobody! I mean, a few people have heard of you, haven't they? All that business with He-Who-Must-Not-Be-Named! I know, I know — it's not quite as good as winning Witch Weekly's Most-Charming-Smile Award five times in a row, as I have — but it's a start, Harry, it's a start!\"", "—Lockhart displaying his arrogance as he talks to Harry[src]\n"], ["\"Lockhart'll sign anything if it stands still long enough.\"", "—Ron Weasley regarding Lockhart[src]\n"], ["\"My dear boy, do use your common sense! My books wouldn't have sold half as well if people didn't think I did all those things...\"", "—Lockhart's response to Harry Potter that revealed the truth about his fame and glory[src]\n"]], "figure_captions": ["Lockhart's love for vanity", "An autographed photo of Gilderoy"], "quote": ["Celebrity is as celebrity does.", "—Lockhart's dubious advice to Harry Potter\n", "Harry Potter and the Chamber of Secrets"], "description": "Professor Gilderoy Lockhart, O.M. (Third Class), (b. 26 January,[1][2] 1964[3]) was a half-blood wizard, a Ravenclaw student at Hogwarts School of Witchcraft and Wizardry, and later a famous wizarding celebrity who authored many books on dark creatures and his supposed encounters with them.[1]\n"}