{"id": "Ginny_Weasley", "name": "Ginevra Weasley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Ginny_Weasley", "personality": ["Ginny was a forceful, independent girl who often knew her own mind. She had an energetic, lively personality; having feelings for Harry, however, during the first few years of their friendship, she became shy and withdrawn in his presence.[10][14] On the advice of mutual friend Hermione Granger, she overcame it. She relaxed and reasserted her usual self, which was when Harry finally started noticing her.[12][23] One of the traits Harry was attracted to was that Ginny rarely got weepy;[12] this contrasted with Cho Chang, who started to cry all throughout the 1995-1996 school year after her boyfriend was murdered.\n", "Growing up with six older brothers toughened her up. Ginny was not afraid to stand up to anybody, friends and enemies alike. Notably, she stood up to Draco Malfoy on their first meeting in Flourish and Blotts when he insulted Harry in 1992.[10] She even stood up to Hermione, her close friend in defence of Harry's use of the Sectumsempra curse.[23] Also, she could be harsh towards those whom she disliked. For instance, she made fun of Fleur Delacour behind her back when she first became engaged to Bill. Ginny also hexed and crashed into Zacharias Smith when he irritated and insulted her on two separate occasions during her fifth year.[23]\n", "Ginny was popular during their time at Hogwarts, and was fancied by numerous boys. Her brothers: Fred, George, and Ron, often thought that she was too popular for her own good. She was also known to be quick-witted, funny, and could often make others laugh even when they were feeling down.[13][23] Ginny was also good at lying and capable of being opaque when necessary. While staying at 12 Grimmauld Place, she was taught by Nymphadora Tonks how to check if a door had been imperturbed by flicking dungbombs at it and watching them bounce away as if hitting an invisible wall. When asked by her mother who was responsible she blamed it on Crookshanks, even though her hands were filthy at the time.[13]\n", "During the first meeting of what would become the D.A. in the Hog's Head, she coughed exactly like Professor Umbridge, scaring those gathered into believing the real Umbridge had caught them.[13] Her acting talents were put to good use later when Harry and Hermione broke into Umbridge's office, in order to contact Sirius Black through the fireplace. She convinced passing students that the corridor to Umbridge's office had been flooded with garroting gas.[13]\n", "Ginny was also an animal lover, and was known to be fond of cats. When Mrs Norris was petrified in her first year at Hogwarts, her brothers put her shock down to this fact, not knowing that Ginny was scared because she could not remember what she was doing at the time and feared that she was responsible.[10] She named Ron's owl \"Pigwidgeon\",[27] and was known to be able to lure Crookshanks out of hiding to play with her when she wanted.[13] In her fifth year, she finally got her own pet, a purple Pygmy Puff from Weasleys' Wizard Wheezes that she named Arnold.\n", "Ginny was notably difficult to intimidate or frighten, as seen during her moments of standing up to Harry during his moments of rage and anger. This is particularly impressive given that Harry's rages were capable of terrifying even his best friends Ron and Hermione, who were both incredibly courageous individuals. Ginny's courage also enabled her to take part in a three-way duel in the Battle of Hogwarts alongside Luna and Hermione against the powerful and insane Bellatrix Lestrange. \n"], "personality_quotes": [["\"You don't know how weird it is for her to be this shy, she never shuts up normally —\"", "—Ron Weasley regarding his sister's personality[src]\n"], ["Draco Malfoy: \"Bet you loved that, didn't you, Potter? Famous Harry Potter. Can't even go in to a bookshop without making the front page.\"\n", "Ginny: \"Leave him alone, he didn't want all that!\""]], "figure_captions": ["Ginny's shyness around Harry Potter, whom she has feelings for", "Ginny standing up to Draco Malfoy in Harry Potter's defence"], "quote": ["Yeah, size is no guarantee of power. Look at Ginny...", "—Ginny's impressive Bat-Bogey Hex\n", "Harry Potter and the Order of the Phoenix"], "description": "Ginevra[12] Molly[24] \"Ginny\" Potter[25] (née Weasley) (b. 11 August, 1981[1]), occasionally known as Gin[26], was an English pure-blood[3] witch, the youngest of Arthur and Molly Weasley's (née Prewett) seven children, and the first female to be born into the Weasley line for several generations. She and her older brothers grew up in The Burrow on the outskirts of Ottery St Catchpole in Devon.\n"}