{"id": "Hermione_Granger", "name": "Hermione Granger", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Hermione_Granger", "personality": ["Hermione was noted for being both extremely intellectual curious and hard-working, coming out on top in most of her classes and continuously aiding Harry and Ron in their adventures. She was so studious that the school gave her a Time-Turner in her third year, a device that rewinds time so that she could take extra courses.[15] Because of her efficiency and compassion, Hermione often had time to do hobby work on the side, such as preparing a defence for Buckbeak to save him from execution and creating S.P.E.W., an organisation promoting the freedom of house-elves.[24] Such acts demonstrate her social conscience and tenacity.\n", "Unlike most wizards who depended solely on their magical ability, Hermione readily relied on logic, which often helped her to cleverly deduce information that many others missed, such as Remus Lupin's lycanthropy.[15] However, her emphasis on logic made her sceptical about accepting anything without proof, as opposed to Harry who would come to intuitive conclusions, such as completely dismissing the idea of the Deathly Hallows, refusing to believe in them without physical evidence.[7] Hermione's logic has limits, putting her beliefs before all else at the same time in a way that makes her ignore reality when it contradicts what she believes, no matter how strong or overwhelming the evidence is: The example of this is house-elves, insisting that they wanted to be free, have wages and only seemed happy because they were undereducated and brainwashed, even though her friends and the elves themselves told her they were happy and didn't want her help because they don't usually think the way humans do.\n", "Hermione was quite blunt with her opinions, sometimes to the point of being tactless. For example, her attempt to comfort Lavender Brown about the death of her rabbit didn't go over well,[15] and her honesty when dealing with centaurs in 1996 nearly landed her and Harry in serious trouble.[22] Despite this, Hermione was generally sensitive to others' emotions and would lie when she had to, though she wasn't skilled liar.[22] She also gave her friends advice rather often, such as in trying to make Harry understand Cho Chang's behaviour on their date,[22] and in helping Ginny deal with her crush on Harry.[25] These actions once prompted Ron to advise her to write a book to translate all the \"mad things\" girls do so that boys could understand them.[22]\n", "Hermione was quite responsible, perfectionistic, and well put-together. She often attempted to act as the voice of reason among her more impulsive friends, to varying levels of success. These traits led to her being made a prefect during her fifth year. Throughout her entire school career, Hermione was insistent on order and steadfastly devoted to the rules, at the expense of her popularity. Her sense of humour was limited, frequently expressing disapproval over Fred and George's practical jokes and threatened to put them in detention for selling prank items in the common room.  \n", "Hermione was very determined and focused, in that she \"always [kept] her attention focused on the job that must be done.\"[30] Her refusal to break under torture shows her strength of willpower.[7] She wasn't afraid to stand up to her friends when she thought it was in their best interests, or when she felt they were wrong; risking to anger Harry by getting his Firebolt confiscated because she feared it might be jinxed,[15] and arguing with both him and Ginny over his use of the shady Half Blood Prince's textbook.[25] In spite of her strait-laced disposition, she wasn't above using coercion and threats to get what she wanted. This is evidenced by her blackmailing Rita Skeeter into writing a good article about Harry.[23]\n", "Because of her opinionated, interfering nature, Hermione had the reputation for being a bossy know-it-all. Her sometimes abrasive attitude masked deep insecurities and fear of failure, as personified by her Boggart.[31] She felt the need to prove herself, perhaps partly because of how many people in wizarding society looked down on Muggle-borns. However, she didn't let anyone bully her about this and ignored bigots like Draco Malfoy. Despite her growing confidence in her abilities, Hermione wasn't arrogant or conceited, and helped her classmates with their schoolwork whenever she could. In her fifth year, she also became one of the few people to call Voldemort by name.[22]\n", "Though she initially showed a tendency toward mild panic in the sudden situations,[21] Hermione demonstrated her bravery and extreme loyalty to her friends many times when facing danger, risking her life frequently to help them and standing by Harry even when no one else did. Although she wasn't as short-tempered as her friends, Hermione displayed a formidable fury on several occasions, such as slapping Draco Malfoy in defence of Hagrid,[15] sabotaging Cormac McLaggen's tryout as a Keeper for the Gryffindor Quidditch team after he insulted Ron and Ginny, conjuring a flock of canaries to attack Ron in their sixth year[25] and physically attacking him when he briefly abandoned her and Harry during their hunt for Horcruxes.[7] She also tended to be rather argumentative, a trait most evident in her interactions with Ron.\n"], "personality_quotes": [["Horace Slughorn: \"Oho! 'One of my best friends is Muggle-born, and she's the best in our year!' I'm assuming this is the very friend of whom you spoke, Harry?\"\n", "Harry Potter: \"Yes, sir.\"\n"], ["\"That's what Hermione does. When in doubt, go to the library.\"", "—Ron's opinion of Hermione's personality[src]\n"], ["\"Hermione's immense workload finally seemed to be getting to her. Every night, without fail, Hermione was to be seen in a corner of the common room, several tables spread with books, Arithmancy charts, rune dictionaries, diagrams of Muggles lifting heavy objects, and file upon file of extensive notes; she barely spoke to anybody and snapped when she was interrupted.\"", "—Hermione's intense workload starts to weight on her[src]\n"], ["Hermione: \"I'm hunted quite as much as any goblin or elf, Griphook! I'm a Mudblood!\"\n", "Ron Weasley : \"Don't call yourself —\"\n"]], "figure_captions": ["Hermione was known to read for recreation and for fun", "Hermione arguing with Harry Potter over the Half-blood Prince's copy of Advanced Potion-Making", "Hermione urging Harry and Ron to take studying seriously"], "quote": ["Harry Potter: \"But why's she got to go to the library?\"\nRonald Weasley: \"Because that's what Hermione does. When in doubt, go to the library.\"", "―Hermione's book dependency", ""], "description": "Minister Hermione Jean[18] Granger (b. 19 September, 1979[1]) was an English Muggle-born[19] witch born to Mr and Mrs Granger. At the age of eleven she learned that she was a witch, and had been accepted into Hogwarts School of Witchcraft and Wizardry. She began attending Hogwarts in 1991 and was Sorted into Gryffindor House. Hermione possessed a brilliant academic mind and proved to be a gifted student in almost every subject that she studied. \n"}