{"id": "Horace_Slughorn", "name": "Horace Slughorn", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Horace_Slughorn", "personality": ["Horace Slughorn was described as having a bumbling, jovial sort of personality. He was rather vain and quite fond of food, especially crystallised pineapple. Despite being a relatively good-natured person, he only had eyes for people who he thought had talent, would go far in life, and thus give him helpful connections and be able to influence or gain benefits from them. Thus, while he invited other students to his \"Slug Club\", he had a tendency to rudely ignore people like Ronald Weasley because he didn't view them as important, talented, or famous enough to warrant his attention. He also turned to ignoring Marcus Belby after discovering he did not have any attachment to his accomplished uncle, despite inviting him to the Slug Club's reopening.\n", "Slughorn is also a bit of a hypocrite, as he told Harry he believed teachers should not have favourites but then proceeded to say that Harry's mother, Lily Evans, was one of his. Shortly after this encounter, Dumbledore told Harry that in fact, while Slughorn was a teacher, he formed a group of his favourite students with him at the centre in order to forge connections, make introductions, and always reap some sort of benefit from them. In addition, he says he isn't prejudiced against Muggle-born students, but seemed surprised that Harry said Hermione Granger was the best in his year; despite this, he asserts that Lily was one of the most talented students he ever taught, and frequently compares Harry's talent to hers in very favourable terms. It seems Slughorn feels that pure-blood students usually displayed the best talent but was happy to bring Muggle-borns or half-bloods into his inner circle if he thought they were talented or gifted enough.\n", "Compared to Snape, Slughorn's teaching methods were more friendly, excitable, and interactive, not unlike how a good-natured laboratory professor conducts lessons. He also appears to know how to motivate students for his subject; in his first Potions lesson since coming out of retirement, he encouraged his students to concoct for him the Draught of Living Death with a ready bottle of Felix Felicis as reward to the student who does best. He also exhibited no qualms at using his school connections to procure useful assets for his own benefit, as seen when he convinced Pomona Sprout to provide him with plant samples as potion ingredients fresh from the Hogwarts Greenhouses, or when he took advantage of Hagrid's attendant despair to retrieve some of Aragog's prized venom, along with the stocks of unicorn hair Hagrid had inside his cabin. Slughorn's professional relationships with his fellow professors often worked to mutual benefit, often working with his fellow instructors to maximise their benefit to the students, such as ensuring that his students had plenty of spare ingredients from Pomona Sprout's greenhouses while offering his own expertise within her field in exchange for the favour.\n", "Slughorn generally displayed the more positive traits of Slytherin, such as ambition. He never wished to be famous himself; instead, he preferred to help others become famous, which, if successful, gained him influence and/or benefits from them, such as being able to recommend the next junior member of the Goblin Liaison Office, free Quidditch tickets or a box of his favourite crystallised pineapple. By his own admittance, he reveres creatures such as Acromantula, and thought Aragog was a magnificent specimen.[15] Slughorn has evident self-centredness; he mentioned that all the mead he brought is quite safe as he had a house-elf drink some from each bottle to ensure it was not poisoned. This revelation disquieted Harry, as it showed that Slughorn saw nothing wrong with risking a house-elf's life to protect his own. Although, there is the possibility Slughorn possessed an antidote to give the house-elf if poison was present in the drink. The aforementioned possibility is extremely likely due to Slughorn's knowledge of antidotes and generally kind and caring nature, and due to his general determination not to repeat dangerous past mistakes.\n", "Slughorn was keen to make evermore connections, and in his post as teacher, made a habit of having regular meetings with students who were either famous, related to famous people, or talented in one way or another. Known as the \"Slug Club\", this group of students were constantly being invited to Slughorn's office for dinner and parties. Students that he did not consider to be \"high-fliers\", such as Arthur Weasley, and later his son Ron, were simply ignored. However, those with proven negative affiliations, such as Draco Malfoy, due to his father being a Death Eater and imprisoned in Azkaban, weren't invited to the club meetings either. And while he invited Marcus Belby for his affiliation with the famous Damocles, Horace turned to ignoring Belby once discovering that he has no contact with the man.[15]\n", "Slughorn's personality, in many ways, contradicted the \"evil Slytherin\" stereotype held by many students of the other Houses, Gryffindors in particular. He wasn't a bad person, and didn't seem to hold any real prejudice against Muggle-born witches and wizards. While he thought pure-bloods generally had more wizarding talent, he was always happy to meet and teach Muggle-borns and half-bloods who displayed great potential. He was, however, self-serving enough to favour students of status or talent, largely for the purpose of benefiting from his connection to them in the future. He was horribly guilt-ridden about the information he gave to Tom Riddle about Horcruxes, and crudely edited his memory of the event to prevent anyone finding out what he had done, as much as to relieve his own guilty feelings. Though Albus Dumbledore would undoubtedly have tried in earnest to convey the importance of the contents of the original memory, Slughorn stubbornly refused to give it up till 1997. He was also horrified at his accidental poisoning of Ron Weasley and later came to visit him in the hospital.[15]\n", "Despite his ambition, Slughorn knew where to draw his personal boundaries. His tendency to ally himself with powerful, talented, and important people never blinded him to his moral values, and thus, he was never tempted to join forces with Lord Voldemort and his Death Eaters. Unlike Peter Pettigrew, Dolores Umbridge and others who were keen to surround themselves with big people, he was not one to side with whoever was winning. Slughorn knew where his loyalties lay, and he fought against Lord Voldemort head on during the final battle.\n", "During the final battle it was initially thought that Slughorn fled in cowardice with the other Slytherins, but he had actually only left to round up reinforcements and returned to the battle. This, along with the fact that he fearlessly stood up to Voldemort himself, showed that he was a courageous man. While he initially attempted to hide and avoid getting himself into any danger or conflict, he was willing to defend himself and other people when his loyalties were questioned, when backed to a corner and when it was necessary to defend those he cared about. He was also strong willed and was able to master Occlumency, a rare ability that required a strong mind.\n", "Slughorn possessed a great ability to feel shame and regret for his mistakes, many of which he often tried to cover up, hide from, or when it came down to it, fight with all of his magical power. His determination not repeat past mistakes or to lay them to rest is rather evident in his handing Harry the Horcrux memory and his duel with Voldemort. He clearly regards his giving of information about the possibility of multiple Horcruxes to young Tom Riddle to be his greatest mistake.\n", "Slughorn is a rather analytical and calculating individual, able to see great potential in students, but also has his blind spots as well, such his overlooking of Ron Weasley's latent talents and being vulnerable to Tom Riddle's flattery. His analytical abilities and mindset allowed him to deduce Harry's early attempts to coax the Horcrux memory from him. In many ways, not only does Slughorn possess an inordinately strong moral compass, but is also the consummate strategist, such as when he fetched necessary reinforcements from Hogsmeade to aid in the Battle of Hogwarts. This propensity towards strategy and making powerful alliances is compliant with the Slytherin traits of cunning and fraternity, as Slytherins will take calculated risks and always have a backup plan, usually relying on staunch and stalwart allies, something that Slughorn is a certifiable genius at. In a great many ways, Horace Slughorn embodies the best traits that Slytherin House has to offer: camaraderie, strong social intuition, cunning, and strategy.\n"], "personality_quotes": [["\"Harry wasn't sure whether he liked Slughorn or not. He supposed he had been pleasant in his way, but he had also seemed vain and, whatever he said to the contrary, much too surprised that a Muggle-born should make a good witch.\"", "—Harry Potter's feelings about Horace Slughorn[src]\n"], ["\"I have had it all tested for poison. Had a house-elf taste every bottle after what happened to your poor friend, Rupert.\"", "—Slughorn pouring the wine for Harry and Hagrid[src]\n"]], "figure_captions": ["Horace Slughorn talking to Harry Potter, whom he tried to collect", "Horace Slughorn after a first year class"], "quote": ["Horace likes his comfort. He also likes the company of the famous, the successful, and the powerful. He enjoys the feeling that he influences these people. He has never wanted to occupy the throne himself. He prefers the back-seat; there is more room to spread out.", "—Slughorn's preference for \"famous\" friends\n", "Harry Potter and the Half-Blood Prince"], "description": "Professor Horace Eugene Flaccus[11][10] Slughorn (b. 28 April,[1] between 1882 and 1913[2]) was a pure-blood or half-blood[3] wizard. He attended Hogwarts School of Witchcraft and Wizardry as a member of Slytherin before returning in 1931 as Potions Master. He also served as Head of Slytherin House, before retiring in 1981 due to a fear that Albus Dumbledore would discover that he had told Tom Riddle about Horcruxes.\n"}