{"id": "Igor_Karkaroff", "name": "Igor Karkaroff", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Igor_Karkaroff", "personality": ["Karkaroff was a ruthless and immoral man, having been a Death Eater in his youth and a turncoat when it suited him, as well as showing blatant favouritism as a judge of the Triwizard Tournament to increase the chances that his school's champion, Viktor Krum, would win. Karkaroff’s betrayal of his Death Eater comrades to avoid Azkaban, as well as his going into hiding following Lord Voldemort's return, indicate that he was not at all a brave nor loyal man, somewhat similar to Peter Pettigrew, who betrayed the Order of the Phoenix out of fear as well. During his trial, Igor feigned regret and flattery to the judges, showing him to be a talented actor and liar, a skill Sirius Black informed Harry Potter of. Despite his position as headmaster of Durmstrang, he showed neither responsibility nor care for his students, as he encouraged an atmosphere of fear and intimidation at Durmstrang while it was under his stewardship, forcing his students to steer the ship while he stayed in the cabin, harshly scolding Poliakoff in contrast to doting on the famous Krum, and then ultimately abandoned all of them to protect his own life, showing his immense selfishness, egotism and cowardice. \n", "His membership in the Death Eater organisation and implementation — or, at least, continuation — of a policy of refusing to admit Muggle-borns to Durmstrang,[10] indicated that Karkaroff was prejudiced against those of different blood status (though if so he had did not seem to have the level of sadistic, genocidal hatred possessed by other Death Eaters such as Bellatrix Lestrange and Yaxley). Nevertheless, Karkaroff was (at least during his time with the Death Eaters), something of a sadist, as he was noted to have assisted Dolohov in torturing Muggles, and even after he \"reformed\" during his headship of Durmstrang, he encouraged an environment where intimidation and fear rule over the school, leading parents to see him as unprincipled and egotistical. Even his warm greeting to Albus Dumbledore when he came to Hogwarts was less proof of a civil nature, and more proof of his ability to play at civility when it suited him. This is supported by his later yelling at Dumbledore after Harry Potter's name came out of the Goblet of Fire, and even spitting at his feet. \n", "Karkaroff seemed to have been a reasonably skilled wizard, as it is mentioned that it was impressive how he remained hidden from Voldemort for so long after the latter's rebirth, although Voldemort was keeping a low profile during the Ministry's denial, and that Karkaroff's death occurred shortly after the Ministry finally saw and accepted Voldemort's return further enforces this as a reason for his year-long survival. He was able to gain knowledge of a good number of Death Eaters' identities, despite Voldemort's tight secretive operations, including the otherwise undiscovered spy Augustus Rookwood, showing that he is at least skilled in intelligence gathering.\n"], "quotes": [["\"One, too cowardly to return... he will pay...\"", "—Lord Voldemort's low opinion of Igor[src]\n"]], "figure_captions": []}