{"id": "Jacob_Kowalski", "name": "Jacob Kowalski", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Jacob_Kowalski", "personality": ["Jacob was extremely warm, welcoming, compassionate, and friendly, with Newt Scamander noting that people tend to like Jacob, and with Jacob claiming that he wishes to become a baker to make people happy, despising having to work in a canning factory, due to that job being joyless. Hence, Jacob managed to swiftly befriend Queenie Goldstein, the somewhat socially awkward Newt Scamander, the somewhat prim Tina Goldstein, and later even the most famous alchemist in history, Nicolas Flamel. \n", "While initially disturbed by magic, Jacob, unlike most No-Majes, quickly came to admire and love wizardry, and was excited to learn more about the Wizarding World during his adventures with Newt, Tina, and Queenie. Jacob seems to adjust to extreme situations relatively quickly, as he wasn't mentally disturbed after almost getting killed by an Erumpent or contending with an Occamy, and quickly overcame his fear of Nicolas Flamel's gaunt appearance, politely claiming that the ancient alchemist looked young for his age. \n", "Jacob seems to have poor self-esteem, viewing himself as unintelligent, and thinking that there \"are loads [like him],\" but Queenie assures Jacob that he is unique, before their first kiss. Jacob's unique ability to accept other people is a testament to this, as the likes of Henry Shaw Jr were openly hateful of those lesser than themselves, while Jacob was pleasant and friendly to his fellow men. Moreover, Jacob had a good sense of humour, remarking that Gnarlak reminded him of his foreman after punching the goblin in the face. \n", "Jacob is also very selfless, with a strong sense of morality, and an incorruptible spirit, shown when he willingly steps out into the rain for Obliviation, when he refuses to endanger his beloved Queenie by marrying her, and when he isn't swayed by Gellert Grindelwald's visions of a future Second World War (despite being horrified by them, as a veteran of the First World War), and tearfully refuses to join his beloved Queenie among Grindelwald's forces. The incredible bravery and fortitude demonstrated by Jacob in Paris, as well as the loss Jacob suffered, seemingly earned him the admiration and sympathy of Theseus Scamander and Nicolas Flamel, as well as the honour of being the first known No-Maj in history to visit Hogwarts School of Witchcraft and Wizardry.  \n", "While he initially appears timid and shy, Jacob is in fact, exceptionally brave, having served in the First World War, willingly braving many adventures at Newt Scamander's side, and even refusing to join Gellert Grindelwald's forces, despite the fearsome blue fire threat as the alternative. Indeed, had Jacob been a wizard and attended Ilvermorny School of Witchcraft and Wizardry, he would have been sorted into the house Wampus[19].\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Jacob Kowalski: \"Everyone knows Newt only kept me around 'cause... hey, Newt, why did you keep me around?\"\nNewt Scamander: \"Because... I like you. Because you're my friend. And I'll never forget how you helped me, Jacob.\"", "―Jacob and Newt Scamander, in 1926", ""], "description": "Jacob Kowalski (born c. 1900) was a Polish-born[2] American No-Maj, who lived at 435 Rivington Street[5] New York during the 1920s.[6][7] Jacob fought in the First World War.[8] Returning home to the United States he found work in a cannery, but dreamt of becoming a baker.[6][7][4] On 5 December 1926, he went to Steen National Bank to apply for a loan of $2300,[1] but was turned down. \n"}