{"id": "James_Potter", "name": "James Potter", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/James_Potter_I", "personality": ["James was a clever and talented wizard, but very mischievous in his youth. He was arrogant and boastful, and occasionally bullied and jinxed other students just for fun, particularly his long-time rival, Severus Snape. However, even in this stage of arrogance, he still displayed some positive qualities of character. Despite being a pure-blood, he strongly disagreed with the concept of blood purity and was disgusted with any prejudice towards Muggle-borns, and did not hold prejudice towards werewolves (such as Remus Lupin, who was one of his dearest friends). This loyalty would extend to his adulthood when he used his wealth to support the unemployable Remus.[16] Snape would later point out that James was lazy.[27]\n", "James ultimately matured and changed his ways; he lost some of his arrogance and stopped using his magic irresponsibly on others. He became enough of a responsible student and leader to be Head Boy in his final year, and later a member of the original Order of the Phoenix. Though he never completely lost his rebellious side, it was clear James had left Hogwarts a far better person than he had been upon entering it.\n", "His best quality was his willingness to sacrifice himself for his wife and son, as demonstrated when he told Lily to take Harry and run while he held off Voldemort, proving himself to be a true Gryffindor.[16]\n"], "personality_quotes": [["Severus Snape: \"He fancies you, James Potter fancies you! And he’s not... everyone thinks... big Quidditch hero —\"\n", "Lily Evans: \"I know James Potter’s an arrogant toerag. I don’t need you to tell me that.\""]], "figure_captions": [], "quote": ["Lily, take Harry and go! It’s him! Go! Run! I’ll hold him off —", "—James stands between Lord Voldemort and his family\n", "Harry Potter and the Deathly Hallows"], "description": "James Potter (27 March[1], 1960 – 31 October, 1981), also known as Prongs, was a pure-blood[3][4] wizard and the only son of Fleamont and Euphemia Potter.[10] He attended Hogwarts School of Witchcraft and Wizardry from 1971-1978, and was sorted into Gryffindor. When James started at Hogwarts, he met and became best friends with three fellow Gryffindor students: Remus Lupin, Sirius Black, and Peter Pettigrew. He also met Severus Snape, a Slytherin student with whom he became bitter rivals. During his seventh year, James was appointed Head Boy and began dating Lily Evans. \n"}