{"id": "Justin_Finch-Fletchley", "name": "Justin Finch-Fletchley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Justin_Finch-Fletchley", "personality": ["His behaviour was outgoing, talkative, cheerful, and friendly. He seemed a little naive and easily impressed and influenced by others; for instance, he believed all of Gilderoy Lockhart's fabricated tales and admired him greatly. He was also among the first to believe in rumours that Harry Potter was the Heir of Slytherin (even before it became known that Harry was a Parselmouth) and consequently ran away from him in fright.\n", "Justin admitted that he was not particularly brave. The fact that the Sorting Hat put him in Hufflepuff indicated very strongly that he was hard-working, loyal, and just. However, despite his somewhat fearful disposition during his second year, by the time of his fifth year he had seemed to have become significantly braver and more assertive. He showed this by rebelliously decided to join Dumbledore's Army along with friends, in defiance of Dolores Umbridge's tyranny, and he also defended Harry Potter along with his friends from being attacked by Draco Malfoy, Crabbe and Goyle by duelling them, showing his loyalty and strong sense of morality as a Hufflepuff.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["My name was down for Eton, you know. I can't tell you how glad I am I came here instead. Of course, Mother was slightly disappointed, but since I made her read Lockhart's books I think she's begun to see how useful it'll be to have a fully trained wizard in the family....", "—Justin introduces himself to Harry Potter\n", "Harry Potter and the Chamber of Secrets"], "description": "Justin Finch-Fletchley (b. 1979/1980) was a Muggle-born wizard. He was in the same year as the famous Harry Potter at Hogwarts School of Witchcraft and Wizardry and was sorted into Hufflepuff House in 1991. Justin was a member of Dumbledore's Army, an organisation taught and led by Harry Potter and was good friends with housemates Ernie Macmillan and Hannah Abbott.\n"}