{"id": "Kingsley_Shacklebolt", "name": "Kingsley Shacklebolt", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Kingsley_Shacklebolt", "personality": ["Kingsley was calm and controlled, with a deep reassuring voice and commanding stature. Unlike many wizards, Kingsley mastered the knack of dressing and acting like a Muggle, leading to his assignment to guard the Muggle Prime Minister during the Second Wizarding War.[4][6] Kinglsey was known to be level-headed, though his calm demeanour belied his incredible power and quiet fury, as seen after the Battle of the Seven Potters, he displayed his rarely witnessed temper when interrogating Remus Lupin in order to make sure it was him. This impressive example of his control over his very justifiable suspicions and anger were likely exacerbated by Mad Eye Moody's death at Voldemort's hands. This also showed Kingsley's respect of the legendary Auror. \n", "Kingsley was also a good judge of character, and trusted individuals regardless of age, on the basis of his knowledge of their character and abilities. He trusted Fred and George Weasley with the defence of the secret passages during the Battle of Hogwarts,[4] and allowed Harry Potter into the Auror Department at the age of seventeen.[8] When the corrupt Ministry was deeming Harry and Dumbledore as crackpots for claiming Voldemort's return, Kingsley instead sided with the Order of the Phoenix as he could see the sincerity in Harry's and Dumbledore's statements, and even believed that Sirius was innocent, to the point of misleading the hunting squad to a faraway location.[5]\n", "The opposite of the pure-blood advocates, Kingsley believed in equality and fairness for all wizards and Muggles. He was also brave enough to call Voldemort by his name, though this resulted in him getting discovered by a group of Death Eaters.[4]\n", "Although a faithful and devoted individual, Kingsley was not a blindly loyal man, as he acted on his own judgement instead of waiting for orders (contrary to his colleague John Dawlish), and was not afraid to speak his mind. He joined the Order of the Phoenix despite the Ministry's oppression, swiftly acting to modify Marietta Edgecombe's memories in secret simply by looking at the situation at hand, and stood forward to warn Dolores Umbridge not to manhandle students. At the same time, he was skilled in maintaining a facade to the corrupt Ministry to hide his own agenda from them, such as giving the appearance of devoting himself to hunt down Sirius, or speaking rather condescendingly with Arthur Weasley to appear they have no dubious allegations, an act that Arthur returned (though the two would quietly exchange friendly comments in between).[5]\n"], "quotes": [], "figure_captions": []}