{"id": "Lily_Evans", "name": "Lily Evans", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Lily_Evans", "personality": ["Lily was known for being a vivacious, talented, and popular student. She became Head Girl in her final year at Hogwarts. She was also an all-time favourite of her Potions Master Horace Slughorn. Slughorn noted that she was witty and charming, as well as having a knack for potions.[23] Remus Lupin once described her as an uncommonly kind person with a habit of seeing the best in others, even when they could not see it themselves.[24]\n", "Lily was also a woman of sound moral principles, and would stand by them no matter what it cost her: though her actions were ineffective. On at least one occasion she called out James Potter and Sirius Black for their bullying of her friend, Severus Snape. When she realised — through an insult that Snape gave her in a moment of angry humiliation — Snape's devotion to Voldemort's genocidal cause (of which she was a target of at the time) as well as his increasingly deep fascination with the Dark Arts, caused her to refuse his apology for the insult, and ended her friendship with him permanently.\n", "Though she had a sharp tongue and had no problems in standing up to others when she was in a temper, Lily was still the type of person who would give others a second chance when they had proven themselves worthy of it. The most notable instance of this quality would be how she finally agreed to date James after he had matured out of his bullying ways, despite the fact that she did not have a good opinion of him during their early school years.\n", "Lily's and her husband's most celebrated virtues were their courage and capacity for self-sacrifice: defying Voldemort three times as members of the Order of the Phoenix, and even dying to protect their son. It was also noted that Lily was very much like her son, Harry. Lily's strength is commented on by her grandson, Albus, in that she would understand her fate and the fact that she would never see her son grow up.[25]\n"], "personality_quotes": [["\"Lily Evans. One of the brightest I ever taught. Vivacious, you know. Charming girl.\"", "—Horace Slughorn describing Lily's personality[src]\n"]], "figure_captions": [], "quote": ["Your mother was there for me at a time when no one else was. Not only was she a singularly gifted witch, she was also an uncommonly kind woman. She had a way of seeing the beauty in others even, and perhaps most especially, when that person couldn't see it in themselves.", "—Description of Lily's nature\n", "Harry Potter and the Prisoner of Azkaban "], "description": "Lily J.[8] Potter (née Evans) (30 January[1], 1960 – 31 October, 1981) was a Muggle-born[9] witch, the younger daughter of Mr and Mrs Evans, and the younger sister of Petunia Evans. She learned that she was a witch as a child, after Severus Snape (a wizard boy who lived nearby) recognised her as such and told her of the existence of magic. Lily attended Hogwarts School of Witchcraft and Wizardry from 1971-1978. She was Sorted into Gryffindor House and was a member of the Slug Club. In her seventh year Lily was made Head Girl and began dating James Potter.\n"}