{"id": "Lucius_Malfoy", "name": "Lucius Malfoy", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Lucius_Malfoy", "personality": ["Due to being the embodiment of wealth and influence in the wizarding world, Lucius Malfoy took great pride in his aristocratic stature by viewing himself as being biologically superior to Muggles and Muggle-borns, although his views on half-bloods were likely more tempered as many a half-blood appears on the Malfoy family tree.[39] He was also an very shrewd, opportunistic social climber who was good at controlling others, but behind his veneer of respectability, he treated people cruelly. He callously utilised eleven-year old Ginevra Weasley in an attempt to both discredit her father in the Ministry, and remove Albus Dumbledore from his position as Headmaster of Hogwarts. This attempt would have resulted in her death if Harry Potter had not intervened.[40]\n", "Lucius could be intelligent and manipulative when he needed to be. Gaining respect and the good will of high-ranking individuals, through his fortune and family name. He even had influence with Minister for Magic Cornelius Fudge. Lucius' constant donations to important establishments were little more than bribing Fudge for classified information, delaying laws, and receiving undeserved rewards and recognitions.\n", "While putting much effort into maintaining an appearance of respectability, Lucius's slick demeanour did little to hide his self-serving nature. He had no qualms about appealing to whichever side would be more beneficial to his social advancement. He was never unconditionally loyal because he didn't want to be put in a negative light with people on either end. During the Quidditch World Cup, he anonymously participated in the lowly torturing of Muggles but fled when the Dark Mark was cast in the sky. In fact, rather than going to find Lord Voldemort when he lost all his powers in the first place, he instead pretended to have seen the error of his ways and tried to ingratiate himself to the Ministry of Magic. He claimed that he was always alert for Voldemort's return but when Voldemort pointed out that he had fled from the Dark Mark, Lucius was instantly silenced. Despite this he did attempt to go through with Voldemort's plan of using his old school diary to open the Chamber of Secrets, not realising that the diary contained a piece of his master's soul (although Lucius was more focused on ridding himself of an incriminating piece of dark magic when the Ministry was conducting searches).\n", "However, in spite of his ruthless and prejudiced nature, one of Lucius's more redeeming traits was that he was very loving and devoted towards his family, especially caring greatly for his wife and son. He and Narcissa were indulgent and protective of their only child, though Lucius also demonstrated that he had expectations for his son, in one instance berating him for being beaten academically by Hermione Granger. In the end, along with Narcissa, he demonstrated that his family was more important to him than serving Voldemort, especially after Voldemort lost both the respect and trust he once had for the Malfoys. Lucius' love for Draco and Narcissa also allowed him to overcome his more self-serving side as he charged straight into the thick of battle during the siege on Hogwarts in an attempt to find Draco, eventually locating him after Voldemort was finally defeated and the battle came to an end.\n", "Despite his love for his son, Lucius became disappointed in Draco for losing his value in pure-blood supremacy after the Second Wizarding War, and for marrying Astoria Greengrass, who underwent similar changes to Draco's. Father and son had an argument for Draco's willingness to let the Malfoy bloodline end with him to preserve Astoria's frail body, showing Lucius maintains his believe in pure-blood supremacy over the well-being of a human being, and that the mistreatment he received from the Second Wizarding War did little to change his opportunistic and bigoted personality. He even employed Theodore Nott to create a \"true\" Time-Turner, a dangerous device that would give him the potential to go back in time to avert Voldemort's demise. Despite never using it, it shows Lucius remains inclined to the dark side, creating and keeping such a dangerous and illegal device, and passing it to his son.\n"], "personality_quotes": [["\"I don't give a damn what your father thinks. He's vile, and cruel. And you're just pathetic.\"", "—Harry Potter's opinion of Lucius Malfoy[src]\n"]], "figure_captions": ["Lucius talking down to Arthur Weasley regarding his lack of money and status"], "quote": ["Malfoy's been giving generously to all sorts of things for years...  Gets him in with the right people... then he can ask for favours...  delay laws he doesn't want passed... Oh, he's very well connected, Lucius Malfoy....", "—Lucius' former position in the wizarding community\n", "Harry Potter and the Half-Blood Prince"], "description": "Lucius Malfoy (b. 1953/1954) was a pure-blood[3] wizard, and son of Abraxas Malfoy, husband of Narcissa Black, the father of Draco Malfoy and the grandfather of Scorpius Malfoy. Lucius was educated at Hogwarts, where he was made a prefect in Slytherin House. As an adult, Lucius was an aristocratic wizard and patriarch of the Malfoy family, believing strongly in notions of blood purity and the superiority of pure-blood wizards. He joined the Death Eaters, who shared his views on blood purity, and participated in the First Wizarding War.\n"}