{"id": "Luna_Lovegood", "name": "Luna Lovegood", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Luna_Lovegood", "personality": ["Luna was an extremely quirky girl, with a serene disposition and many eccentric beliefs and qualities. She was a complete nonconformist; she lacked self-consciousness and was not afraid to show who she truly was. Luna was also intelligent and unusually perceptive, having been sorted into Ravenclaw[12] \"where those of wit and learning will always find their kind.\"  A prime example of Luna’s perceptiveness was when she pointed out the ironically drastic measures taken against Sirius Black when he escaped Azkaban, but when ten Death Eaters (including Bellatrix Lestrange) escaped, barely any measures were taken to recapture them.\n", "Although many thought Luna was bizarre, Harry Potter, Hermione Granger, Ron Weasley, Neville Longbottom, Ginny Weasley, Dean Thomas and Ollivander eventually became very fond of her.[13]\n", "Luna's demeanour and voice were often distant and dreamy; she would drift away from a conversation she did not find interesting. However, whenever someone made fun of her father or his magazine The Quibbler, the dreamy quality in her voice would vanish and be replaced by one of steel, and she would immediately become very angry. She had an uncanny way of making others uncomfortable by being bluntly honest — Harry Potter described her as having a \"knack for embarrassing honesty\". She was also completely unflappable and rarely seemed anxious or stressed, even under difficult circumstances such as being a prisoner of Malfoy Manor. Luna was very good at comforting others. She comforted Harry after his godfather's death[12] and Mr Ollivander while they were imprisoned together.[14]\n", "Luna was often the subject of ridicule and had difficulty making friends. Other students gave her the nickname of \"Loony Lovegood\" and even stole and hid her things. She was unfazed by this, and instead chose to be nonjudgmental and accepting of those around her.[12] She once said that she did not like dancing much, though she did dance some at the wedding of Bill and Fleur, along with her father. \n", "Luna seemed to have enjoyed artistic pursuits in her free time; her house was filled with various things that she painted.[14] She even painted very life-like portraits of her friends that seemed to breathe. Luna was very loyal to the few friends she had — supporting Harry even when he was outlawed by the Ministry of Magic. Ron stated that she certainly has far more courage than her father, who was at the time stressed when under duress. She also displayed admirable bravery during both the Battle of the Department of Mysteries and the Battle of Hogwarts.\n", "Luna believed in many things that few others do; given her inclination towards superstition, she would have probably liked Divination. However, as she grew older, she came to accept that some things simply do not exist.[15][16]\n", "She seemed to believe everything she read in The Quibbler, mainly because her father wrote it. Some theories she believed in included: Sirius Black being Stubby Boardman, that Rufus Scrimgeour was a vampire, that the Aurors were part of the Rotfang Conspiracy to bring down the Ministry of Magic from within using Dark magic and gum disease, that the Tutshill Tornados were top of the league by a combination of bewitched brooms and torture, that Cornelius Fudge ordered goblins to be made into pies, drowned, or assassinated in other various ways, had an army of Heliopaths, and used the Department of Mysteries to develop terrible poisons to feed to anyone who disagreed with him.\n", "Luna also believed in things that were proven true: Harry's story about Voldemort's return, the voices beyond the veil and the belief that there were people behind it, and that Hufflepuff Chaser Zacharias Smith was suffering from Loser's Lurgy. Loser's Lurgy is not proven to exist, but it is true that when Smith loses in Quidditch he thus acts accordingly.  \n", "Some of the animals she believed in were: Moon Frogs, Blibbering Humdingers, Crumple-Horned Snorkacks, Heliopaths, Umgubular Slashkilters, Nargles, Aquavirius Maggots, Wrackspurts, Gulping Plimpies, and Dabberblimps.\n"], "quotes": [["\"Luna was once again demonstrating her usual knack of speaking of uncomfortable truths; he has never meet anyone quite like her.\"", "—Luna's unusual character traits[src]\n"], ["\"The Aurors are part of the Rotfang Conspiracy, I thought everyone knew that. They're working from within to bring down the Ministry of Magic using a combination of Dark magic and gum disease.\"", "—Luna after Harry Potter discussed his wish to become an Auror[src]\n"]], "figure_captions": ["Luna's unusual appearance", "Luna comforting Harry after the death of his godfather"]}