{"id": "Marge_Dursley", "name": "Marjorie Dursley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Marge_Dursley", "personality": ["Marge was an arrogant, spiteful, ignorant, abusive, selfish, cruel and vicious bully who seemed to brazenly take delight in making the lives of anyone she disliked miserable, given her spiteful, abusive treatment of Harry. In some respects she was even more horrible than her brother; although Vernon was likewise a bully to Harry, at the same time he preferred to avoid spending time with him whenever he could help it, while Marge seemed to want Harry under her watch at all times just so she could belittle him by spewing out suggestions about how he could improve himself. She ate and drank excessively[2] and was, overall, a powerfully dominant woman who made even Vernon look weak and powerless.[2]\n", "Despite her fondness of bullying Harry and deeply unpleasant nature she appeared to be on good terms with her like-minded brother, nephew and sister-in-law, as shown when she assured Petunia that she \"wasn't saying anything against her family\" while calling Lilly a \"bad egg.\". When she visited, she always brought expensive gifts for Dudley (who only put up with her because he was well-paid for it), such as a computerised robot, and less satisfactory \"gifts\" for Harry such as a box of dog biscuits. It was unknown if Marge knew Harry's parents, but she constantly called them gross names (such as \"good-for-nothing scrounger\") and implied their uselessness to society (although, technically, James Potter was unemployed, but only because he was rich enough to not have to work).[2] Marge also had no knowledge of Harry's magical heritage, of which the rest of the Dursleys intended to keep it so.\n", "While she was not a blood relative of Harry's, he was forced to call her \"Aunt\" Marge. She was generally very cruel to him and once allowed Ripper to chase him up a tree and refused to call him off until past midnight. She heavily favoured her nephew Dudley and even went as far as whacking a young Harry in the shins to stop him from beating Dudley at musical statues and also suggested that Harry be put into an orphanage instead of \"being a burden\" on the Dursleys. She finally pushed Harry too far when she insulted his dead parents to his face, showing that she was so unpleasant she could not even show respect for his loss at such a young age, much like her brother.\n", "Much of Marge's reprehensible behaviour, however, was the result of having been shunned by Colonel Fubster, whom she was in love with, though it should be noted, that she was already a horrible enough person for Fubster to not wish to marry her on those grounds.[1]\n"], "personality_quotes": [["\"I won't have this namby-pamby, wishy-washy nonsense about not hitting people who deserve it. A good thrashing is what's needed in ninety-nine cases out of a hundred. Have you been beaten often?\"", "—Aunt Marge antagonising Harry Potter[src]\n"]], "figure_captions": ["Marge, looking down at Harry"], "quote": ["I still don't like your tone, boy. If you can speak of your beatings in that casual way, they clearly aren't hitting you hard enough. Petunia, I'd write to them if I were you. Make it clear that you approve the use of extreme force in this boy's case.", "—Marge's cruelty towards Harry Potter\n", "Harry Potter and the Prisoner of Azkaban"], "description": "Marjorie \"Marge\" Eileen[1] Dursley was Vernon Dursley's elder sister[1], sister-in-law to Petunia Dursley, and the aunt of Dudley Dursley. She had a career in breeding bulldogs. Ripper, a particularly ferocious bulldog, was her favourite.\n"}