{"id": "Marietta_Edgecombe", "name": "Marietta Edgecombe", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Marietta_Edgecombe", "personality": ["When Cho became depressed over Cedric's death, Marietta was presumably comforting and supportive, being the only one to remain with her when the other friends left irresponsibly. Cho claimed Marietta is a lovely person, an attribute that was mostly unseen in her appearances.\n", "However, Marietta is one of the many people who were loyal to the Ministry of Magic and was sceptical of Harry Potter's statement of Lord Voldemort returning. She thought that he and Albus Dumbledore were liars and remained cynical towards him even throughout Dumbledore's Army, and would not be swayed by genuine article within The Quibbler; she only joined because Cho wanted her to. As with the majority of the magical community, Marietta fears hearing the name \"Voldemort\", as she shrieked aloud and slopped Butterbeer down her front.\n", "Marietta's mother was a Ministry employee and as such, Marietta felt strong pressure to be on Dolores Umbridge's good side. Her apparent faithfulness to Cho Chang diminished when Cho forced her to join an illegal organisation, and eventually betrayed Dumbledore's Army and having her fellow classmates (including Cho) who were in the organisation almost expelled from school. Even if it meant that she would forsake a chance to learn more practical defence, especially the Patronus Charm that others were so eager to learn, Marietta chose her family's loyalty first. While Cho insisted that Marietta simply made a mistake, Harry Potter felt that Marietta was disgraceful and an unforgivable traitor, and Hermione commented that she was \"stupid\".[5]\n", "Despite her loyalty to the Ministry, she is still sensitive of her physical appearance, and when her face was horribly disfigured for her betrayal against Dumbledore's Army, she refused to uncover her face to testify verbally, leading to some setbacks for Umbridge and Fudge that ultimately gave Kingsley a chance to modify her memory.\n"], "personality_quotes": [["\"She's a lovely person really. She just made a mistake...\"", "—Cho Chang defending Marietta[src]\n"]], "figure_captions": [], "quote": ["Cho Chang: \"Harry, I never dreamed Marietta would tell... She's a lovely person really. She just made a mistake... You know, her mum works for the Ministry, it's really difficult for her —\"\nHarry Potter: \"Ron's dad works at the Ministry too! And in case you haven't noticed, he hasn't got 'sneak' written across his face!\"", "―Discussion regarding Marietta's betrayal", ""], "description": "Marietta Edgecombe (b. 1978 – 1979) was a witch who was a student at Hogwarts School of Witchcraft and Wizardry, who started between 1990 and 1993. She was Sorted into Ravenclaw House and was the best friend of Cho Chang. In the 1995-1996 school year, at Cho's urging Marietta joined Dumbledore's Army, an organisation taught and led by Harry Potter, despite being reluctant to get on Dolores Umbridge's bad side. \n"}