{"id": "Minerva_McGonagall", "name": "Minerva McGonagall", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Minerva_McGonagall", "personality": ["Minerva almost constantly exuded magnanimity and sternness and was held in great respect (and some fear) by nearly all students and staff. Used to having her way, she tolerated neither audacity nor silliness from her pupils and was known to turn cold towards people who said or did things in front of her that were stupid, or if she thought they were trying to be funny.[14] Despite her stern demeanour, however, Minerva did exhibit a dry sense of humour which usually came out when times were tough. She was also a woman who rarely smiled or gave compliments freely. \n", "True to Gryffindor, she valued bravery and courage highly, believing cowardice be a heavy flaw. Despite her loyalty to her house, though, and a fair-minded person, McGonagall was known for docking points from students in her own House when she saw it must be done so.\n", "Minerva was not afraid to speak her mind and showed quite a sharp tongue, especially during arguments. For the most part, though, she usually maintained great emotional composure, without being indifferent. Although she was not always particularly personable, she was a huge supporter of Harry Potter and trusted the likes of Dumbledore, Sprout, Flitwick, Pomfrey, and Hagrid, and unsurprisingly, had a distaste for Snape. She could be very warm and supportive during times of trouble or loss and cared a great deal about her students, both personally and academically.\n", "Minerva enjoyed needlework, correcting articles in Transfiguration Today, watching Quidditch, and supporting the Montrose Magpies.[1] She has shown a great fondness for tartan patterns and love for cats.\n", "As the devoted instructor of Transfiguration classes, Professor McGonagall highly respected the specific branch of magic, and considered it to be more complex and sophisticated than all others, though she respected most others just as much; she became an Animagus to further her study in the magic. As a law-abiding citizen, Minerva respects the particular law that all animagi of Britain must register, as she insisted that Talbott Winger do so despite understanding his reason of secrecy. On the other hand, she has very little patience with Divination, due to its impreciseness and rarity of true Seers.\n", "As well as this, she has a temper that can reveal itself on occasions when she is angrily flustered[17] All and all, McGonagall earned a great deal of admiration, and not a slight amount of fear, from her peers and students. During the Second Wizarding War, McGonagall fought the Death Eaters and protected her students, proving her bravery.\n", "Minerva, though strict, was known to be extremely caring in times of tragedy, and in her own reserved manner was known for her kindness. Her obvious concern over Harry's future with the Dursley family was evident when she spied on them following Lily and James's deaths. She also promised to Harry in an act of direct defiance against Umbridge that she would make his ambition of becoming an Auror a reality. Although she permitted of-age students to choose whether they want to stay or evacuate for the Battle of Hogwarts as a respect for their valour and rights, she gave the strict orders for anyone underage to evacuate, prioritising their safety over their courage (when she rejected Colin Creevey's request to stay), refusing to let under-qualified children to die in battle despite their desires.\n", "Minerva is also known to have a very severe dislike and hatred of those who abuse power, such as her making an enemy of Dolores Umbridge. Minerva disliked her for many reasons, but most prominently her bigoted and sociopathic behaviour, which displayed Minerva's distaste for racial prejudice and sadism. Similarly, she stood up to Amycus Carrow, despite the Death Eater's higher authority at the time, refusing to let him blame the students for Alecto's blunder, and looked down at him with pure disgust.\n"], "quotes": [], "figure_captions": ["Minerva smiling at the Yule Ball, a rare occurrence"]}