{"id": "Molly_Weasley", "name": "Molly Weasley", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Molly_Weasley", "personality": ["Molly could have even her twin sons cowering before her if she was angry enough. She was fiercely proud of her children's accomplishments, but scandalised by misbehaviour, being particularly frustrated for the twins' antics. She wasn't above of sending a Howler to the school to humiliate one of them publicly for stepping out of line, as evidenced by her reaction to the use of the unauthorised Flying Ford Anglia by Ron to reach Hogwarts at his second school year. Ironically, it was high achiever Percy who caused her the most pain, breaking with the family for their unwavering allegiance to Albus Dumbledore.  \n", "Harry occasionally found Molly's over-protectiveness somewhat smothering. Along with her eldest son Bill, she came to watch Harry in the Triwizard Tournament after his ordeal in the graveyard visit him in Hogwarts' hospital wing, where she hugs him 'how Harry imagined a mother would'. However, Molly sometimes found it difficult to cope with her children heading out in their own, separate directions. Not surprisingly, she considered Fleur Delacour wrong for Bill when they become engaged until the latter showed her true feelings. When Harry asked about what the Order of the Phoenix was doing against Voldemort, she continually insisted he shouldn't be told more than he needed to know under Dumbledore's orders. However, his godfather Sirius believed that he had to dealt with more than the Order could imagine and thus deserved to have the whole picture. Though Harry was touched by Molly's actions, he felt Sirius was right in that he wasn't a small child and should be treated as a maturing adult, something which she understood but still worried about.      \n"], "quotes": [["Hermione Granger: \"If you don't stop, I'm going to —\"\n", "Fred Weasley: \"Put us in detention?\"\n"]], "figure_captions": ["Molly's motherly affection towards Harry Potter"]}