{"id": "Morfin_Gaunt", "name": "Morfin Gaunt", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Morfin_Gaunt", "personality": ["Generations of inbreeding in the Gaunt family caused numerous defects within Morfin, rendering him an overall violent and deranged individual. Morfin shared the same ideology with his father and liked to torture and hex Muggles, without caring about the law, the community, or anyone else, except for his father, whom he respected, because they were both violent and pure-blood supremacists. As Merope was a blood traitor, Morfin was very disrespectful and abusive to her. After her departure from the shack, he brutally insulted her and called her a thief for stealing the locket heirloom. Furthermore, Morfin was sadistic, as he liked to torture snakes, nailing them to the door, despite his ancestor's affinity towards them. At least one snake of his suffered this fate and he threatened a second with it.\n", "The Gaunt residence degraded into further squalor when Morfin lived by himself. Morfin had been dependent on Merope to care for the house, albeit not to the extent his father had been. After his sister's death, Morfin had no choice but to be the new housekeeper, although he did a very poor job at it as his home was filled with clutter, mould, and half-eaten food that he took a long time to motivate himself to dispose of some of the mess. Morfin, being a social outcast from the wizarding world, presumably did not throw many parties at his home nor have many guests, and as such felt little need to keep up appearances. One of his few guests, Tom Riddle, was disgusted by Morfin's slovenly appearance. Riddle had not anticipated meeting a vulgar slob when he met the Gaunt patriarch, his image of the heads of pure-blood families being akin to the likes of their ancestor or Lucius Malfoy. \n", "Ironically, Riddle's framing of his uncle caused the extinction of the pure-blood House of Gaunt. Morfin's subsequent imprisonment ruined any idea of the final patriarch of the Gaunts continuing the bloodline. Admittedly, Morfin would have probably been the last patriarch even if he lived a free man. Morfin's penury, as well as his vulgar attitude, violent disposition and slovenly personal appearance, did not make him a very desirable catch to witches looking for husbands, and Morfin's pure-blood supremacist views limited his own pool of potential mates considerably. \n", "It's also quite possible that it was indeed Riddle's intent to put an end to the House of Gaunt. Disgusted by the vulgar appearence of Morfin Riddle could have been motivated to finish this \"disgrace\" connected with Salazar Slytherin, so that Riddle himself would carry on the Slytherin legacy alone!\n", "Having his memory modified by his nephew, Morfin came to be proud of committing murder and allowed himself to be incarcerated without a struggle as he once had against Ogden. His only regret was the loss of his father's final heirloom, which caused Morfin's leftover sanity to slip away as he would spend the rest of his life muttering how his father would kill him for losing the ring.\n"], "quotes": [], "figure_captions": []}