{"id": "Nagini", "name": "Nagini", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Nagini", "personality": ["Prior to her transformation into a Horcrux, Nagini was a shy, benevolent, quiet, and kind woman, having been abused as a sideshow freak by the Circus Arcanus for so long, that it had left the Maledictus insecure, and longing to escape to something better. She befriended Credence Barebone, likely seeing a fellow outcast in the young Obscurial, and also wanting to no longer be alone in her life. Nagini was also principled and moral enough to recognise Gellert Grindelwald for what he was, despite the Dark Wizard's persuasive charisma and adamantly urged Credence not to join him. Unfortunately, however, Nagini's pleas availed her not, and she was left heartbroken when Credence decided to fall back in with Grindelwald, being too desperate to know his true name and identity. After losing Credence, Nagini seemingly wished to help defeat Grindelwald and end the Global Wizarding War, since she joined forces with Newt Scamander, Theseus Scamander, Tina Goldstein, Jacob Kowalski, Yusuf Kama, Torquil Travers, and Rudolph Spielman, subsequently going to Hogwarts Castle with them all, to meet with Albus Dumbledore.\n", "By the time she had become a Horcrux and, it seemed, permanently stuck in Maledictus serpent form, Nagini's original kind and gentle personality had been entirely expunged - she was now completely loyal to Lord Voldemort. While she remained either aloof or outright malevolent towards most others, she obeyed Voldemort completely, and seemed to enjoy being close to him, as she often slithered up to the Dark Lord's shoulders to receive his affection. Nagini was also shown to be very intelligent, and was able to understand the concept of strategies and plans, as seen when she set up a trap for Harry Potter (which may have been due to her possessing a portion of Voldemort's soul). She was rather cunning and deceptive, and understood how humans behaved (likely owing to Nagini having once been human herself).\n"], "quotes": [], "figure_captions": []}