{"id": "Narcissa_Malfoy", "name": "Narcissa Malfoy", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Narcissa_Malfoy", "personality": ["Narcissa was a very proud woman who frequently displayed a haughty and disdainful attitude, looking down upon others  as she believed strongly in the importance of blood purity and valued her family's wealth. She was prejudiced towards Muggle-borns, other non-pure-bloods such as Fenrir Greyback, and so-called \"blood traitors\". For example, she once rudely exclaimed to the owner of Madam Malkin's that she would rather shop at Twilfitt and Tatting's instead since Madam Malkin's served \"scum\" such as Harry Potter, Hermione Granger, and Ron Weasley.[16] Despite her beliefs and her family's close ties to Lord Voldemort and the Death Eaters, Narcissa never joined the organisation herself, nor received the Dark Mark. \n", "While she treated most people coldly, Narcissa was very loving towards her family as well as devoted to them. She was willing to do whatever it took to keep her son safe when he was put in danger during the Second Wizarding War, from begging Severus Snape to take an Unbreakable Vow to help him[16] to lying to Voldemort himself.[10] She cared deeply about her husband and son and displayed a fierce and protective temper on their behalf, as well as a ruthless determination to keep them safe.[10][16]  Narcissa had a close relationship with her sister Bellatrix despite their differing temperaments and personality traits. Narcissa always despised the Blacks who dared to defy their family's beliefs, such as her sister Andromeda Tonks and cousin Sirius Black,  leading  her to ignore and disown them.\n"], "personality_quotes": [["\"Now that I know the kind of scum that shops here...we'll do better at Twilfitt and Tatting's.\"", "—Narcissa displaying prejudice [src]\n"]], "figure_captions": ["Narcissa on the Black family tree tapestry"], "quote": ["There is nothing I wouldn't do any more!", "—Narcissa after her son is put in danger\n", "Harry Potter and the Half-Blood Prince"], "description": "Narcissa Malfoy (née Black), (b. 1955) was a pure-blood[2] witch, the youngest daughter of Cygnus and Druella Black (née Rosier), younger sister of Bellatrix Lestrange and Andromeda Tonks, wife of Lucius Malfoy, mother of Draco Malfoy and the grandmother of Scorpius Malfoy. \n"}