{"id": "Nearly_Headless_Nick", "name": "Nicholas de Mimsy-Porpington", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Nearly_Headless_Nick", "personality": ["Sir Nicholas is affable, kind, and always willing to lend a hand to Harry Potter and other fellow Gryffindors whenever they need it.[11] Nicholas apparently enjoyed eating during his lifetime, as after his death he spent the feasts at Hogwarts School of Witchcraft and Wizardry looking wistfully at the food.[8] Sir Nicholas was polite and delicate, staying away from potentially indiscreet questions[11] and sensible about the fact that he was no longer living.[8][21]\n", " Nicholas showed interest in the lives of the students at Hogwarts School of Witchcraft and Wizardry and took delight in showing off his wound to the dismay of those around him.[11] He was very proud of his bravery and noble heritage, getting easily offended if anyone referred to him as a coward.[8] He was very sociable, being friends with the Grey Lady[12], Harry Potter[3], and a number of other ghosts who attended his five-hundredth Deathday Party.[3] He also had a cordial relationship with the Bloody Baron[8] and Sir Patrick Delaney-Podmore.[3] He did not enjoy being known as Nearly Headless Nick, he preferred to be addressed by his full name or Sir Nicholas.\n"], "personality_quotes": [["Ronald Weasley: \"I know who you are! My brothers told me about you — you're Nearly Headless Nick!\"\n", "Nicholas de Mimsy-Porpington: \"I would prefer you to call me Sir Nicholas de Mimsy —\"\n"]], "figure_captions": [], "quote": ["I haven't eaten for nearly five hundred years. I don't need to, of course, but one does miss it. I don't think I've introduced myself? Sir Nicholas de Mimsy-Porpington at your service. Resident ghost of Gryffindor Tower.", "—Sir Nicholas greets Gryffindor first years\n", "Harry Potter and the Philosopher's Stone"], "description": "Sir Nicholas de Mimsy-Porpington, known after his death as Nearly Headless Nick, (d. 31 October, 1492) was a wizard who attended Hogwarts School of Witchcraft and Wizardry and was Sorted into Gryffindor House. He was a wizard of the royal court as an adult. He was executed by an improper decapitation, after he had a magical mishap with Lady Grieve, in which he tried to straighten her teeth but it backfired and she grew tusks. Since then, he is the resident ghost of Gryffindor Tower at the Hogwarts Castle.\n"}