{"id": "Neville_Longbottom", "name": "Neville Longbottom", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Neville_Longbottom", "personality": ["When he was younger, Neville was clumsy, forgetful, shy, and many considered him ill-suited for Gryffindor house because he seemed timid. However, Neville proved that the Sorting Hat had seen the bravery beneath his insecurity, as he stood up to his only friends as a first-year[10] and later became one of the D.A.’s most courageous members.[36] Part of Neville’s problem seems to have been poor self-esteem, as he referred to himself as a \"nobody\" and \"almost a Squib\"[21] at times. This was likely caused by his grandmother’s belief that he was not living up to his parents’ accomplishments, and browbeating from fellow students and people like Professor Snape. Though he came from a pure-blood family, he held no prejudice against half-bloods or Muggle-borns.\n", "Neville appeared to suffer from a degree of post-traumatic stress disorder, as the torture of a spider via the cruciatus curse by Barty Crouch Junior in disguise as Alastor Moody was enough to cause him a severe anxiety attack. This was likely due to his own experience with his parents being subjected to the curse's worst possible outcome: the onset of permanent and complete insanity. This familiarity of what the Cruciatus Curse could do in skilled enough hands was more than enough to terrify him.\n", "With the support of his friends, the encouragement of Professor Lupin to face his fears, and the motivation of knowing his parents’ torturers were on the loose, Neville became braver, more self-assured, and dedicated to the fight against Lord Voldemort and his Death Eaters.[39] This was proven by his participation in many battles and his revival of the D.A. in the face of threats and torture at the hands of the Carrows in his seventh year, as well as his defiance of Voldemort himself during the final battle.[47]\n", "Throughout the trials he face over his seven years at Hogwarts, Neville blossomed from a timid, self-deprecating, and generally nervous student into a stalwart soldier possessed of an ironclad will, courage of outstanding merit, and a nobility of spirit, despite still having a comical and shy but at the same time courageous and fierce. In many ways, Neville's transformation allowed him to change from a scaredy-cat into a lordly lion, becoming a ferocious defender of his fellow students during Voldemort's reign. Suffice it to say, Neville's appointment to Gryffindor House was well-deserved.\n"], "quotes": [["Bellatrix Lestrange : \"Let's see how long Longbottom lasts before he cracks like his parents... unless Potter wants to give us the prophecy.\"\n", "Neville: \"DON'D GIB ID DO DEM! DON'D GIB ID DO DEM, HARRY!\""]], "figure_captions": ["Neville and his interest in Herbology"]}