{"id": "Newt_Scamander", "name": "Newton Scamander", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Newt_Scamander", "personality": ["When communicating with other people, Newt was often an extremely awkward man, uncompromising and eccentric in the opinions of his peers. He preferred the company of his magical beasts, whom he expressed terror at the thought of them coming to harm. Unlike his confident older brother who was respected by his superiors, whereas those in the Ministry (except for his brother and Leta Lestrange) didn't hold him in that high a regard. Newt was also uncomfortable with affection between himself and another human, struggling to come up with an explanation for Tina about his \"engagement\" to Leta, and not liking being hugged by his older brother.\n", "That being said, Newt was a deeply compassionate man, speaking reasonably with Credence Barebone despite him being in a volatile and dangerous Obscurus form, and embracing Theseus after a battle with Grindelwald lost them Leta Lestrange, even though Newt was uncomfortable with such doing so in the past. It must be noted that despite clearly being bitter towards Theseus and Leta's engagement, Newt was still willing to not only act cordial, but even be the best man at the wedding, although he clearly showed his bitterness by refusing to interact with them both at once by declining any offers to see them. He even defended Leta when she showed her self-hatred by saying part in Corvus's death was an accident, to which she lamented that Newt 'had never met a monster he couldn't love'. This shows that Newt's capacity for empathy outweighs his social difficulties. Furthermore, Newt developed a strong and consistent friendship with the No-Maj Jacob Kowalski, whom he admitted to really like and to really appreciate for his qualities and his helpfulness during their adventures, and to whom he even went out of his way to anonymously give Occamy eggs so that Jacob could open his own bakery. This cements Newt's lack of typical prejudice against Muggles that was common amongst most wizards when he first went to New York.\n", "A man of principle, Newt was not the sort of man to discriminate against people based on their heritage or beliefs. He was also seen to be courteous with non-magical individuals like Mary Lou Barebone and Jacob Kowalski, the latter of which with whom he formed a close friendship. He expressed disgust at the idea of being one of Gellert Grindelwald's fanatics, going as far as to angrily told off the Dark Wizard, who was disguised as Percival Graves, and questioning him for even suggesting it, and did not remotely believe in wizard supremacy. He was also morally astute, expressing shock and discontent at morbidness and cruelty, such as the idea of using the Obscurus that killed a child for personal gain. Despite this Newt himself admitted that he showed poor judgement in his youth; he was also outspoken in his opinion of Aurors, despite Tina Goldstein herself being an Auror. Another example is when he brought his Thunderbird to the United States to set him free, let alone an entire suitcase full of magical creatures, given MACUSA's curse-to-kill policy at the time on such creatures.[37]\n", "Another possible explanation of his behaviour is that it came from Albus Dumbledore himself, who was a staunch believer in the theory that Newt was actually acutely aware of the price of his actions, yet morally bound to do always the right thing, without any regard for safety, personal gain or even his own well being, with Dumbledore going as far as claiming that he admired Newt for not seeking power for himself. Dumbledore respected and admired Newt enough to speak out fervently against his expulsion from Hogwarts.[32] Indeed, Newt showed that he cared more for what was right than what would benefit himself, as he was not swayed by Gellert Grindelwald on either of their encounters, and strove to defeat the Dark wizard at all costs.\n"], "quotes": [["\"There are no strange creatures, only blinkered people.\"", "—Newt Scamander[src]\n"], ["\"If you'd ever taught him, you'd know that Newt is not a great follower of orders.\"", "—Albus Dumbledore[src]\n"]], "figure_captions": []}