{"id": "Nymphadora_Tonks", "name": "Nymphadora Tonks", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Nymphadora_Tonks", "personality": ["Tonks was enthusiastic, bubbly, and easily able to make friends with people she had just met. She was eager and would often want to help Molly Weasley in the preparation of dinner at Grimmauld Place, something that Molly was not eager about.\n", "As a Metamorphmagus she was known for using her gift for lighter purposes, such as experimenting with her appearance for entertainment. Despite this, Tonks had difficulty controlling her magical abilities when she was unhappy, such as when her love was rejected by Remus Lupin. She was not good at household spells and was also notoriously clumsy. For example, she smashed a plate in the Dursley's kitchen during their rescue of Harry Potter and knocked over an umbrella stand in Grimmauld Place. Despite her young age, Tonks possessed an incredible will. This is evident when she cast a non-verbal Patronus Charm, which requires a powerfully happy memory, despite being highly miserable at the time. \n", "Tonks was not only an excellent witch, but a staunchly loyal supporter of Albus Dumbledore. In her work for the Order of the Phoenix, she was: brave, dependable and selfless. She repeatedly put her life on the line for the sake of following through with Dumbledore's plans.\n", "Tonks rather disliked her given name and considered her mother as a fool for naming her as such. She insisted to be called \"Tonks\" instead. She did not express any rejection when others refer her as \"Dora\", a shortened form of the given name she detested so much. This may haven been because her father, whom she loved called her it.\n"], "quotes": [["\"Last year she had been inquisitive (to the point of being a little annoying at times), she had laughed easily, she had made jokes.\"", "—Tonks' light and curious personality[src]\n"]], "figure_captions": ["A notoriously clumsy Tonks tripping over an umbrella stand"]}