{"id": "Oliver_Wood", "name": "Oliver Wood", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Oliver_Wood", "personality": ["Wood was described as an intensely driven, competitive personality. He was singularly focused and determined to creating the best Quidditch team in the school. His ambition and dedication to the sport was such that he forced his players to train relentlessly, including early morning starts and all-weather training. Wood's obsession with winning occasionally became somewhat maniacal. \n", "In 1992 he told Harry to \"catch the Snitch or die trying\" and in 1993, Fred and George Weasley declared, with only mild exaggeration, that Wood was attempting to drown himself in the showers after a defeat as he refused to come out when they did. They also said in 1996 that \"Wood might have done the Slytherins if he could have,\" after someone asked who would try to kill off a Quidditch team. He regularly scheduled three practise sessions a week, rising to five a week before an important match. His overriding ambition was to win the Quidditch cup before he graduated, a dream which he finally achieved in 1994.[5][9][10]\n", "Despite this, Wood was remarkably humble concerning his own skill, putting the team's success down to the other members of the team. He would often be more concerned about his teammates than himself, like urging them to eat breakfast before a match, yet touching nothing himself. He was also extremely loyal to Gryffindor and saw the success of the Gryffindor team as Gryffindor House's success as a whole. He was also very fair; it was said by others that he didn't accept a replay after Harry fell off his broom against Cedric Diggory in 1993 since he felt that Diggory had caught the Snitch fairly, although it is unknown if this is true. He also assured Harry that he didn't blame him for the loss as he respected that there had to be at least one game where Harry wouldn't win.[5][10]\n", "Although he was fair-minded and approachable, Wood (which is an irony given his position as Captain of his team) appeared to struggle with interpersonal skills, as he often seemed oblivious to the way in which he came across to people. He never seemed to realise that his long-winded pep talks did not engage the rest of the team, and indeed frequently disgruntled them, possibly decreasing their motivation. After Harry's Firebolt was confiscated, Wood protested to Professor McGonagall that he didn't care if it threw Harry off as long as he caught the Snitch on it first, apparently not understanding that this implied that he cared more about winning than about Harry's welfare. Despite this, he generally had a good relationship with the rest of the team.\n", "Aside from his Quidditch skills, Oliver had the trademark courage and bravery of a true Gryffindor as, despite having graduated and having no obligation to do so, Oliver returned to Hogwarts to participate in the battle against Voldemort, and led fellow former Gryffindor Quidditch players Katie Bell, Angelina Johnson, and Alicia Spinnet into the battle with their brooms.\n"], "personality_quotes": [["\"I think we'd better check with Puddlemere United whether Oliver Wood's been killed during a training session, because Angelina seems to be channelling his spirit.\"", "—Oliver's intense and slightly manic personality[src]\n"]], "figure_captions": ["Oliver in his fifth year"], "quote": ["Bad news, Harry. I've just been to see Professor McGonagall about the Firebolt. She — er — got a bit shirty with me. Told me I'd got my priorities wrong. Seemed to think I cared more about winning the Cup than I do about you staying alive. Just because I told her I didn't care if it threw you off, as long as you caught the Snitch on it first. Honestly, the way she was yelling at me... you'd think I'd said something terrible.", "—Wood's intense devotion to Quidditch\n", "Harry Potter and the Prisoner of Azkaban"], "description": "Oliver Wood (born c. 1975 or 1976) was a Scottish wizard who was the Keeper and Captain for the Gryffindor Quidditch team. He attended Hogwarts School of Witchcraft and Wizardry from 1987 to 1994. Oliver was known for his determination and skill on the playing field, and his long lectures before practises. He led the Gryffindor team to victory in the Quidditch Cup in his seventh year.\n"}