{"id": "Ollivander", "name": "Garrick Ollivander", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Ollivander", "personality": ["Ollivander was an intelligent man, with a perfect memory when it came to his work; he remembered the details of every wand he ever sold. He seemed to become happier the more difficult the challenge to find exactly the right wand for a difficult customer was. He used a magical tape measure to help assess customers for their wand.\n", "Ollivander had a professorial enthusiasm for wandlore and was immensely learned in it. A less savoury aspect of his personality was that his fascination with wandlore sometimes eclipsed his sense of right and wrong; he was so fascinated with what a powerful wizard can do when matched with the right wand that he became detached from the good or evil nature of their actions. A prime example of this would be Tom Riddle, who became Lord Voldemort. Even after the First Wizarding War, Ollivander remembered him as having done \"great things\" with his wand — \"terrible, yes, but great\". An even more extreme example was during the Second Wizarding War, when Ollivander, having just been rescued from a year of imprisonment and torture at Voldemort's hands, was briefly enthralled by the thought of what Voldemort might do when matched with the Elder Wand.\n", "However, Ollivander still valued his own life and well-being, and divulged information to Voldemort whenever threatened with death and tortured by the Cruciatus Curse. The wandmaker feared the Dark Lord's wrath and begged for mercy when informed that his (Ollivander's) advice about using another wand was incorrect.\n"], "quotes": [["\"Curious indeed how these things happen. The wand chooses the wizard, remember… I think we must expect great things from you, Mr Potter… After all, He-Who-Must-Not-Be-Named did great things — terrible, yes, but great.\"", "—Ollivander expressing his interest in what powerful wizards can do with wands[src]\n"]], "figure_captions": ["Ollivander and his many wands"]}