{"id": "Olympe_Maxime", "name": "Olympe Maxime", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Olympe_Maxime", "personality": ["Madam Maxime appeared to have a good relationship with her students. She was also shown to have a sense of fair play: she felt it was unjust that Harry Potter had also been chosen for the Triwizard Tournament (which gave Hogwarts two champions), and at first she refused to believe that Harry had not actually put his name in the Goblet of Fire. However, she did not judge Harry unfairly during the Triwizard Tournament's tasks, giving him an 8 out of 10 (though slightly lower than most of the others', it was far fairer than Karkaroff's four). Later on, she willingly gave Harry full marks in the second task for moral fibre, despite Karkaroff only awarding him half marks.\n", "However, Olympe was ashamed of being a half-giant, and claimed that she was simply \"big-boned\". Though Hagrid described her as a fine, well-dressed woman, Maxime did not complain once about having to climb over boulders or sleep in caves during her and Hagrid's mission to visit the giants, which in turn implies that - despite her denial of her heritage - she was still a realistic woman who knew how to accept her circumstances for what they were. She also had a fiery temper and Hagrid had to restrain her from attacking two Death Eaters during the mission, leading him to speculate that this may be due to the French in her.\n"], "personality_quotes": [], "figure_captions": ["Rubeus Hagrid and Olympe"], "quote": ["I 'ave nevair been more insulted in my life! 'Alf-giant? Moi? I 'ave — I 'ave big bones!", "—Olympe Maxime to Rubeus Hagrid after he states that she is half-giant\n", "Harry Potter and the Goblet of Fire"], "description": "Madame Olympe Maxime was a French half-giant witch and was the headmistress of Beauxbatons Academy of Magic. Maxime's preferred mode of transportation was to travel with her students in a powder-blue carriage drawn by twelve winged Abraxan horses, which are bred at Beauxbatons Academy of Magic. Madame Maxime was a half-giantess, although she claims merely to have \"big bones.\" This was a necessity, however, as the approach to giants (or part-giants) is generally hostile in the wizarding world. \n"}