{"id": "Pansy_Parkinson", "name": "Pansy Parkinson", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Pansy_Parkinson", "personality": ["Similarly, she and her fellow Slytherins joined Hufflepuff in supporting Cedric Diggory, whom they considered to be \"the real Hogwarts champion\" for the Triwizard Tournament during the 1994-1995 school year, but this was likely done less out of kindness or respect for Cedric, and more out of a desire to denigrate and antagonise Harry Potter (who Pansy and most Slytherins looked down upon). However, she did later refer to Cedric as \"good-looking\" when she saw his former girlfriend, Cho Chang, with Harry, indicating that she liked his handsomeness if nothing else.\n", "Hermione Granger once described Pansy as \"thicker than a concussed troll\".[5] This may not have been totally inaccurate, as Hermione typically showed respect for genuine talent and skill in people, even if said people had upset her, as Professor Snape did on a few occasions. Therefore, if Hermione had no such praise to give, it indicates that Pansy probably did lack talent or intelligence, though the fact that she was made a prefect and got a high score in at least her Defence Against the Dark Arts OWL should be considered. She most likely lacked common sense and rational thought, as her unwise suggestion of handing over Harry Potter to Voldemort ended up in the whole of Slytherin being punished, meaning she was unable to consider the consequences of her selfish actions.\n", "Judging by the amusement Pansy expressed when Blaise Zabini made a rude comment about Ginny Weasley being a \"filthy blood traitor\",[6] her association with the then-prejudiced Draco Malfoy as well as the stance she expressed just before the Battle of Hogwarts, she was most likely a prejudiced pure-blood herself.\n", "Despite her nastiness, Pansy was ultimately a weak-willed coward, incapable of thinking or acting for herself, and simply followed Draco and his lackeys around out a desire to feel powerful and important. She was terrified of the thought of Voldemort and his Death Eaters attacking Hogwarts, so she decided to foolishly call for Harry Potter to be turned over, showing very poor common sense and fear of facing reality.\n"], "quotes": [["\"Hey, Potter! Potter! The Dementors are coming, Potter! Woooooooo!\"", "—Pansy poking mean-spirited fun at Harry Potter[src]\n"]], "figure_captions": ["Pansy and others mocking Harry Potter about his fear of Dementors"]}