{"id": "Peeves", "name": "Peeves", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Peeves", "personality": ["Peeves was more of a chaotic spirit rather than a physical being, but highly different from the other school ghosts. Peeves was essentially an embodiment of disorder and took great pleasure in constantly causing it. At times, Peeves could be legitimately dangerous. Hogwarts caretaker Argus Filch waged a constant war with Peeves, and year after year requested the poltergeist be thrown out of the school.\n", "Peeves further annoyed and bothered the Hogwarts community by joining in with whatever current gossip was circulating among students. When Harry Potter was suspected of being the \"Heir of Slytherin\" in 1992, Peeves taunted him in the hallways for \"speaking in tongues.\"[6] If students were late to class, he would, among other things, drop wastepaper baskets on their heads, pelt them with chalk, or pull the rugs out from under them. The worst case involved him sneaking up invisible, grabbing the person's nose and screeching \"GOT YOUR CONK!\".\n", "Peeves was shown to be able to create food at will out of thin air. This ability of his was shown when Jacob's sibling was trying to get Peeves to give him the vault portrait. Since this breaks one of Gamp's Laws of Elemental Transfiguration, this might mean that Peeves might have otherworldly powers, as Peeves is the first entity shown to be able to create food at will.\n", "Peeves did not heed commands from Hogwarts prefects or professors, though Headmaster Albus Dumbledore was an exception. The one Hogwarts ghost that struck fear in Peeves, in addition to controlling him, was the Bloody Baron.[5] His fear of the Baron was so well known that in his first year Harry Potter, under his Invisibility Cloak, was able to drive him away by pretending to be the Baron.[14] Although Peeves did not usually heed commands he did recognise authority of a sort.[15] Though generally unimpressed by titles and badges, he is generally amenable to the strictures of the teachers, agreeing to stay out of their classrooms while they teach. He has also been known to show an affinity for rare students (notably Fred and George Weasley).[16]\n", "However, Peeves was loyal and devoted to Hogwarts and proved this twice: first by defying the hated Dolores Umbridge by assaulting her endlessly with trouble, and then in the Battle of Hogwarts where he dropped Snargaluff pods on Death Eaters in mid-air, causing general chaos among their ranks, later showing evident joy when Voldemort was defeated.\n", "Students were known to allow Peeves to take the blame for their own mischief.[8]\n"], "quotes": [["Peeves: \"Why, it's Potty Wee Potter!\"\n", "Harry Potter: \"Get out of it, Peeves.\"\n"]], "figure_captions": ["Peeves"]}