{"id": "Percy_Weasley", "name": "Percy Weasley", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Percy_Weasley", "personality": ["Percy was extremely ambitious and dedicated to his goals, which was apparently to become Minister for Magic, though it is possible that it was just Fred and George joking.[16] A stickler for rules and regulations, he respected authority and, when he attained it himself, expected respect in return. However, Percy usually just seemed affected and self-important since he constantly tried to look and sound dignified, including calling his parents \"Mother\" and \"Father\" rather than \"Mum\" and \"Dad\" like the rest of his siblings.[17] He had a sophisticated way of speaking, thinking it made him sound flamboyant, but he simply came off as pompous and grandiose.\n", "Percy was also highly opinionated, and made loud comments regarding the Sirius Black situation and the measures he would suggest when he made it into the Ministry of Magic.[17] He was also very dismissive of Ludo Bagman's skills in running the Department of Magical Games and Sports when compared to Mr Crouch, but that didn't stop him attempting to make a good impression in front of him when he met him at the Quidditch World Cup.[18]\n", "Percy was extremely pompous, arrogant, and stiff-necked; he took himself very seriously and was often the butt of pranks and jokes played on him by his fun-loving siblings. \n", "However, he showed rare glimmerings of a sense of humour when joking with Penelope Clearwater over sabotaging Harry's broomstick,[18] and when duelling Pius Thicknesse during the Battle of Hogwarts.[21]\n", "Percy could be snobby and bossy at times, as Fred and George have said, but he also cared about his family at the end, although sometimes when it was too late. He was also very pompous and when he wanted to get something, he sometimes only cared about himself rather than his family. He cared immensely about his own self-image and always tried to appear sophisticated, intelligent and upper-class, but only succeeded at becoming narcissistic, coarse and rather insensitive.  \n", "Percy proved himself to be very much of a social climber. He wanted to achieve prominence at the Ministry, choosing to dedicate himself to the institution and abandoning his family when they chose to rebel against the Ministry. He was a sychophant, constantly trying to suck up to Barty Crouch Snr or Fudge, despite the former not knowing his actual name. His love of order and rules, and obedience to authorities blinded him to the truth about Lord Voldemort's return and he felt ashamed after learning the truth and couldn't bring himself to see his family. It even made him miss out on three important events of his family: the joining of the Order of the Phoenix, a visit to his injured father,[19] and his eldest brother's wedding. Despite this, however, Percy is not entirely without reason, as after the Ministry fell and was taken over by the Death Eaters, Percy finally realised his wrongs and admitted to them and apologised sincerely to his family, reconciling with them.[21]\n", "Despite his normal determination to maintain proper behaviour, Percy was an avid fan of Quidditch and could sometimes forget decorum in demonstrating his enthusiasm for it. In the 1993-1994 school year, he made a 10 Galleon bet with Penelope Clearwater that Gryffindor would win the Gryffindor vs. Ravenclaw Quidditch match, despite the fact that he didn't have ten Galleons at the time.[24] Later that year, when Gryffindor won the final match of the season, vs. Slytherin, Percy jumped \"up and down like a maniac, all dignity forgotten.\"[25]\n"], "quotes": [["\"Percy wouldn't recognise a joke if it danced naked in front of him wearing Dobby's tea-cosy.\"", "—Ron Weasley on Percy's lack of humour[src]\n"]], "figure_captions": ["Percy Weasley as a prefect in his sixth year"]}