{"id": "Petunia_Dursley", "name": "Petunia Dursley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Petunia_Dursley", "personality": ["Petunia was a nosy, hostile and repressed woman who, like her husband, was fanatically obsessed with \"appearing normal\". Petunia hated and was very much afraid of magic, and, indeed, anything out of the ordinary. She blindly doted on her son Dudley, but shunned Harry throughout his entire childhood because of his \"peculiarities\". In her spare time, Petunia often spied on her neighbours, and enjoyed gossiping about their often sordid secrets to her husband, and possibly her friends. \n", "Much like the rest of the Dursley family, she was a spiteful bully, who was envious of those who possessed greater talent or ability than herself, particularly against her sister Lily and her nephew Harry. She cruelly mistreated and neglected Harry throughout most of his childhood, often calling him a \"freak\" and never showed any compassion towards him, whilst constantly spoiling and praising her son Dudley. Petunia was shown to be unpleasant and contemptuous even as a child, as she frequently insulted her sister as a \"freak\" due to her magical abilities and her sneering towards a young Severus Snape due to his shabby clothes and lower-class background.   \n", "Petunia was very house proud and was obsessed with keeping it clean, as she constantly kept her house clean and tidy, even to the point of cleaning the kitchen worktop surfaces before bed. She also hated animals: for example, she was disgusted at the sight of Marge's dog Ripper slobbering over her clean kitchen floor. She also appeared to strongly dislike owls, as she became terrified when a large number of owls come to deliver Harry his Hogwarts acceptance letter.\n", "Petunia probably was not particularly intelligent or talented, as she took on a rather uninteresting and grunt type setting course at Grunnings after leaving school, where she first met her husband Vernon. She was also unable to realise her son Dudley's complete lack of positive qualities, and believed him to be a gifted and clever boy (whilst ironically shunning Harry), despite the fact he received abysmal school results. She was also very gullible and deluded to believe Dudley went to a different friend's house for dinner each night as a teenager, when in reality he and his gang were causing trouble in the neighbourhood and bullying younger children. Of course, her doting love for Dudley may have caused her to be in outright denial of his antisocial behaviours, although on one occasion, she did threaten to cut his pocket money should he not stick to his diet, showing she was somewhat capable of disciplining her son should she wanted to. \n", "At the heart of Petunia's character was her secret regret at having not been born a witch like her sister. As a child, Petunia was both frightened of and envious of her sister's astonishing abilities. She also heavily felt that her parent's favoured Lily over her, resulting in feelings of being ignored and unappreciated by them. When Lily was accepted into Hogwarts, Petunia wrote a letter to Professor Dumbledore begging him to take her as well. He rejected her kindly, but when Lily discovered the exchange, Petunia only said that she \"didn't want to go to that 'freak' school anyway\", when in reality she was very upset at realising she had no magical abilities herself. In addition, Petunia was understandably devastated upon learning of her sister's death, and had deep feelings of sadness insider her for never reconciling with her before she died. \n", "Petunia frequently referred to witches and wizards as \"freaks\". However, never did she forget that Harry was her sister's son. She begrudgingly gave him room and board for sixteen years because she knew that her home was the only place that he could be safe from the hands of Voldemort. Although she did feel some compassion and love for her nephew deep down, she was too repressed inside to ever express such emotions and was unable to say anything to him before they all departed from 4 Privet drive in 1997, showing she was never able to let go of her resentment.  \n", "Due to having grown up with wizards, Petunia had a somewhat greater familiarity with magic than Vernon. For example, she surprised her family by revealing that she had known about Azkaban from overhearing discussions between her sister and \"that awful boy\". However, her knowledge was very limited, since Petunia was unfamiliar with many magical subjects such as Quidditch and Transfiguration. Another example of her crude and ignorant comprehension of the wizarding world was her belief that her deplorable mistreatment of her nephew could suppress any \"abnormality\" in his system, while in fact magic is innate and inherited.\n"], "personality_quotes": [["\"That's where you're going! A special school for freaks. You and that Snape boy... weirdos, that's what you two are. It's good that you're being separated from normal people. It's for our safety.\"", "—Petunia confronts her sister before leaving the train station[src]\n"]], "figure_captions": ["A neat and tidy Petunia in her overly decorated living room", "Petunia shocked to see numerous owls delivering Hogwarts acceptance letters for Harry"], "quote": ["Mrs Dursley pretended she didn't have a sister, because her sister and her good-for-nothing husband were as unDursleyish as it was possible to be.", "—Petunia's aversion to anything magical\n", "Harry Potter and the Philosopher's Stone"], "description": "Petunia Dursley (née Evans) (c. 1960 – c. 2020)[1] was a Muggle, the elder daughter of Mr. and Mrs Evans and the sister of the Muggle-born witch Lily. During her childhood, she broke off contact with her sister and refused to have any contact with the wizarding world.\n"}