{"id": "Pius_Thicknesse", "name": "Pius Thicknesse", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Pius_Thicknesse", "personality": ["It is unknown what Thicknesse was like before the Imperius Curse was placed upon him, or after it was removed when Voldemort was defeated. While under the curse however, his air of lofty authority mixed with his appearance made him generally intimidating and a little too happy with the way things were being run at the Ministry under him and the Death Eaters (most prominently Yaxley), casually espousing the view that blood traitors were as bad as Mudbloods to Harry Potter, who was disguised as Albert Runcorn at the time.[6]\n", "It would be unfair to judge Thicknesse solely on his activities during his tenure as Minister for Magic however, as he was being controlled by the Death Eater Yaxley at the time and was not responsible for his actions. However, since the Death Eaters had to resort to the Imperius Curse to get Thicknesse on their side, it is safe to say that he was not a sympathiser of their ideals. As head of the largest Ministry department, one can presume he was a fairly capable wizard and as a law enforcement official. It is implied that he was a strong-willed individual, as he tried very hard to resist the effects of the Imperius Curse.[4]\n"], "personality_quotes": [], "figure_captions": ["Pius Thicknesse's wand"], "quote": ["As your new Minister for Magic, I promise to restore this temple of tolerance to its former glory. Therefore, beginning today, each employee will submit themselves... for evaluation. But know this: you have nothing to fear if you have nothing to hide.", "—Thicknesse regarding the Ministry's new regime\n", "Harry Potter and the Deathly Hallows: Part 1"], "description": "Minister Pius Thicknesse was a British wizard and a Ministry of Magic official in the mid to late 1990s. During the Second Wizarding War, he became Head of the Department of Magical Law Enforcement as well as, later in the War, Minister for Magic under Lord Voldemort's puppet regime while under the Imperius Curse and thus essentially Voldemort's puppet himself. He replaced Rufus Scrimgeour as Minister of Magic, who had been murdered by Voldemort. Thicknesse took part in the final conflict of the War where he fought alongside the Death Eaters, still under the curse.\n"}