{"id": "Porpentina_Goldstein", "name": "Porpentina Goldstein", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Porpentina_Goldstein", "personality": ["Tina had a practical, level-headed personality. She was described as being \"grounded.\"[30] However, in true Thunderbird fashion, Tina was also described as being \"very soulful\" and possessed \"a lot of heart, strengths, and courage.\"[17] She was naturally ambitious, and had a desire to stand up for what was right[9], which was evident in Tina attacking the Second Salemers leader Mary Lou Barebone after the latter brutally punished her adopted son Credence, with Tina later consoling the young man. That incident got Tina a temporary demotion from Auror to Federal Wand Permit Officer, but she would still keep an eye on the Second Salemers, due to her desire for justice. Another example of her sense of justice was when she turned in Newt and Jacob for unleashing the animals in the former's suitcase, considering it the right thing to do. \n", "Tina also has a lot of persistence, demonstrated during the Obscurial attack on New York City and again during her search for Credence, whom she was determined to protect. Her sister Queenie has playfully labelled her as a \"career girl\". She is also shown to be vastly empathetic, as shown by her interactions with Queenie, Newt, Jacob, and Credence. However, she also has a tendency to become bossy and unnecessarily forceful when things go out of her control. \n"], "personality_quotes": [], "figure_captions": [], "quote": ["I know what that woman did to you... I know that you’ve suffered... you need to stop this now... Newt and I will protect you.", "—Tina's sympathy towards Credence Barebone\n", "Fantastic Beasts and Where to Find Them "], "description": "Porpentina Esther[1] \"Tina\" Scamander (née Goldstein[12]) (b. 19 August, 1901[1]) was a half-blood American witch. She attended Ilvermorny School of Witchcraft and Wizardry, where she was sorted into Thunderbird house. After graduating from IIvermorny, she became an Auror for the Magical Congress of the United States of America.[13]\n"}