{"id": "Quirinus_Quirrell", "name": "Quirinus Quirrell", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Quirinus_Quirrell", "personality": ["In his youth, Quirrell was gifted, but emotionally delicate. He became interested in travelling as well as pressing wild flowers, stemming from his early enthusiasm in academia, and continued to do so in his adult years.[1] As a young boy, he was teased and neglected for his timid nature, and came to develop a latent desire for recognition and greatness, cynical feeling for society, and was seduced by the Dark Arts. This led him to foolishly search out for Voldemort's remains in the hopes of fame and knowledge, while exposing his impressionable and naive side to the fallen Dark Lord, no matter how subtle the lure appeared at first. When Quirrell met Voldemort, he arrived at the conclusion that \"there is no good and evil, there is only power, and those too weak to seek it\". Meeting Voldemort made Quirrell admit himself as a \"foolish young man [he] was then\", apparently looking down on his past self, showing his gullibility, and weak will, and was easily corrupted. Quirrell generally did his best to serve Voldemort, though he admitted that his attempts were not always successful, seeing as he was being given rather tall orders. Dumbledore considered Quirrell to be greedy, hateful and ambitious, a reason why Quirrell could not understand the powerful magic of love, which was what heavily injured him during the battle with Harry Potter. Despite Quirrell's continuous descent into corruption, he at least had one piece of redemption of attempting to resist Voldemort's soul of possessing his body, feeble and futile though it may be.\n", "Throughout the school year, Quirrell appeared nervous and timid. He frequently stuttered and was mostly an incompetent teacher. Though his nervousness was probably very real due to the enormous pressure being put upon him by Voldemort, Quirrell had a chillingly sinister side that most people never saw. He was extremely adept at conniving and manipulation; at one point, he disguised himself and tricked Hagrid into revealing crucial information on how to get past one of the obstacles protecting the Philosopher's Stone. Another time he let a fully-grown Mountain Troll into the school on Hallowe'en as a diversion while he headed off to the third-floor corridor and tried to penetrate its defences. He even managed to deceive the great Albus Dumbledore by forging a Ministry letter to him to lure him away from school, although Dumbledore was quick to realise that Quirell had fooled him and returned to Hogwarts.\n", "Presumably because of his constant failures, Quirrell eventually became obsessed with pleasing Voldemort and whenever he looked into the Mirror of Erised he would see himself with the Philosopher's Stone, the object Voldemort desired above all else. Quirrell became very desperate, being willing to slay unicorns in order to drink their blood to keep himself alive, a crime that is noted by Firenze only those who have nothing to lose and everything to gain would commit.\n"], "quotes": [["\"He didn't realise that love as powerful as your mother's for you leaves its own mark... to have been loved so deeply, even though the person who loved us is gone, will give us some protection forever. It is in your very skin. Quirrell, full of hatred, greed, and ambition, sharing his soul with Voldemort, could not touch you for this reason. It was agony to touch a person marked by something so good.\"", "—Albus Dumbledore explains Quirrell's demise[src]\n"]], "figure_captions": []}