{"id": "Regulus_Black", "name": "Regulus Black", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Regulus_Black", "personality": ["Regulus, having been sorted into Slytherin house, was eager to show similarity with his parents, unlike Sirius, who would rather show difference. Regulus' parents had a preference of pure-blooded wizards, so it is assumed that Regulus took after them whilst growing up. Regulus' room was full of Slytherin banners, unlike Sirius, whose room was full of Gryffindor's. Harry at one point compared the sign on Regulus's bedroom door to something that Percy Weasley would write suggesting some similarities in personality, namely haughtiness and pompousness.\n", "Regulus, like his parents, admired Lord Voldemort, and believed that he was a great Dark Wizard. However, after he became a Death Eater, he realised how desperate his master was to reach his goals, showing that Regulus had higher morals in spite of his general beliefs. Regulus later discovered the Dark Lord's creation of (at least one) Horcrux as well as what they meant. Having turned against his master, he decided to destroy the locket while sacrificing himself in the process, which showed both his bravery and selflessness as well. He also commanded Kreacher (his family house-elf) not to tell his family what had happened in order to ensure their safety. This showed how much he cared for Kreacher and his family including Sirius, in spite of their estrangement, while further exemplifying how willing he was to sacrifice himself for people he cared about. Regulus also respected Kreacher as well, and was among those of many who believed that Voldemort would be destroyed by the Chosen One.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["I have stolen the real Horcrux and intend to destroy it as soon as I can. I face death in the hope that when you meet your match, you will be mortal once more...", "—Regulus' parting letter to Voldemort\n", "Harry Potter and the Deathly Hallows"], "description": "Regulus Arcturus[6] Black (1961 – 1979[1]) was a pure-blood wizard, born to Orion and Walburga Black, and the younger brother of Sirius Black. He was a member of the House of Black, an old wizarding family, which probably started around the Middle Ages.\nHe attended Hogwarts School of Witchcraft and Wizardry in 1972 and was sorted into the Slytherin house. Regulus became a Death Eater in his youth, but defected when he found what Lord Voldemort would do in order to reach his aims. Regulus also learned about one of Voldemort's Horcruxes and decided to destroy it. He was killed after acquiring Salazar Slytherin's locket in 1979.\n"}