{"id": "Remus_Lupin", "name": "Remus Lupin", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Remus_Lupin", "personality": ["Remus was compassionate, intelligent, tolerant, levelheaded, peaceful, selfless, brave, kind, and good-natured. Despite having suffered a great deal of prejudice in his life due to his lycanthropy, he managed to retain an ability to see the good in almost everybody and was extremely forgiving. Remus also had an excellent sense of humour. When he was a student at school he was also part of the Marauders.[9] However, unlike his friends, he never partook in bullying. He hence could be described as the most mature and responsible one of the group. He even became a prefect in his fifth year.[11] Also he was able to, or at least would try to maintain civil conversation with those he did not get along well with.\n", "Remus was unusually perceptive, with an uncanny ability to guess the thoughts of those around him. This is especially clear in his conversations with Harry Potter, such as his intuiting that Harry was afraid that he thought he couldn't handle working with the boggart. He was a gifted teacher, with a rare flair for his subject and a profound understanding of his pupils. He was, as ever, drawn to the underdog, and Neville Longbottom especially benefited from his wisdom and encouragement. His perceptive nature is a rather ironic trait, given that wolves are rather intuitive and astute judges of character and communicate primarily through body language, a skill that Remus was extremely developed and talented at.\n", "True to being a Gryffindor, Lupin was quite courageous. Nonetheless, he suffered deep-seated feelings of shame and fear of rejection which, in certain situations, led him to consider backing down. His greatest weakness was that, in his desperate longing to belong and be liked, he was neither as brave or honest as he should have been at times. Remus once claimed that he was cowardly, because he was unable to bring himself to tell Dumbledore that James Potter, Sirius Black, and Peter Pettigrew were Animagi, as it would have meant that he had betrayed Dumbledore's trust, which meant everything to him. His love for James and Sirius also led him to not do anything to stop their bullying other students, a most notable example being when Snape was constantly bullied by his friends, but Remus was terrified of losing them and therefore did nothing to stop the bullying, something that he later admits to regret. Perhaps the most critical example of this was his temptation to join Harry, Ron Weasley, and Hermione Granger on Dumbledore's mission and abandon his wife and unborn son because he was afraid that her family would be ashamed of him being a werewolf. However, ultimately he came to his senses.\n", "He also has been noted to dislike the form of his Patronus as it takes the shape of a wolf. Lupin was disgusted by all things wolfish as they reminded him of his condition, and due to this has been known to deliberately cast a non-corporeal Patronus, particularly when in the company of others, for fear it would give him away as a werewolf. The irony of this is that his desires to belong and be liked are that wolves are social animals, and often act in the interests of their pack, much like Remus' self-sacrificing nature, making him rather wolf-like even in his human form. In many ways, he represents the best parts of wolves, including his intelligence, adaptability, nurturing instincts, and his fierce desire to protect his loved ones.\n", "His Boggart is a full moon, reflecting on his terror of transforming near humans. It also shows his hatred of his condition.\n", "Remus' nurturing instincts were incredibly wolfish. Due to his position being that of a moderator, teacher, and nurturer, Remus fits the wolf pack position of the \"nanny\" or sergeant, looking after and teaching younger wolves - in this case his students and younger Order members - and keeping his friends in line, albeit with limited success at times.\n", "In contrast to Sirius' more competitive and combative nature, Remus was far more peaceful, reserved, and prone to negotiation despite his nature as a werewolf. This is symbolic of how dogs often tend to fight for dominance versus the more pragmatic and somewhat democratic nature of wolves in a pack who organise themselves peacefully unless threatened. However, Remus was by no means weak and marched into battle against Voldemort's soldiers like a true warrior. Remus referred to Voldemort by name, unafraid of the Dark Lord or his loyal Death Eaters.\n", "After losing James, Sirius and Lily and all hope of reconciliation with Pettigrew gone, Remus had every reason to succumb to depression and despondency. However, he retained his appreciation for the good people existing in his life and continued to draw strength from them. \n", "Lupin also must be likely sceptical about Divination, as Professor Trelawney stated the him positively fled when she offered to crystal gaze him[17] (on another hand he could be merely afraid of what kind of things she could see, as his lycanthropy). \n"], "personality_quotes": [["Sirius Black: \"Did you like question ten, Moony?\"\n", "Remus: \"Loved it, name five signs that identify the werewolf. Excellent question.\"\n"]], "figure_captions": ["Remus demostrating his flair for the subject he teaches by adding the element of music to a lesson"], "quote": ["It is the quality of one's convictions that determines success, not the number of followers.", "—Remus regarding the importance of belief\n", "Harry Potter and the Deathly Hallows: Part 2"], "description": "Professor Remus John[3] Lupin, O.M. (First Class), (10 March, 1960 – 2 May, 1998), also known as Moony, was a half-blood wizard and the only son of Lyall and Hope Lupin (née Howell). He was afflicted with lycanthropy during his childhood, as a result of Fenrir Greyback's revenge against Lyall. He attended Hogwarts School of Witchcraft and Wizardry from 1971-1978 and was Sorted into Gryffindor House. During his school years he was one of the Marauders, best friends with Sirius Black, James Potter, and Peter Pettigrew. Together they created the Marauder's Map.\n"}