{"id": "Rita_Skeeter", "name": "Rita Skeeter", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Rita_Skeeter", "personality": ["Rita was an unregistered Animagus, wherein she took the form of a beetle and was able to slip around undetected and spy on unsuspecting company so she could obtain gossip for her articles which she later exaggerated and exploited to gain the attention of the masses. Her ability to turn into a beetle also reflected how irritating and bothersome she was to other people, particularly Harry Potter and Albus Dumbledore, and it also displayed her dishonest and cunning characteristics. Rita also wrote primarily for the Daily Prophet, though some of her articles have also appeared in other sources, such as Witch Weekly and The Quibbler. Skeeter worked closely alongside Bozo, her photographer.[1]\n", "Rita was extremely nosy and willing to do anything for a good story — from spying on people in her Animagus form of a beetle to sensationalising or outright inventing stories. She also took advantage of elderly Bathilda Bagshot's possibly fragile state of mind (even giving her Veritaserum)[21] in order to dig up dirt on the late Albus Dumbledore for her extremely critical biography. She did this despite the use of such a powerful truth serum being heavily controlled by the Ministry. Rita tended to portray the people she wrote about poorly, presumably because it sold more stories.\n", "However, she could also be very vindictive and spiteful towards those she disliked. For example, after Hermione Granger insulted her, Rita printed a completely false story about Hermione using love potions and toying with the hearts of both Harry Potter and Viktor Krum. This resulted in Hermione receiving hate mail, but she eventually got her revenge and blackmailed Rita into refraining from writing for a year. After this time period was up, Rita returned to her writing with as much gusto and as little scruples as before.\n", "Despite her inaccuracies and biassed articles, Rita seemed to be a fast writer and researcher, as she managed to finish a nine-hundred-page book in four weeks.\n", "Rita seemed to have a somewhat low opinion of the intelligence of her average reader, based on her style of reporting. In a previous article she once referred to Hermione Granger as being \"stunningly pretty,\" only to then describe her in an article published just a few months later as \"a plain, but ambitious girl.\" She also stated regarding the Daily Prophet that it \"exists to sell itself.\"\n", "While she had a huge disregard for her interviewee's reputations and journalistic integrity, Rita deeply feared her own status as an unregistered animagus being revealed to the world. She gave up a year's worth of article writing when blackmailed by Hermione Granger (her main means of making a living) as she knew the alternate consequences would be a sentence in Azkaban. However, while Hermione thought this one year of abstinence would curb Skeeter's ill-habit of writing hurtful articles, she was wrong, as once the deal has reached its end, she swiftly and shamelessly returned to her old ways of writing sensationalist and dishonest journalism.\n"], "quotes": [["\"Rita Skeeter goes out of her way to cause trouble, Amos! I would have thought you'd know that, working at the Ministry!\"", "—Molly Weasley remarking on Rita's tendency to exaggerate[src]\n"], ["\"You don't want to go upsetting Rita Skeeter. I'm serious, Hermione, she'll dig up something on you —\"", "—Rita and her tendency for revenge[src]\n"]], "figure_captions": []}