{"id": "Ron_Weasley", "name": "Ronald Weasley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Ron_Weasley", "personality": ["Ron was a very loyal, brave, strong and funny person, but sometimes immature, and insensitive.[43] He had a sardonic, wisecracking sense of humour that often brought his friends laughter and relaxation. However, as Hermione Granger and Luna Lovegood pointed out, his humour could occasionally be hurtful, even if unintentionally.[34] During his time searching for Voldemort's Horcruxes with Harry and Hermione, Ron matured greatly, and even took to leading the trio when Harry temporarily fell into a depressive mood.[35]\n", "Though his loyalty and bravery never faltered Ron's character was also marked by occasional jealousy and insecurity rising from feeling overshadowed by his five older brothers and his parents' constant comparisons between him and their other children. He could be argumentative, a trait particularly displayed in his bickering with the equally argumentative and occasionally highly critical Hermione. Though their bickering was frequent, it was never malicious (with the brief exception of sixth year) and generally a way to hide their deeper feelings for each other. Inheriting the Weasley trait of a strong temper Ron was not above provocation especially when dealing with the spiteful treatment of Professor Snape and the bigotry and hatred of Draco Malfoy. Always willing to stand up for his friends and family even when angry with them, Ron never stopped standing up for Hermione when she faced Muggle-born related prejudice and hatred. He also stood by Harry's side when he was met with disbelief and scorn from his classmates and Wizard society in general. Ron frequently demonstrated great bravery in attempting to protect those he loved, from facing his arachnophobia to stand by Harry in his second year[29] to trying to take Hermione's place when Bellatrix Lestrange isolated her for interrogation with the Cruciatus Curse.[35]\n", "As a boy, Ron was very sensitive about his family's poverty, and sometimes embarrassed by them. Many, if not all, of Ron's possessions were hand-me-downs, including his robes, school books, wand, and even a pet rat whom he called Scabbers. His family's lack of finances often made Ron a target for taunting by Draco Malfoy, a spoiled, arrogant Slytherin.[27] Ron was also prone to insecurity about his abilities, when compared to his older siblings and to his famous best friend. When he felt insecure or embarrassed, it was noted that his ears turned red. This became his tell-tale sign of his anger and embarrassment.[28] He felt as if he was consistently overshadowed by the legacy of his older brothers and the fame of Harry; this lead to a feeling of being \"second-best\".\n", "Although passionate about Quidditch, especially the Chudley Cannons, and a fine flyer, Ron had a problem with nerves, and sometimes his playing ability suffered for it.[44] Salazar Slytherin's Locket revealed that Ron's deepest fears were that his mother loved him least and that Hermione preferred Harry to him.[35] He also suffered from arachnophobia, a fear originating from his brother Fred transfiguring his teddy bear into a spider when Ron was a child.[29]\n", "Ron's point of view on many topics was often that of the stereotypical wizard, which clashed many times with those of Harry and Hermione because they were both raised by Muggles; but in exchange, he was typically more aware of standard factors abided by wizardkind. Examples of this are that while he liked Lupin the entire third year, the moment he discovered that Lupin was a werewolf he exclaimed \"Get away from me, werewolf!\"; that he was more shocked and disgusted than Harry and Hermione at discovering that Hagrid was half giant; and when he got into an argument with Griphook over wizards not giving goblins wands. However, he was clearly very much appreciative of Dobby's sacrifice for them, as he helped Harry dig the grave, found it difficult to say stuff at the grave (it is mentioned it \"came out thickly\", implying he was choked up), and he had sat on a rock and stripped off his shoes and socks, giving them to Dobby to be buried in.\n", "Ron was particularly fond of food. He had a tendency to talk with his mouth full, often to Hermione's disgust, and a great fondness for bacon sandwiches, though he disliked corned beef sandwiches, as mentioned in his first year; his love of food eventually made him settle into a portly middle age. And like Harry, Ron was intelligent, but lacked the motivation to put forth effort in class due to incredible laziness; during their years at school, Ron frequently expected Hermione's help, and when she either refused or was unavailable, he was often dumbfounded about how to proceed. If not for Hermione's help, he would have undoubtedly failed his exams.\n", "Ron was also shown to have a habit of swearing. In 1993, he called Professor Snape something that caused Hermione to exclaim: \"Ron!\". Also, after Draco Malfoy insulted him, Ron told him to do something he would never have dared say in front of Mrs Weasley. He also called Draco Malfoy a \"two face-bastard\" during the Battle of Hogwarts after saving him from a Death Eater, and rescuing him for a second time, from death.\n", "Ron was brave, to a level which would put him on a par with his best friend Harry; he never hesitated to put himself into extremely dangerous situations with his best friends Harry and Hermione, and as shown many times, he would rather die than have someone else he cared about be harmed. He risked his life on many occasions, and his bravery was not unnoticed by his friends.\n", "Ron was also a person who liked to do things the easy way, as he did not like to work hard. This quality was reflected in his first year when he just picked up books from the Hogwarts Library shelves randomly when finding out about Nicolas Flamel. He also had a tendency to make up predictions for his Divination homework, and frequently copied most of his homework from Hermione Granger. However, he could afford to let go of this tendency of his during tougher times, like when he researched information to help Hagrid in letting off Buckbeak in his third year. His peculiar trait did not seem to vanish, even after he grew up, as he confunded his driving examiner (breaking the International Statute of Secrecy which is considered illegal) and shrugged off his guilt by saying \"I could always use a Supersensory Charm for that\".\n", "Ron was very protective of those he cared about, and this was shown perhaps, best of all, when Ginny was involved in a relationship with Dean Thomas. He was, of course, looking out for her, but his temper got the best of him and he lashed out at her, as she did the same to him.\n"], "personality_quotes": [["\"\"...Ron's got all those brothers to compete against at home and you're his best friend, and you're really famous --he's always shunted to one side whenever people see you, and he puts up with you and he never mentions it...\"\"", "—Description of Ron's loyalty, despite his insecurities.[src]\n"], ["Ron: \"What are you doing? Are you staying, or what?\"\n", "Hermione Granger: \"I... Yes — yes, I'm staying. Ron, we said we'd go with Harry, we said we'd help —\"\n"]], "figure_captions": ["Ron playing Quidditch as Keeper", "Ron showing his fondness for food as he enthusiastically eats chicken legs"], "quote": ["I'm the sixth in our family to go to Hogwarts. You could say I got a lot to live up to. Bill and Charlie have already left — Bill was Head Boy and Charlie was captain of Quidditch. Now Percy's a prefect. Fred and George mess around a lot, but they still get really good marks and everyone thinks they're really funny. Everyone expects me to do as well as the others, but if I do, it's no big deal, because they did it first.", "—Ron's family and other's expectations\n", "Harry Potter and the Philosopher's Stone"], "description": "Ronald Bilius[24] \"Ron\" Weasley (b. 1 March, 1980) was a pure-blood[2] wizard, the sixth and youngest son of Arthur and Molly Weasley (née Prewett). He was also the younger brother of Bill, Charlie, Percy, Fred, George, and the elder brother of Ginny. Ron and his brothers and sister lived at the Burrow, on the outskirts of Ottery St Catchpole. \n"}