{"id": "Rubeus_Hagrid", "name": "Rubeus Hagrid", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Rubeus_Hagrid", "personality": ["Hagrid was an incredibly warm, kind-hearted man, and would often forget his exceptional size and strength when patting people on the back. Another of Hagrid's greatest traits was his courage. He was also very loyal to his friends and was ready to defend them or fight for them if necessary. He was particularly loyal to Albus Dumbledore, describing him as a \"great man\". He would react with fury if anyone dared insult the headmaster and wouldn't hesitate to jinx or rough up the offender. However, despite his loyalty, Hagrid was not good at keeping secrets and accidentally told Quirinus Quirrell, Harry Potter, Ronald Weasley, and Hermione Granger the secret of how to get past his three headed dog, Fluffy, which all four of them used to get through to the Philosopher's Stone. This was again shown when he revealed his half-giant status to Olympe Maxime, which Harry, Ron and Rita Skeeter all overheard, with the latter exposing it to the wizarding world by an article in the Daily Prophet.\n", "Hagrid had a great love of magical creatures, including cross-breeds such as the Blast-Ended Skrewt, and had a better relationship with most of the inhabitants of the Forbidden Forest than most people, including the centaurs, though he had little interest in tame magical creatures due to the lack of a challenge they offered. Despite this, he did show a good understanding of such creatures when he returned to his post as Care of Magical Creatures teacher, continuing lessons on unicorns after Professor Wilhelmina Grubbly-Plank.[17] Unfortunately he tended to overlook the dangers behind certain magical creatures, such as his dragon Norbert,[19] and his pet Acromantula Aragog, which was alleged by Tom Riddle to be the monster of Slytherin in 1943,[23] resulting in Hagrid's expulsion from the school. Hagrid never spoke about why he was expelled and would ignore any inquiries about it. Hagrid was fond of creatures in general and seemed to want to own any creature was even slightly fierce — his desires included a warthog and any dragon that he could get his hands on. He tended to give his pets ironic names, such as Fluffy for a vicious three-headed dog, and Fang, an affectionate Boarhound.\n", "Hagrid had a fondness for drinks and was sometimes known to be aggressive, especially when people insulted or dishonourably attacked those he cared about. After Vernon Dursley claimed that James and Lily Potter deserved their fates and called Albus Dumbledore a \"crackpot old fool\"[19], Hagrid threatened Vernon with his pink umbrella. When Igor Karkaroff accused Dumbledore of treachery and spat at his feet, Hagrid lifted Karkaroff off the ground and slammed him against a tree, roaring at him to apologise to Dumbledore.[24] When some Aurors stunned Fang and Minerva McGonagall, he was so disgusted that he attacked the Aurors in an uncontrollable rage, furiously denouncing them as cowards[17] and when he was younger, threw Tom Riddle to the ground when he framed Aragog of opening the Chamber of Secrets.[16]\n", "Despite this, Hagrid was a very sensitive person and was known to burst into tears when someone close to him was harmed or killed, or when he felt responsible for something that put his friends in peril, such as drunkenly telling Quirinus Quirrell how to get past his giant three headed dog, Fluffy.[19]\nHis courage also concealed a deep fear of rejection and insecurity which was notably shown when he isolated himself after he was revealed as a half-giant and he attempted to resign from his position as the Care of Magical Creatures teacher until he was convinced otherwise by Dumbledore, Harry, Ron and Hermione.[24]\n", "When he was teaching, he also had a tendency to lose his self-confidence if his classes were disrupted such as when Buckbeak attacked Draco Malfoy, or if he believed people disliked his classes,[23] which he mistook for people disliking him.[25] Although he overlooked certain dangers, Hagrid also avoided doing anything against the Wizarding Law when he was under pressure such as when he avoided setting Buckbeak free, fearing he would be put back in Azkaban[23], and when he tried hard to avoid getting dangerous creatures when under probation by Dolores Umbridge[17].  \n", "Hagrid was also a good and caring brother to Grawp, insisting on bringing him back to Hogwarts on finding he was being picked on for his \"small\" stature by the other giants in his colony, and hiding in the forest, despite the frequent injuries and the trouble doing so caused him.[17]\n", "He also enjoyed cooking for his friends. However, his tendency to mostly cook foods suitable for himself and a lack of understanding of what his friends preferred eating meant that his cooking was usually turned down politely.\n"], "personality_quotes": [], "figure_captions": ["Hagrid in oven-mitts and an apron"], "quote": ["I would trust Hagrid with my life.", "—Albus Dumbledore's trust in Hagrid\n", "Harry Potter and the Philosopher's Stone"], "description": "Professor Rubeus Hagrid (b. 6 December 1928[11][12]) was a half-giant wizard, son of Mr Hagrid and the giantess Fridwulfa, and elder half-brother of the giant Grawp.\n"}