{"id": "Rufus_Scrimgeour", "name": "Rufus Scrimgeour", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Rufus_Scrimgeour", "personality": ["Scrimgeour was, according to Dumbledore, a \"man of action\", having fought against Dark Wizards throughout his career as an Auror and climbed ambitiously through the Ministry.[20] He gave an impression of shrewd toughness and was more decisive and forceful than his predecessor, Cornelius Fudge.[3] Scrimgeour did not underestimate Voldemort,[20] which he demonstrated by taking more action for the Wizarding World to fight Voldemort and the Death Eaters, and cared a great deal about the Ministry's reputation.\n", "However, despite appearing more proactive, Scrimgeour possessed a more hypocritical, deceitful and shameless side as he prioritised appearances over truth and cared more for the Ministry's reputation than the safety of the wizarding community, just as his predecessor had done. This was evidenced by the fact that he did not allow the reporting of devastating events which had occurred such as the death of renowned Auror Alastor Moody and the 1997 mass breakout of Azkaban, due to believing it would ruin the Ministry's reputation and cause panic. At the expense of true justice, he even allowed the the arrest of innocent people — such as Stanley Shunpike — to give the impression that the Ministry was making progress in the war.[14]  Scrimgeour also appeared ignorant of corruption within the Ministry, as he was oblivious of Dolores Umbridge's tyrannical crimes during her temporary rule over Hogwarts, and the fact that Pius Thicknesse and other Ministry employees were put under the Imperius Curse to serve Voldemort, which would ultimately prove to be his undoing.\n", "Under his shamelessness and hypocrisy, he was also willing to gain the trust of those who the Ministry had previously attempted to discredit in order to keep a false pretence of peace. He tried unsuccessfully at various times to convince Harry Potter to work for the Ministry as a \"mascot\" to improve morale: once during the Christmas holidays,[14] and another time after Dumbledore's funeral.[17] Like Snape, he thought of Harry as arrogant and conceited, and disliked him for it[5] while Harry disliked his hypocrisy and false pretences, claiming Scrimgeour's tenure as Minister was just as bad as Fudge's tenure was. When Dumbledore disagreed with his intended use of Harry as a mascot, Scrimgeour deeply distrusted Dumbledore to the point that he attempted to spy on him and control the matter of Dumbledore's will after his death rather than prioritising the fight against Voldemort. Despite his flaws, Scrimgeour in the end proved his bravery and strength of character when he refused, under torture, to tell Voldemort of Harry's whereabouts.[2]\n"], "personality_quotes": [["Scrimgeour: \"Remembered you're not at school, have you? Remembered that I am not Dumbledore, who forgave your insolence and insubordination? You may wear that scar like a crown, Potter, but it is not up to a seventeen-year-old boy to tell me how to do my job! It's time you learned some respect!\"\n", "Harry Potter: \"It's time you earned it.\""]], "figure_captions": [], "quote": ["The Prime Minister's first, foolish thought was that Rufus Scrimgeour looked rather like an old lion. There were streaks of grey in his mane of tawny hair and his bushy eyebrows, he had keen yellowish eyes behind a pair of wire-rimmed spectacles and a certain rangy, loping grace even though he walked with a slight limp. There was an immediate impression of shrewdness and toughness; the Prime Minister thought he understood why the wizarding community preferred Scrimgeour to Fudge as a leader in these dangerous times.", "—Scrimgeour's outward disposition\n", "Harry Potter and the Half-Blood Prince"], "description": "Minister Rufus Scrimgeour (d. 1 August, 1997) was a British wizard who was a powerful ranking official in the Ministry of Magic. He originally joined the Ministry of Magic as an Auror, where he became a hardened veteran, spending most of his life fighting Dark Wizards. Eventually he rose to become Head of the Auror Office. During the Second Wizarding War, Scrimgeour was appointed in 1996 to succeed Cornelius Fudge as Minister for Magic. While he appeared to provide a much tougher and resolute stance against Lord Voldemort and his Death Eaters, he made the same mistake of creating the appearance of safety and security, while in truth Scrimgeour's efforts were waning in progress in the war.\n"}