{"id": "Scabbers", "name": "Peter Pettigrew", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Scabbers", "personality": ["Peter Pettigrew was characterised by weakness. Despite having been Sorted into Gryffindor, he did not possess true bravery, possibly proving that the Hat saw potential in him rather than any actual inborn courage, potential that he never lived up to. The Sorting Hat may have mistaken his adoration of James and Sirius for steadfastness, or sensed in him a desire to surround himself with respected individuals and believed that he would make a compatible friend to a Gryffindor; Pettigrew clearly looked up to strong, courageous people and it is possible that the Sorting Hat put him there because he wished to absorb that quality. It is also likely that Pettigrew requested the Sorting Hat to place him in Gryffindor, with his friends, just as Harry Potter would later request not to be placed in Slytherin. Indeed, he underwent a Hatstall when being sorted, being considered between Gryffindor and Slytherin by the Sorting Hat, though the hat ultimately decided that it made the right choice to this day, citing the manner in which Pettigrew died as (what some would call dubious) evidence.[12]\n", "In his youth, he latched onto James Potter and Sirius Black, more talented and popular students, idolising them and living vicariously through their accomplishments, as well as joining them in bullying other students, such as Severus Snape, whom he would not have been likely to cross without James and Sirius to back him up. Due to the huge difference in terms of talent, bravery, and popularity, Peter was more of a hanger-on than an actual equal. However, the three Marauders did love Peter as a friend and brother, which made the eventual betrayal of James especially bitter.\n", "Pettigrew defected from the Order of the Phoenix and betrayed his closest friends to Lord Voldemort when his life was threatened, showing selfishness and disloyalty at the core of his being.[11] Even Voldemort viewed him with disdain; the only reason why he kept him alive was because he occasionally proved to be useful.[16] When Voldemort fell, Peter neither attempted to find him nor tried to murder Harry under Albus Dumbledore's watchful eye, until he was sure Voldemort would be revived to protect him. When cornered by Sirius and Remus, Peter shamelessly begged for mercy, despite having used and betrayed them. But if there was one thing that he feared more than death, it was most likely the Dementor's Kiss; the thought of being left to the Dementors' mercy would've terrified anyone.\n", "Pettigrew was an opportunist, who allied with the side that seemed strongest and appeared to be winning — thus becoming \"friends\" with James and Sirius in school, and then leading him to become a Death Eater when the opportunity arose. He was loyal only to himself and acted in whatever his best interest was at the moment. He expected that he would be rewarded for leading Voldemort to Harry Potter, and later had the same expectations with Bertha Jorkins, assuming Voldemort would reward him for capturing a Ministry of Magic employee, despite not knowing the extent of her usefulness. He only returned to a broken down Voldemort simply because he had no other choice, as the other side was aiming to kill him, and would have gone to anywhere else if he had more options, seeing Voldemort at the time was too weakened to be the victorious side, along with the task of caring for his lord being tedious and unpleasant.\n", "In spite of others claiming that Pettigrew was a \"weak, talentless thing\", he was at least cunning enough to escape his former friend Sirius after Voldemort's first defeat, frame him for his crimes, and fake his own death while killing twelve people with one curse, living for years in his Animagus form. He originally formulated his plan to return to the Dark Lord without being accused a traitor by his colleague Death Eaters: to turn Harry in as a welcome back present and be honoured above all others; though a well thought out plan and he waited patiently, it was upset when Pettigrew's form was exposed prematurely. He also managed to manipulate Bertha Jorkins to accompany him with ease, when he brought her to Lord Voldemort. He was also adept in the Dark Arts, powerful enough and malicious enough to use the Killing Curse on Cedric Diggory. In moments of desperation Pettigrew was willing to amputate his own limbs to serve his purposes, such as his finger to fake his death, and his hand to revive Voldemort, the latter being promised with a worthy reward. He was, however, foolish enough to stop by an inn for food en route to returning to Voldemort, which led him to run into a Ministry employee; if Pettigrew had not been cunning enough to persuade Bertha into his trap, he might have exposed his own duplicity to the world at large then, as Voldemort had noted.\n", "However, despite his treacherous and cowardly nature, Pettigrew did feel some regret for betraying his friends, and he hesitated to kill Harry when reminded of his life debt, in 1998. Though he quickly tried to undo the moment of weakness, his \"tiny merciful impulse\" resulted in his being strangled to death by his own silver hand.[1] Pettigrew also suggested that Voldemort should find another enemy to use for his rebirth, though when Voldemort began to suspect that he cared about Harry Potter, Pettigrew hastily claimed that Harry meant nothing to him. This suggested that he may have consciously felt some gratitude towards Harry for sparing his life.[16] Pettigrew also realised and admitted that he was a coward saying that he'd never been brave like Sirius, Remus, and James. Though he valued his own life more than the lives of his friends, Pettigrew felt guilt for betraying Lily and James, but did not have the courage to admit his treachery until it was forced out of him, or to turn against Voldemort. He did feel rather under-appreciated when Voldemort claimed him to be an unintelligent and disloyal servant when comparing to Barty Crouch Jr. and also seemed resentful that he was treated as little more than a servant for Snape, though he refrained from complaining too much when Snape threatened to request more dangerous assignments for Peter. Without James, Sirius, and Remus protecting him, Peter found no courage to go against Snape, who would in turn bully him in return throughout their time as Death Eater colleagues.\n", "During his time as Scabbers the rat, under the Weasley family's care, Pettigrew was lazy and unmotivated, as all he did was sleep and eat, and only on one occasion did, he bit Goyle's knuckle on his owner's behalf. This could be because Pettigrew enjoyed being pampered and waited hand and foot, believing that as a pet rat he did not have to do much and can relax instead, at least until Sirius' escape from Azkaban prompted him into action. Even after returning to his Death Eater services, he continued to show certain levels of laziness and carelessness that leads to mistakes, such as foolishly stopping at an inn for food while on his way to Albania that led him to meeting with a Ministry employee and former schoolmate, or neglecting his duties of guarding Barty Crouch Snr that allowed him to escape.\n", "Pettigrew was one of only two Death Eaters who rarely referred to Voldemort by name,[5][18] the second being Barty Crouch Jr.[16][18]\n"], "quotes": [["Peter: \"Sirius: What would you have done? What would you have done???\"\n", "Sirius Black: \"I WOULD'VE DIED!!! I would've died rather than betray my friends!\""], ["\"If you made a better rat than a human, it's not much to boast about, Peter.\"", "—Sirius Black's low opinion of Pettigrew[src]\n"]], "figure_captions": ["Pettigrew cowering in fear", "Pettigrew, James, and Sirius bullying Snape, not brave enough to do it on his own", "Harry Potter saving Pettigrew's life, causing Pettigrew to feel some gratitude towards him"]}