{"id": "Sirius_Black", "name": "Sirius Black", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Sirius_Black", "personality": ["Sirius was true to the ideal of a Gryffindor student. He was true-hearted and brave, as shown by his participation in both wars and willingness to die for those he loved. He was particularly loyal to his best friend, James Potter, a fellow Gryffindor. In his youth, he was a witty and talented wizard, but also quite an arrogant and mischievous troublemaker. He bullied and humiliated those he particularly disliked, namely Severus Snape. He was vicious towards those he hated, sometimes unjustifiably — deliberately sending the teenage Snape off to the Shrieking Shack when Remus Lupin was a full-fledged werewolf, while knowing that it could be fatal for Severus. He, along with James, were acknowledged to be some of the most brilliant students Hogwarts had ever seen, as proven by their ability to become Animagi as underage wizards and by the creation of the Marauders' Map.\n", "As an adult, Sirius was shown to be capable of an explosive temper when angered, a trait shared by his mother, Walburga Black, and his mad cousin, Bellatrix Lestrange. His years in Azkaban contributed dramatically, which was especially evident during 1993 and 1994: trying persistently to capture Peter Pettigrew, going to lengths that even Dumbledore commented as not those of an innocent right-thinking man. \n", "Later on, he occasionally demonstrated himself to be reckless, immature, and even downright irresponsible. In several instances, he risked getting caught by the Ministry because he felt stir-crazy in his house, and advised Harry to take rash actions. Much of this can likely be attributed to the vast amount of time spent in jail, which stunted his emotional development and making him especially eager to spend time with and protect his loved ones.\n", "However, through it all, Sirius had good intentions. For all his wrath and vengeance toward Pettigrew, he was capable of respecting Harry's request to not murder the man he escaped Azkaban to kill; opting instead to expose Pettigrew (a plan that unfortunately failed, with catastrophic results). He also seemed to have possessed a superb mental control that contrasted sharply with his passionate and impulsive nature. The fact that he was able to completely resist the psychological effects of the Dementors for so many years suggests that he had an unusually strong sense of self, and therefore was capable of withstanding long periods of emotional torture and despair.\n", "Besides all this, Sirius seems to have some traits related to his Animagus form of a dog. Such examples are when James Potter points out Snape, and Sirius is described as \"perfectly still like a dog smelling a rabbit.\" The most referenced of these traits is his \"bark-like laugh.\" as it is described nearly every time it is heard. Sirius' other dog-like traits include his need to protect his loved ones, his selfless nature, great sense of loyalty, and his need to be part of something bigger than himself, such as when he helped to plant the seeds of Dumbledore's Army and encouraged and enabled Harry to further the movement against Umbridge's increasingly totalitarian hold over Hogwarts. His territorial protectiveness over the places and people he cared for were always evident, given how he stayed in his dog form for Harry after his encounter and duel against the newly resurrected Voldemort in Little Hangleton, comforting his godson in plain view of many people, including Cornelius Fudge, who still thought he was a criminal, at great personal risk to himself. \n"], "personality_quotes": [["\"Sirius, to me, he's kind of on the edge, do you not get that feeling from Sirius? He's a little bit of a loose cannon... But Sirius had his flaws — I've sort of discussed that before — some quite glaring flaws. I see Sirius as someone who was a case of arrested development. I think you see that from his relationship with Harry in “Phoenix.” He kind of wants a mate from Harry, and what Harry craves is a father. Harry's kind of outgrowing that now. Sirius wasn't equipped to give him that.\"", "—J. K. Rowling about Sirius' character[src]\n"]], "figure_captions": ["The result of Sirius' nasty temper, the Fat Lady's portrait in shreds"], "quote": ["We've all got both light and dark inside us. What matters is the part we choose to act on. That's who we really are.", "—Sirius' words of advice and wisdom\n", "Harry Potter and the Order of the Phoenix "], "description": "Sirius Black (3 November,[11] 1959[12] – 18 June, 1996[4]), also known as Padfoot or Snuffles (in his Animagus form) was a pure-blood wizard, the older son of Orion and Walburga Black, and the brother of Regulus Black. Although he was the heir of the House of Black, Sirius disagreed with his family's belief in blood purity and defied tradition when he was Sorted into Gryffindor House instead of Slytherin at Hogwarts School of Witchcraft and Wizardry, which he attended from 1971-1978. As the rest of his family had been in Slytherin, he was the odd one out.\n"}