{"id": "Stan_Shunpike", "name": "Stanley Shunpike", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Stan_Shunpike", "personality": ["In spite of being a friendly and well-meaning wizard, Stan Shunpike was not very bright, as he failed to recognize the child celebrity Harry Potter. But then again it might have simply been that he did not get time to properly examine Harry's scar, as Harry hid it immediately after Stan showed interest, which would have likely confirmed Harry's true identity. He loved gossip and having inside information, a trait that later landed him in Azkaban. Like most wizards, he was openly disturbed when wizards spoke the name \"Voldemort\".\n", "Stan was very vain, a trait akin to Gilderoy Lockhart, although less pronounced. Lockhart easily made women and girls swoon over him, whereas Stan had often resorted to boasting when in the presence of attractive young women in order to try and impress them. His slovenly appearance suggested that he resorted to toughness to bolster his perceived credibility with girls. The two most infamous examples of his vanity is his trying to chat up veela that he would become Minister for Magic, and falsely boasting in a pub that he knew of the Death Eaters' secret plans.\n", "He seems to disdain Muggles, as when Harry asks him whether the Muggles are able to see and hear the Knight Bus, Stan contemptuously remarks that Muggles don't listen and see properly, not to mention they never notice anything.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Isn't he the one who claimed he was going to be­come Minister for Magic when he was trying to chat up those veela?", "—Ron Weasley explains Stan Shunpike\n", "Harry Potter and the Half-Blood Prince"], "description": "Stanley \"Stan\" Shunpike (born between 15 September 1974 and 13 September 1975[1]) was a British wizard and was the conductor and helper of the Knight Bus. On 14 September 1996, he was arrested and sent to Azkaban for being a Death Eater when he was overheard claiming to have inside information about the organisation, although in all likelihood, he was only fooling around.[1] In 1997, he broke free from prison and joined the Death Eaters under the Imperius Curse. His fate after the war is unknown; he most likely awoke from the Curse following Lord Voldemort's ultimate defeat, like all the other Imperiused victims[3], and returned to his job.\n"}