{"id": "Sybill_Trelawney", "name": "Sybill Trelawney", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Sybill_Trelawney", "personality": ["According to Professor McGonagall, seeing death omens is a favourite way for Trelawney to greet her class, something that greatly annoyed Harry as he was her frequent target. One of her hobbies was practising doom-laden prophecies in front of the mirror.[1] She became angered when she believed that students were not impressed by nor interested in her subject, such as Ronald Weasley and Hermione Granger.\n", "She took her appearance as a Seer seriously, putting on showy airs of mysticism and veiling her classroom in scented vapours. She could be very defensive in the face of those disbelieving in her abilities, attempting to impress them with false predictions of impending danger. She would claim that those unbelievers had \"lack of Sight\" or that they were simply scared of Seers.\n", "Trelawney was implied to have had a mild drinking problem; a number of times Harry detected the smell of old sherry on her, and at one point, she was seen stowing away empty alcohol bottles in the Room of Requirement. She was especially fond of sherry. This escalated during the reign of the Hogwarts High Inquisitor, in which Sybill's stress at being monitored so closely led her to appear more drunk during work hours.\n", "She was very sensitive, most notably when Dolores Umbridge placed her on probation and then dismissed her. Trelawney expressed on how she believed that all of the High Inquisitor's questionings and demands were an insult to a self-proclaimed Seer, but her own inability to cope with the pressure led to a spiralling emotional breakdown that Umbridge considers to be an embarrassment to the rest of the school. Trewlaney's poor control over her emotions led her to behave more unprofessionally when she turned to alcoholism to such an extent that Harry could catch the smell of sherry on her; she was actually holding a bottle of sherry at the time of her dismissal. Sybill was, however, loyal to the school and defended it during the Battle of Hogwarts.\n"], "personality_quotes": [["\"Welcome. How nice to see you in the physical world at last. Welcome to Divination. My name is Professor Trelawney. You may not have seen me before. I find that descending too often into the hustle and bustle of the main school clouds my Inner Eye\"", "—Professor Trelawney greets her third-year students[src]\n"]], "figure_captions": ["Trelawney in fits of tears when Argus Filch evicted her on orders of Umbridge"], "quote": ["Trelawney: \"Certainly I knew, Minerva. But one does not parade the fact that one is All-Knowing. I frequently act as though I am not possessed of the Inner Eye, so as not to make others nervous.\"\nMinerva McGonagall: \"That explains a great deal.\"", "―Professor Trelawney's dubious gift", ""], "description": "Professor Sybill Patricia[7] Trelawney (b. 9 March,[1][3] pre 1962[2]) was a half-blood[8] witch and professor of Divination at Hogwarts School of Witchcraft and Wizardry. She is the great-great-granddaughter of the celebrated Cassandra Trelawney,[9] who was also a Seer.\n"}