{"id": "Vernon_Dursley", "name": "Vernon Dursley", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Vernon_Dursley", "personality": ["Vernon was an arrogant, surly, combustible, blustering, abrasive, petty-minded bully who was completely intolerant of people who were different than himself. Like Petunia, he detested magic and anything unusual or out of the ordinary, which he labelled as \"funny business\" in 1981. Naturally, he despised Harry, who as a wizard was very much a symbol of both and spitefully bullied him all throughout the latter's childhood. Vernon's disdain for Harry was so great that he forced him to sleep in the cupboard under the stairs and, after Harry discovered he was a wizard despite Vernon's best efforts to keep it from him, prohibited Harry from saying words such as \"magic\" or \"wizard\" inside the house.\n", "In addition to being a bully towards Harry, Vernon was absurdly vain and materialistic, unsympathetic to beggars and vagrants. He was very much concerned with status and wealth and tended to judge people based on how big their cars were or their clothes. He enjoyed ordering around his employees at Grunnings, enjoying his status and authority as director of his company, sitting above them in a high office on the ninth floor. Vernon liked to look big and impressive, yet was easily intimidated whenever he was put in situations that he was not used to, e.g., dealing with certain individuals, i.e., wizards, e.g., Albus Dumbledore, Arthur Weasley, Alastor Moody, Rubeus Hagrid, etc.\n", "He was also shown to be quite oblivious to small things, particularly when cross, such as in 1992 when he asked Harry if he looked stupid to him when he became annoyed with the boy: he had a bit of fried egg sticking to his moustache. Sometimes when he was angry, Vernon would mumble, barely forming complete sentences.\n", "He was also shown to be very conservative in his political views, as he read the Daily Mail, a British tabloid famed for its right-wing political stance. He also seemed to have a low opinion of the state of the UK, saying: \"No wonder the country's going to the dogs!\" upon finding out that there was a Ministry of Magic, a popular Daily Mail editorial stance. He advocated the death penalty, especially for murder,; after seeing a mug shot of Sirius Black, he claimed that \"...hanging's the only way to deal with these people,\" showing his harsh view of criminal justice.\n", "He enjoyed complaining about anything that did not fit in with his narrow-minded views of the world and his favourite subjects included people at work, the council, the bank, motorbikes, as well as most of all: Harry. He showed his disdain to Harry with nasty smiles and he was not afraid of physical confrontations, going as far as wrestling with his son, Dudley, to confiscate Harry's Hogwarts acceptance letter. He frequently became angry and he received brandy from his wife when he was rendered speechless by the \"vanishing glass\" incident at the zoo. Despite his bad temper and blustering, bullying, dominant nature however, he showed himself to be a coward when confronted by those he could not bully or intimidate, as shown by his terrified reaction when Hagrid furiously confronted him upon discovering that he had not told Harry the latter was a wizard, or who his parents were or that they had been murdered. All this Vernon had kept from Harry in order to \"stamp the wizarding rubbish out of him.\" He was likewise scared by Alastor Moody when the latter confronted him over his bullying treatment of Harry and would immediately back down whenever Harry threatened him with magic.\n"], "personality_quotes": [], "figure_captions": ["Vernon giving Harry a dirty look"], "quote": ["There's no such thing as magic!", "—Vernon's strong dislike of magic\n", "Harry Potter and the Philosopher's Stone "], "description": "Vernon Dursley was a Muggle, husband of Petunia Evans, father of Dudley and uncle of Harry Potter by marriage. He used to live at 4 Privet Drive along with his wife and son for nearly twenty years until they were forced into hiding during the escalation of the Second Wizarding War. After Petunia's sister Lily and brother-in-law, James Potter, were killed by Voldemort in their own home, Petunia remained the sole surviving blood relative of Harry's. Both Wizard and Muggle law demanded that Petunia and Vernon be the new legal guardians of Harry Potter, which they accepted (albeit reluctantly). However, they disliked Harry and treated him badly, while spoiling and fattening Dudley.\n"}