{"id": "Vincent_Crabbe", "name": "Vincent Crabbe", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Vincent_Crabbe", "personality": ["Slytherins are typically described as \"cunning\", though given Crabbe and Goyle's demonstrated low intelligence, it is likely that they were sorted into Slytherin due to their desire for power and their belief in blood purity, which are often considered to be other common Slytherin traits. It is also possible that they did not fit into the other houses as well as they fit into Slytherin, or that they requested the Sorting Hat to specifically place them there as Harry and Hermione did for Gryffindor.\n", "Crabbe also displayed poor sportsmanship as a Quidditch player, as when playing Beater for the Slytherin Quidditch team, he spitefully sent a Bludger at Harry after the Snitch had already been caught during the 1995-1996 Quidditch match between Slytherin and Gryffindor.\n", "Near the end of his life, Crabbe proved to be a deadly dark wizard, being able to cast the Unforgivable Curses with clear talent. While he failed his Defence Against the Dark Arts classes, he excelled in the actual Dark Arts class, his thuggish sadism giving him the motivation to perform powerful curses on his fellow students and even becoming top of the class. He also seemed to change for the worse, as he defied Draco knowing that the Malfoy family had lost its influence and prestige in both the wizarding world and Voldemort's eyes, and that nothing could be gained from being affiliated with them anymore. Furthermore, he was not above torturing and even attempting to kill fellow students. Crabbe attempted to murder Hermione Granger and Ron Weasley for being a Muggle-born and blood traitor, respectively, also hurling the highly offensive \"Mudblood\" at them. This differentiates him from Draco, who had realised in his sixth year that he had delved deeper into the Dark Arts than he wanted. However, Crabbe also remained reckless and stupid, and neglected the potency of the Dark Arts, releasing cursed flames to incinerate his opponents that he could not control, which led to his death.\n"], "quotes": [["Angelina Johnson: \"...I was always surprised Derrick and Bole managed to find their way onto the pitch without signposts.\"\n", "Harry Potter: \"Crabbe and Goyle are in the same mould.\""]], "figure_captions": []}