{"id": "Xenophilius_Lovegood", "name": "Xenophilius Lovegood", "fandom": "harrypotter", "url": "https://starwars.fandom.com/wiki/Xenophilius_Lovegood", "personality": ["Xenophilius cared a great deal about his daughter Luna, and shared her strange beliefs; he was likely the cause of them. He thought the Daily Prophet was an awful paper, and only published stories that he thought were important and needed to be known by the public. He was extremely firm in his bizarre beliefs and felt those who disbelieve in them are \"painfully limited\", \"narrow\" and \"close-minded \". Every time a sceptic demands the evidences for his beliefs, he in turn asks them to prove them untrue themselves.\n", "Due to his bizarre views, many in the wizarding world thought he was senile. Elfred Worple even remembered him as a \"seriously unbalanced man\" after meeting him at one of his book signings. According to Luna, her father did not care about making money and did not pay people to write for The Quibbler; she claims they did so because it was an honour to see their name in print. Luna also said that her father was supportive of any anti-Ministry action. Mr Lovegood fully supported Harry Potter and encouraged others to do so as well, until his daughter was kidnapped by Death Eaters. Xenophilius cared about Luna so much that he was willing to hand Harry, Ron and Hermione over to the Death Eaters in exchange for his daughter.\n", "Xenophilius believed in the Deathly Hallows, (which actually proved to be real), as well as numerous magical cryptids such as Crumple-Horned Snorkacks. He also believed that gnomes had powerful magic, and that the dirigible plum would enhance one's ability to accept the extraordinary. Although he sought the Deathly Hallows, given his personality, he was likely interested in them more as a matter of curiosity about such unusual objects, rather than a desire to actually possess or use them.\n", "Given his tendency to believe in anything dubious and ridiculous, Xenophilius sometimes becomes the subject of pranks, such as when a young wizard gave him an Erumpent horn and claimed that it belonged to a Crumple-Horned Snorkack. Unbeknownst to Lovegood, the Erumpent horn will explode if given even the slightest touch. This also shows that he is ignorant about some magical creatures, as he was unable to identify the horn at first glance.\n"], "quotes": [["Hermione Granger: \"I mean, you could claim that anything's real if the only basis for believing in it is that nobody's proved it doesn't exist!\"\n", "Xenophilius Lovegood: \"Yes, you could. I am glad to see that you are opening your mind a little.\""]], "figure_captions": ["Xenophilius dancing with Luna at the Wedding"]}