{"id": "Zacharias_Smith", "name": "Zacharias Smith", "fandom": "harrypotter", "url": "https://harrypotter.fandom.com/wiki/Zacharias_Smith", "personality": ["Zacharias Smith seemed to generally be a rather unpleasant person and was seen as overly critical of Harry Potter in the D.A.[5] He was also pushy and insensitive in questioning Ginny Weasley and rude and biassed in his Quidditch commentary.[11] He was obnoxious, condescending, pessimistic, and a hypocritical ingrate. He failed see flaws in himself and was constantly openly insulting people or pointing out exaggerated facts or opinions about said people. When he was part of Dumbledore's Army, he obnoxiously criticised and challenged Harry's competence as a teacher, as well as a wizard — he didn't seem to realise that he himself was doing terribly in general, struggling with the Disarming Charm (though this might be due to the Weasley Twins' intervention). The main reason he attended the D.A. recruitment meeting was to hear details regarding Cedric Diggory's death; even though Harry made it clear the meeting was not about such topics and that he has no intention of speaking of it, Smith pressed on the matter until Harry bluntly told him to stay down or leave.\n", "Aside from this lack of fair play, Smith also showed cowardice and a lack of the loyalty uncharacteristic of Hufflepuff house in fleeing, instead of fighting for his school and fellow students in their time of greatest need. He was so selfish that he went as far as to forcefully rush through first years in his great haste to escape.[15] He did not stay for the late headmaster Dumbledore's funeral, instead leaving the moment his \"haughty-looking\" father came to pick him up.[14]\n"], "personality_quotes": [["\"That Zacharias bloke's a wart.\"", "—Zacharias's unpleasant personality[src]\n"]], "figure_captions": [], "quote": ["I don’t think ", "—Zacharias' overly critical nature\n", "Harry Potter and the Order of the Phoenix"], "description": "Zacharias Smith (b. c. 1979/1981) was a British wizard who attended Hogwarts School of Witchcraft and Wizardry, who was sorted into and a member of Hufflepuff House. He was a Chaser on the Hufflepuff Quidditch team and a member of Dumbledore's Army, an organisation taught and led by Harry Potter.[5] In 1998 he abandoned the D.A. instead of fighting with them during the Battle of Hogwarts. \n"}