{"id": "Ahsoka_Tano", "name": "Ahsoka Tano", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Ahsoka_Tano", "personality": ["Ahsoka Tano was a Togruta female who had blue eyes, dark orange skin, brownish-grey lips, white facial markings, and white Lekku and montrals with blue stripes. As a teenager, Tano was snarky, cocky, stubborn, reckless and impulsive, yet loyal, brave, generous and kind-hearted. She was very feisty and snippy, which earned her the nickname \"Snips\" from her master, Anakin Skywalker. Like her master, she was known to be very aggressive, eager for battle and willing to use terror or threats to get the answers she wanted.[6]\n", "Over time, Tano became more mature and enlightened, her experiences during the Clone Wars shaping her. She had her victories, her failures, and her losses yet strove through them all, as she felt it was her duty as a Jedi to help restore peace and prosperity to the Republic. Her constant travels and experiences made her more worldly than most people her age, and often she was surprised by the various events and people she came across during the Clone Wars.[48]\n", "However, when Tano was framed for murder and treason, she was horrified when the Jedi Order cast her out and all but condemned her to a Republic military tribunal, and came very close to being sentenced to death. When Skywalker unveiled the true culprit, Tano was shocked to see it was her friend Barriss Offee.[48] Though conflicted,[1] she ultimately rejected the opportunity to become a Jedi again, having lost faith in the Order[51] for not standing by her.[78]\n", "Tano was a confident and moralistic person, and a firm defender of the innocent. This carried on even after she left the Order, as she joined Bail Organa's rebellion to restore liberty and democracy to the people oppressed by the Empire. Tano also felt pity and compassion for the Inquisitor known as the Sixth Brother despite slaying him in combat. She regarded the Sixth Brother as a victim whose potential for good had been twisted and turned to the dark side. After befriending the Force-sensitive Hedala Fardi, Tano became concerned with protecting Force-sensitive children from being captured by the Empire's Inquisitors.[12]\n", "During her time running from the Empire, Tano continued to suffer from grief over the loss of her friends and guilt over the fact that she wasn't there to help them. During her time on Raada, Tano was unsure about making new friends, largely due to the emotional pain inflicted by Offee's betrayal. Despite everything Offee had done, Tano believed that while she was wrong about \"a lot of things\", she did have a point about the Jedi and the Republic, and later expressed her belief that if had they truly listened to her, they might have been able to stop Darth Sidious before it was too late.[12]\n", "As a rebel Informant code-named \"Fulcrum\", Tano worked indirectly with various rebel cells, always with her face hidden and her voice disguised, and became somewhat pragmatic as she advised Hera Syndulla to cease searching for Kanan Jarrus to protect her crew, especially Ezra Bridger. This may suggest she developed a more discreet nature and decided overall to put the many before the few.[63]\n", "Even after revealing her true identity to the rebels, her dealing in secret as Fulcrum appeared to have remained, as Tano told Jarrus and Bridger that she had no knowledge about the Sith Lord they encountered, as she herself was having trouble coming to terms with the horrific realization of what had become of her former master.[13]\n", "Those feelings recently made themselves apparent when she was refused to help open the Lothal Jedi Temple, stating she was no longer a Jedi for leaving the Order. While inside the temple, she was haunted by a phantom of her master, who angrily scolded Tano for leaving him to a fate worse than death. Tano, shedding tears and welling up with grief, lashed out at the illusion, and then wept when she saw no one there, but now realized her fears were true - that her former master was a ruthless Sith Lord.[56]\n", "Upon finally coming face-to-face with her former master once again, Tano refused to believe he and Vader were the same person, stating Skywalker \"could never be as vile as Vader,\" to which Vader responding by claiming he had destroyed Skywalker. Tano then swore to avenge Skywalker's \"death,\" something against her Jedi training and morals, but affirmed she was not a Jedi and proceeded to duel Vader, only to find that he was indeed her former friend and mentor. Feeling guilty over leaving him before, Tano offered Vader compassion, refusing to leave him behind again, only to be rebuffed and sentenced to death. Despite Vader's ruthlessness and power, Tano bravely continued the fight.[72]\n", "When Tano was saved and reunited with Bridger in the world between worlds, she was saddened to learn of the fate of Jarrus, but disturbed by Bridger's idea of saving Jarrus from dying. Drawing from her own experience of being unable to save her master, Tano successfully convinced Bridger to let Jarrus go, and they parted ways, promising to find each other again as Tano went back to Malachor and resumed her journey.[75]\n", "After the Battle of Endor, Tano sought to keep her promise to Bridger and joined Sabine Wren in her quest to find him and bring him home.[76]\n"], "personality_quotes": [], "figure_captions": ["Following her expulsion and trial, Tano lost faith in the Jedi Order."], "quote": ["It's every citizen's duty to challenge their leaders, to keep them honest, and hold them accountable if they're not.", "―Ahsoka Tano", "The Academy"], "description": "Ahsoka Tano, nicknamed \"Snips\" by her Master and known as \"Ashla\" after the Clone Wars, was a Jedi Padawan who, after the conflict, helped establish a network of various rebel cells against the Galactic Empire. A Togruta female, Tano was discovered on her homeworld of Shili by Jedi Master Plo Koon, who brought her to the Jedi Temple on Coruscant to receive Jedi training. Following the outbreak of the Clone Wars, Jedi Grand Master Yoda assigned the young Tano to be the Padawan learner of Jedi Knight Anakin Skywalker, whom she joined at the Battle of Christophsis. Whereas Tano was eager to prove herself, Skywalker had a reputation for recklessness, and they had a rather difficult start as Master and apprentice. Yet, they worked together to rescue Rotta, the son of crime lord Jabba Desilijic Tiure, and returned Rotta to his father, thus facilitating a crucial alliance between the Hutt Clan and the Galactic Republic.\n"}