{"id": "Asajj_Ventress", "name": "Asajj Ventress", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Asajj_Ventress", "personality": ["As a child Ventress was kind and caring, but became dark and brooding after the death of her master, Ky Narec. Giving into rage and resentment, she subsequently spiraled into darkness.[3] Known to be quick to anger, Ventress could easily be infuriated, such as when her formidable lightsaber skills were described to her as those of an amateur by Luminara Unduli.[9] Despite her quick temper, she was very cunning and swift, allowing her to outsmart most foes.[11]\n", "Ventress could also be vindictive and inconsiderate. After being betrayed, abandoned and nearly killed by Dooku, Ventress desired to kill him and went to the Nightsisters to find a way to defeat her former Master.[3] She recruited Savage Opress and treated him like a slave which ultimately caused him to turn against her.[4][28]\n", "After becoming a bounty hunter, her attitude had softened somewhat, as seen when she allowed Pluma Sodi to return to her people.[25] Likewise, she had lost interest in killing some of her former enemies, including Obi-Wan Kenobi and Ahsoka Tano. In fact, she rescued Kenobi from Darth Maul and Opress, more interested in the latter's bounty reward than her previous enmity with the Jedi Master.[27] On the other hand, she helped Tano, as she empathized with the Padawan's situation, likening it to her own with Count Dooku.[29][31] She also incapacitated a group of clones without seriously harming any of them, and implied that not killing people was her new modus operandi.[31] To highlight her misunderstood status, she used a snake as the icon on her bounty hunter armor; they were thought to be evil, even when they were not.[37]\n", "Near the end of the war, as she traveled with Quinlan Vos to assassinate Count Dooku, her more compassionate and trusting side was even more strengthened—to the point of her developing a romantic attraction to him. In the end, she sacrificed herself to save Vos who was influenced by the dark side, fully redeeming herself into the light.[2]\n"], "quotes": [["\"You've never been afraid of anything, Asajj Ventress.\"\"You're wrong. I was terrified.\"\"Of what?\"\"Of losing you. I've been lying for so long. It's second nature to me. We learned to trust each other, but what I felt…I was so scared. I was afraid to tell you about Tholme because I thought you'd hate me. I'd only just learned how to trust and care about someone again, and I…I couldn't bear the thought that if you really knew me, knew what I had done, you'd despise me.\"", "―Quinlan Vos and Ventress[src]"]], "figure_captions": ["Ventress during her time as a bounty hunter."]}