{"id": "Bail_Organa", "name": "Bail Organa", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Bail_Organa", "personality": ["Bail Organa was a human man who served as the planet Alderaan's Senator during the last days of the Galactic Republic and the Imperial Era. As a politician, Organa was renown for his honesty and commitment to justice.[2] During the Clone Wars, Senator Organa forged friendships with several senators who were concerned with the increasingly autocratic rule of Chancellor Palpatine including Padmé Amidala of Naboo and Mon Mothma of Chandrila.[34] Organa also undertook relief missions to wartorn worlds including Ryloth. Organa convinced Junior Representative Jar Jar Binks to use his talents as a clown to distract Trade Federation delegates while he facilitated the shipment of supplies to Ryloth.[15] He also had a deep respect for the Jedi and did not believe Emperor Palpatine's claims that the Jedi had turned against the Republic. Organa was troubled by the execution of Jedi younglings during the Jedi Purge.[3]\n", "Senator Organa's respect for the Jedi led him to rescue Master Yoda from Kashyyyk. His friendship with Senator Amidala led him to adopt and raise her daughter Leia as his own child.[3] Organa doted over Leia and trained her in the arts of diplomacy and language.[35] While Senator Organa maintained a respectable facade during the Imperial Era, he secretly opposed the Empire and helped to sponsor the earliest manifestations of resistance. Senator Organa cultivated the former Padawan Tano as the Rebellion's first intelligence operative Fulcrum. He also used his wealth and resources to shelter refugees from Raada on Alderaan.[22]\n", "As the Rebellion grew in strength, Organa devoted resources to financing and arming rebel cells such as the Spectres[23] and the Phoenix Group. He was supported in these endeavors by his adopted daughter Leia, who shared his zeal to the Rebellion and finesse for diplomacy and flattery.[26] Organa was widely regarded as a rebel leader and hero by many in the New Republic, who commissioned a statue in his honor. Organa's love for his daughter led him to withhold the secret that she and her brother Luke Skywalker were the descendants of the reviled Darth Vader, the Emperor's executioner.[4]\n"], "quotes": [["\"We cannot let a thousand years of democracy disappear without a fight.\"", "―Bail Organa, during the last days of the Galactic Republic[src]"]], "figure_captions": []}