{"id": "Boba_Fett", "name": "Boba Fett", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Boba_Fett", "personality": ["As a child, Boba was close with his father, learning much from Jango's years as a bounty hunter.[15] He was distrustful of Obi-Wan Kenobi upon the Jedi Knight's arrival on Kamino, recognizing him as a potential threat to both himself and Jango. He took pleasure in fighting Kenobi both on Kamino and in orbit of Geonosis, expressing joy at the thought that the Jedi had been killed.[1] His personality hardened after Jango's death, as Boba swore vengeance on Mace Windu, yet he did not take any pleasure in the collateral damage wrought by his mission.[9] His better nature eventually won over in honor of his father's memory, as Boba turned against his bounty hunting allies and allowed himself to be taken into the custody of the Galactic Republic. Despite realizing the errors of his ways, he swore he would never forgive Windu for the murder of his father.[11]\n", "After being released from prison and forming a bounty hunter team, Boba became more ruthless than he had been previously, focused on achieving the goals of his mission. During the mission to Quarzite, Boba wanted to hand Pluma Sodi over to Otua Blank, despite her pleas for mercy. It was only Ventress' betrayal that allowed Sodi to escape.[14] As the years went by, and the Clone Wars gave way to the reign of the Galactic Empire, Boba became known for his lethality, going so far as to display trophies of his prey on his armor.[16]\n", "During the Clone Wars, Boba expressed aversion to being compared to clone troopers. He did not want to see himself as being the same as other young clones or a clone in general, as he was the one who Jango Fett considered to be his son.[9] He nonetheless did not care to harm his fellow clones,[11] and briefly considered leaving his bounty hunter companions to stay with the other young clones who escaped the Endurance.[9]\n"], "quotes": [["\"Pure genetic replication. No tampering with the structure to make it more docile, no behavior modification and no growth acceleration.\"", "―Lama Su describes the cloning procedure that created Boba Fett[src]"]], "figure_captions": ["Boba Fett's mugshot"]}