{"id": "C-3PO", "name": "C-3PO", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/C-3PO", "personality": ["C-3PO was known for his polite, fastidious, and worry-prone personality. As a droid, he exhibited much loyalty and commitment to his masters and sought to serve them to his best ability. Throughout his operation life, C-3PO was able to work diligently for several masters including Anakin Skywalker,[2] Padmé Amidala,[28] Bail Organa,[12] and Luke Skywalker.[8] As a protocol droid, C-3PO could communicate in over seven million different forms of communication.[9] This allowed him to communicate with computer systems including those on the Millennium Falcon.[3]\n", "Unlike his astromech counterpart R2-D2, C-3PO liked to stick to routine and did not respond well to change. When placed in danger, C-3PO had a tendency to panic as shown on several occasions; including infiltrating a droid foundry on Geonosis[11] and a mission to steal Imperial disruptors on Lothal.[13] Despite his loyalty and commitment, C-3PO was generally unable to lie or to keep secrets due his programming. In fact, after the Hijacking of the Harbinger, during which Task Force 99 captured him, they remarked to Darth Vader that they were unable to get him to shut up![57] Despite the droid's talkative nature, he was able to keep Anakin and Padmé's marriage secret. C-3PO's inability to lie came at a disadvantage when he and his companions were captured by Ewoks prior to the Battle of Endor.[15] Due to his general inability to keep secrets, Bail Organa arranged for him to receive a memory wipe in order to preserve the secret of Anakin and Padmé's offspring, Luke and Leia.[12]\n", "Threepio's programming, focused on etiquette and protocol,[8] impacted his personality and limited his behavior in several other ways. On Endor, he found it difficult to impersonate a deity due to his programming,[15] and during the attack on the Resistance fleet, he attempted to leave a mutiny in progress because it was not correct protocol.[56]\n", "C-3PO continued serving Leia Organa in her careers as New Republic senator[16] and subsequently Resistance General.[46] C-3PO managed General Organa's Resistance droid spy network.[49] Despite not being able to run or fight, C-3PO bravely stayed behind to hold back the First Order Agent Terex so that Poe Dameron and the spy droid N1-ZX could flee deeper into the caves. He used his language programming to harry Terex and his Ranc gang associates by summoning fjor-bats to attack them. C-3PO quipped that he was expendable and could be rebuilt.[52]\n"], "personality_quotes": [["\"It's all right, sir [Poe Dameron]. I'm only a droid. I am expendable. I can always be rebuilt. You however cannot.\"\"I don't know how things got to this point, Threepio... but thank you.\"", "―C-3PO and Poe[src]"]], "figure_captions": [], "quote": ["I am C-3PO, human-cyborg relations.", "―C-3PO", "Star Wars: Episode IV A New Hope"], "description": "C-3PO, sometimes spelled See-Threepio and often referred to simply as Threepio, was a 3PO unit protocol droid designed to interact with organics, programmed primarily for etiquette and protocol. He was fluent in over seven million forms of communication, and developed a fussy and worry-prone personality throughout his many decades of operation. Along with his counterpart, the astromech droid R2-D2, C-3PO constantly found himself directly involved in pivotal moments of galactic history, and aided in saving the galaxy on many occasions.\n"}