{"id": "Captain_Phasma", "name": "Phasma", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Captain_Phasma", "personality": ["Phasma was a human female[1] who stood at 2.0 meters tall.[3] She had pale skin, blue eyes, and soft gold hair. Cardinal regarded her as \"deadly attractive.\" While she was a member of the Scyre clan, she had dark green stripes painted under her eyes. Phasma was a fearsome and skilled warrior who excelled as a military leader and trainer.[1]\n", "From young, Phasma only cared for her own survival and was even willing to betray her family and clan. However, Phasma spared her older brother Keldo, whom she looked up to for his intelligence and leadership. While Keldo led the Scyre clan, Phasma commanded the tribe's warriors. Their relationship soured after Keldo refused to support Phasma's plan to eliminate the rival Claw clan and instead signed a peace treaty with them. Phasma later broke with Keldo after he refused to support her plan to help Brendol reach his ship in return for a better life offworld.[1]\n", "While Phasma had a loyal band of warriors, one of her underlings Siv came to doubt Phasma's leadership due to her willingness to break a truce and murder Balder, defy her brother Keldo, and abandon her tribe. Phasma eventually abandoned Siv after the latter disobeyed her order to execute the enemy gladiator Wranderous. Phasma's determination to seek a better life offworld from her barren homeworld of Parnassos led her to travel through the radioactive \"Dead Lands\" and to kill members of her clan including Keldo.[1]\n", "After joining the First Order, Phasma professed outward loyalty to the First Order.[1] She believed that a stormtrooper's loyalty was only to be given to the First Order as a whole, not to any group or individual. Phasma saw herself and her stormtrooper divisions as extensions of the will of Supreme Leader Snoke and looked down on sympathy in her ranks.[7] Phasma, privately, also believed that the meddling of politics ultimately led to ineffective ranks among the past stormtroopers of the former Galactic Empire, and sought to ensure herself that only the best soldiers were worthy of joining the stormtrooper ranks.[6] She believed that the First Order was stronger than the Empire, and was proud of the crucible of tests she and her compatriots endured to achieve that strength. Phasma disapproved of Terex's indulgences, which included keeping alien slaves and drinking Wookiee-brewed brandy with Kessel spice.[8]\n", "However, in spite of her outward loyalty to the First Order and to her unit, she in truth had zero loyalty to anyone except for herself, and her past was wrought with betraying anyone that placed trust in her, including her own family and clan.[1] As such, she was perfectly willing to exploit her reputation as the \"mother\" of the Stormtrooper Corps of the First Order to ensure her own survival,[22] and she used her knowledge of memorizing all of the serial numbers of the stormtroopers under her direct command to know which ones she should eliminate in the future.[6][1]\n", "Captain Cardinal even speculated before his disappearance that, once the First Order's aims differed from Phasma's own aims, she would not hesitate to betray the organization.[1] This was best demonstrated with the destruction of Starkiller Base, where she proceeded to not only deactivate Starkiller's shields before then—though she doubted the Resistance's chances of success[2]—but also promptly proceeded to kill anyone who might have deduced her to be the one responsible,[25] and even framed another officer, Lieutenant Rivas, for the deed.[22]\n", "Captain Phasma was also a skilled orator who was able to manipulate the Lupr'or colonists on Luprora into attacking the aggressive indigenous R'ora species in order to fight for their survival as a species. In private, Phasma regarded her Lupr'or followers as cannon fodder who would enable her to distract the R'ora so that she could eliminate Rivas, whom the R'ora were holding captive.[24] Phasma also despised the Lupr'or as colonists who were trying to supplant the indigenous R'ora. She also believed that the Lupr'or were unsuitable to Luprora's evolution since they were unable to adapt to the rising sea levels unlike the aquatic R'ora.[25]\n", "Caring only for herself, Phasma regarded the TIE fighter pilot TN-3465 and the BB unit BB-K8 as instruments during her campaign to hunt down and kill Rivas in order to hide her secret role in lowering Starkiller Base's defenses. After eliminating Rivas, Phasma eliminated TN-3465 and BB-K8 in order to eliminate any lose ends. By presenting herself as a diligent member of the First Order who had eliminated a traitor, Phasma was able to avoid arousing General Hux's suspicion. Unaware that Phasma was primarily a survivor, Hux wrongfully believed that Phasma was wholly committed to the First Order even in the midst of crises.[25]\n", "If there was one thing that Phasma valued over survival, it was possibly revenge. She wanted to make Finn pay for forcing her to participate in Starkiller Base's destruction.[28] Phasma could not resist a faux-greeting to Finn upon his capture about the Supremacy. When the time came for the traitor's execution, she wanted to see him feel the pain and terror of the laser ax before the beheading.[27]\n", "Kylo Ren noted that despite the fact Phasma usually sided with Hux, he was glad that she hadn't met her demise on Starkiller. He also noted that if the rumors about her being thrown into a trash compactor by saboteurs on Starkiller were true, a trash compactor would have never ended the career of a soldier of Phasma's stature.[29]\n"], "quotes": [["\"Because it makes it clear that you can't win against Phasma. Not you. Not anyone. No one will go as far as she will to survive.\"", "―Vi Moradi, to Captain Cardinal[src]"]], "figure_captions": ["Phasma was ruthless in executing her duties"]}