{"id": "Darth_Vader", "name": "Anakin Skywalker", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Darth_Vader", "personality": ["As a child, Anakin Skywalker showed kindness and generosity, as exemplified by his willingness to risk his life in a podrace to help Qui-Gon Jinn and Padmé Amidala depart Tatooine at a time of need. He was not shy to express how he felt, and showed a reluctance to leave those he loved behind. Indeed, Skywalker had a deep-seated fear of loss, especially in regards to his mother, which Master Yoda sensed when he was being tested by the Jedi Council.[7] This fear of loss would follow Skywalker throughout his life and eventually led him down the path of the dark side,[8][9] particularly after the death of his mother, Shmi, carrying sadness, anger and guilt in his heart for years to come.[29] Similarly, his experiences as a slave would leave him with a deep resentment towards slavers.[101] Skywalker would mostly keep these feelings to himself, very rarely talking about them, even with those he trusted,[101][10] as he struggled to put his past behind him,[101] making an effort not to think about it.[20]\n", "As he grew older, Skywalker became cocky,[8] reckless,[45] impatient,[70][20] willful,[29] and cavalier,[26] despite Kenobi's efforts to train him as best as he could.[29] Confident and bold, he demonstrated a lack of subtlety, which Plo Koon once noted, was one of the many traits his Padawan, Ahsoka Tano, had adopted from him during her younger years.[71] Another was his tendency to disobey orders,[89] which he did whenever he thought they weren't the best way to solve problems,[90] and his cockiness.[93] Despite his many failings, Skywalker remained selfless,[102] willing to lay down his life for others,[45] and showed commitment to things greater than himself—the Jedi, the Republic, his friends,[102] and his wife.[9] Similarly, his relentless determination was rivaled by none,[99][102] except perhaps by that of his Padawan.[93] In some aspects, his journey as a mentor to Tano allowed him to mature and become more responsible. His emotional balance, however, was disrupted by the High Council's decision to expel Tano, when she was suspected of treachery, and her subsequent decision not to return to the Order when invited back.[116] His heroic feats during the Clone Wars eventually made him the symbol of the Jedi Order, held by many as the warrior-savior of the Galactic Republic, earning the nickname of the \"Hero With No Fear\" as he was praised by Supreme Chancellor Palpatine, applauded by the Galactic Senate and glorified on the HoloNet News.[244]\n", "With a penchant to show off,[69][129][133] Skywalker was a something of a maverick, though not in the same way as his late informal Jedi Master Qui-Gon Jinn, known among the Jedi for being passionate and impulsive.[29][61] Most of his peers trusted him, and his ingenuity, although some Jedi did consider him to have a simplistic approach to logic.[60][92] The 501st Legion and its captain, Rex, considered his tactics reckless and unorthodox, but appreciated the fact that he would never risk their lives without risking his as well.[245] Skywalker also showed eagerness and dedication to ending the Clone Wars, which he believed, by their final days, were destroying the principles of the Republic.[9]\n", "Though he was committed to the Jedi Order ever since he joined, Skywalker was deeply conflicted about it, wanting to walk away from the Order at several points before[24] and during the Clone Wars,[115] particularly because of his love and secret marriage to Padmé Amidala,[8] whom he believed he couldn't live without.[9] Overprotective and prone to jealousy, Skywalker's affection for her was suspected by some of his peers and, at least, Obi-Wan Kenobi, Ahsoka Tano and Rush Clovis knew for certain that he was attracted to her.[123] Another source of conflict was his dwindling trust and increasing resentment toward the Jedi High Council, which he felt distrusted him and was not treating him with enough respect.[106][117] These fears and resentments were further fomented by Palpatine's manipulations, and some of the Council's (and Kenobi's) decisions,[115][72] as well as his friendship with Chancellor Palpatine, of whom the Council was wary and kept secrets from.[135][9]\n", "Skywalker struggled to keep his emotions in check—especially his anger.[8][101][123] He cared deeply about his friends, and according to Ahsoka Tano, \"looked out for them until the end.\"[139] Loyal to a fault, Skywalker was willing to do anything to protect those he cared about, often resorting to the dark side of the Force to do so.[62][102][116][9] Throughout the Clone Wars (as Palpatine had planned), Skywalker's anger would push him ever closer to the dark side, but his fall was ultimately triggered by his fear of loss after experiencing visions of Amidala dying in childbirth[9] and his desire to obtain enough power to save his loved ones.[8] He would justify his immoral and ruthless actions as all being necessary to bring peace, justice and order to the galaxy.[9]\n", "Upon his conversion to the dark side, Skywalker's arrogant streak became even more prominent, and for a short time he believed himself to be even more powerful than Palpatine. His impulsiveness and tendency to act in anger were both magnified as well; for instance, when he discovered that Kenobi had stowed away on his wife's ship when she came to Mustafar, he immediately assumed that she was conspiring with his former master and strangled her with the Force. Despite this, Vader did experience a significant level of regret for the decisions that he had made to save Amidala.[9]\n", "However, all that changed following his defeat at Kenobi's hands. Having lost all that he had turned to the dark side to preserve, and having no other path, he fully embraced the dark side and became, in Palpatine's words, a \"true Sith.\"[83] Consequently, he devoted himself fully to furthering the development of his relationship to the Force, and the expansion of his power. Both due to what Palpatine taught him about the relationship between Sith master and apprentice[168] and his own personal tendencies, Vader in his early apprenticeship was completely devoted to the Emperor.[83] However, as his power grew, and particularly after learning of his son's existence, this devotion dwindled considerably.[213]\n", "Over the years Vader developed a new, more hardened and disciplined persona. He became utterly ruthless,[185] virtually devoid of mercy,[11] and was known to occasionally kill his own officers for their failures.[13] Eventually, the identity of Vader in the Empire had arisen tales of a dark armored humanoid who served as the Emperor's most trusted enforcer and was considered to be the most feared individual in the Empire. Rumors circulated that he lived in a castle in a world of lava, and that he wielded a red lightsaber, suggesting a connection to the Sith. The few who had interacted with him stated that they were unsure whether the individual behind the armor was a living person, a droid or a clone trooper. Many feared that if Vader were ever defeated, a number of duplicates would be activated in his place.[246] The Sith Lord also had absolutely no qualms about using torture to accomplish his goals.[83]\n", "Considered to be the Empire's first terror weapon and noted to employ antiquated diction,[83] he was tenacious and unstoppable,[143] and made most Imperial naval officers uncomfortable.[168] Contrary to the rocky relationships he had with most Imperial officers, his rapport with his stormtroopers mirrored in many ways his former persona's relationship to the Republic's clone troopers.[83] In fact, his standing with the rank and file was such that it was known as far as Ryloth that the stormtrooper corps \"almost worshiped him.\"[168] Part of his reputation was that he would normally be quiet (and thus his presence made for a good implied threat to others) whereas shows of passivity were not.[195] Indeed, it was well known that he usually preferred to oversee operations personally,[183] using action to block out any intruding feelings.[17] He was frequently at odds with those who lacked faith in the Force, finding it \"disturbing\"[11] or even blasphemous.[192]\n", "Vader often used pressurized meditation chambers that allowed him to remain without his helm—the neural connection to his armor—during which he felt the perpetual pain[168] that Kenobi had inflicted[9] on his flesh. During such sessions, he would meditate to use this pain to feed his hate, which in turn fed his strength,[168] and he never laughed.[17] Claiming not to feel regret, and yet haunted by his past, and the screams of his wife,[168] he was determined to never talk about his old life,[83][168] and detested all that reminded him of his past self (whom he deemed to be weak).[11] He dared not remember such a period of his life, which he hated; indeed, through the use of the dark side, he kept his memories as Anakin Skywalker buried, although it took great effort even after twenty years of practice.[17] Although he retained access to Skywalker's memories and experience, this burial was such that he refused to even think of Skywalker as himself, referring to internally to Skywalker's memories as those of \"The Jedi.\"[118] However, his rapport with the stormtroopers who supported him, and the technique he displayed in wielding his crimson lightsaber, gave him away.[83] Much like before, Vader remained an impatient man, although he tempered his impulses with the faithful obedience he gave to his Sith master, Sidious.[17]\n", "Following the discovery of his parenthood, Vader became emotionally conflicted.[141] Vader's thoughts of his son, Luke, led to thoughts of his late wife, the woman he loved and destroyed—thoughts he could not allow. Memories would resurface whenever he felt Luke near him, and so, believed in erasing that part of his past. He had become afraid of his compassionate son; not because of his mastery of the Force or skill with a lightsaber, but because Luke could make him question the dark truths that had long ruled him.[17] In the eve of the Battle of Endor, Vader claimed it was too late for him, even as his son felt that there was still good left in him.[4] Vader would close off the questions with the dark side,[17] but he showed concern for his son in the end. He ultimately decided that he could not stand by while Luke was harmed, proving that there was still good in him before his death.[4] Vader became shocked upon hearing he was not a father of one child but two when he telapathelly sensed his daughter, Leia, through Luke. Before dying, Skywalker told Luke to tell Leia that he was right about him as he wanted his daughter to remember him as a good person in the end.\n", "As a teenager, he liked to explore and see new places,[21] and fix things.[20] Sometimes, when he felt troubled during his time as a Jedi, Skywalker would retire to his highly customized quarters in the Temple, wherein he would tinker with droids to pass the time.[123] In a similar fashion, he would keep the ship Twilight during the Clone Wars,[10][112] since the freighter offered Skywalker plenty of opportunities for tinkering with machinery.[247] As Vader, he would continue to repair his starfighters himself,[83] and the act of repairing things would be akin to a form of meditation for him.[168]\n", "Skywalker had first met Amidala when she posed as a handmaiden and commoner at Watto's shop in Mos Espa. There, Skywalker asked if she was an Angel. He was then surprised when Padmé revealed herself to be the Queen. Following the Battle of Naboo[7] and ten years later, Skywalker met with her at apartment following an assassination attempt on her. As Skywalker continued to protect Amidala from further attempts, he started to fall in love with her. Amidala also started to fall in love with him. Skywalker and Amidala, following the Battle of Geonosis, married in secret.[8]\n", "During the Clone Wars, Skywalker and Amidala rarely saw each other due the Clone Wars and keeping their secret. Skywalker would rescue and protect Amidala from numerous dangers such as General Grievous,[38] the Zillo Beast,[57] and the Blue Shadow Virus.[48] Skywalker also felt jealous towards Amidala's close friend, Senator Rush Clovis of Scipio. Despite Amidala's assurances that it was over between her and Clovis, Skywalker felt uneasy when she accepted the Jedi Council's mission to spy on Clovis. After leaving Cato Neimoidia, Skywalker assured Amidala that he never doubted her. Later, however, Skywalker did not completely trust Clovis with Amidala.[122] Skywalker attacked Clovis when he tried to kiss Amidala, but Amidala thought they should not see each other for awhile.[123] When Clovis appeared to have rejoined the Separatists, Skywalker led his forces and personally attempted to rescue Amidala.[124]\n", "When Amidala revealed that she was pregnant, Skywalker had premonitions about Amidala dying in childbirth. Skywalker's fear eventually led him into the dark side and on Mustafar, Skywalker Force choked her when he believed that she brought Kenobi to kill him. Following his duel with Kenobi, Skywalker continued to feel Amidala. However, the Emperor told Vader that in his anger he killed her. Skywalker, now Darth Vader, mourned her and gave in to his anger, destroying the medical droids surrounding him.[9] Vader could never let go of the agony caused by killing his wife.[17] Vader eventually discovered that Amidala had given birth to a son, Luke Skywalker,[196] and a daughter, Leia Organa.[4]\n"], "personality_quotes": [["\"Cavalier? You're cavalier all the time and no one says anything about it.\"\"I'm just better at it, that's all.\"", "―Obi-Wan Kenobi to Anakin Skywalker — Listen (file info)[src]"]], "figure_captions": ["Anakin Skywalker was a gifted yet unorthodox Jedi Knight who rose to prominence during the Clone Wars.", "Darth Vader was the dreaded enforcer of his Sith Master, Emperor Palpatine."], "quote": ["You are the Chosen One. You have brought balance to this world. Stay on this path and you will do it again… for the galaxy. But beware… your heart…", "―The Father's last words, to Anakin Skywalker", "Ghosts of Mortis"], "description": "Anakin Skywalker, a Force-sensitive human male, was a Jedi Knight of the Galactic Republic and the Chosen One of the Force. During the Clone Wars, his accomplishments as a battlefield commander earned him the Hero With No Fear moniker. After turning to the dark side of the Force, he became known as Darth Vader—Dark Lord of the Sith and apprentice to Emperor Darth Sidious. As a Sith Lord, Vader turned against his former comrades and hunted the surviving Jedi into near extinction. He became an enforcer of the Galactic Empire, who worked to crush the Alliance to Restore the Republic for opposing his Sith Master's will. Yet despite his actions as Darth Vader, a glimmer of the light side of the Force remained within the former Anakin Skywalker.\n"}