{"id": "Darth_Maul", "name": "Maul", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Darth_Maul", "personality": ["A former Sith Lord and a skilled warrior in his own right, Maul for most of his life came to embody the obsessive and frenzied aspects of Sith revenge. As a Sith apprentice, Maul sought revenge against the Jedi for their triumph over the Sith, and wanted to return the Sith to power over the galaxy.[1] After his exile and the restoration of his mind, Maul turned his thoughts of revenge towards the galaxy itself, declaring himself and his brother the true Sith Lords;[8] and especially towards Obi-Wan Kenobi, after the Jedi defeated him and forced him into exile after their duel on Naboo. He felt the vacuum from losing power, having known about the Clone Wars and intending to be part of it, only to learn that the Sith plans moved on without him. Maul was therefore willing to go to great lengths to achieve his vengeance, including slaughtering civilians and thrusting Mandalore into civil war to gain power and draw Kenobi out into the open.[6][24] He knew the Jedi would not ignore a call for help.[6]\n", "During his exile, Maul's mind was shattered. He became obsessed with revenge,[5] fuelled and kept alive only by his hatred for Kenobi,[6] despite losing his mind and many memories. His aggression and fear increased in his crazed condition, as Maul attacked Opress when he first encountered his brother on Lotho Minor.[5] It required magic from Mother Talzin to restore his mind, bringing him clarity again while still preserving his desire to seek revenge against those who had wronged him.[6] Maul’s personality was still deeply affected by his isolation and defeat by Kenobi. After his restoration, he lost much of his taciturn bearing and was prone to outbursts of anger and frustration whenever Kenobi came to mind.[8] However, he regained enough of his discipline to keep his brother Opress in line.[10]\n", "Maul's power made him crave dominance over the Sith and the galaxy, though he did not believe himself strong enough to take on his old mentor, Darth Sidious. It appeared that Sidious was the only being in the galaxy Maul ever feared, not only for his power, but also his sadistic nature. Still, Maul had enough courage to take on his former master in open combat alone, as though he had nothing left to lose.[24] And he would not break to either of Sidious and Darth Tyranus' torture sessions while incarcerated on Stygeon Prime.[25]\n", "Despite his ruthless and vindictive nature, Maul was not completely heartless. He showed genuine care for his brother, Savage Opress, and their mother, the Dathomir Witch Mother Talzin. Though Maul didn't always get along with Opress, they did genuinely care about each other; when Opress was killed by Sidious, Maul was grief-stricken and briefly mourned him before flying into a rage and attempting to avenge him.[24] Maul was extremely loyal to his mother and reciprocated her loving and protective affection for him. Even when cornered by Sidious and his minions, he refused to leave her behind and was devastated by her death.[27]\n", "Even after many years, Maul still held an extremely bitter grudge against Sidious and all those who served him for taking everything he cared about from him. He also developed a slight fondness for Ezra Bridger, seeing great potential in the boy's abilities, desiring him as an apprentice, and even saving his life twice. However, he sought entirely to manipulate Bridger and use him to further his own obsessive agenda for power and revenge, and attempted to kill Kanan Jarrus on two occasions in order to free Bridger of the Jedi's influence.[29]\n", "While still practising their beliefs, Maul disassociated himself from the Sith, mainly due to the Order's association with Sidious. Cunning and deceptive, Maul was perfectly willing to feign weakness to accomplish his purposes, or even side with the Jedi if necessary. He was not above taunting such \"allies,\" as evidenced by his calling Ahsoka \"Lady Tano\" and \"a part-timer\" in mockery of her departure from the Jedi Order[29] as well as referring to Jarrus as \"Master Jedi.\"[30]\n", "Desiring hope, Maul kidnapped Bridger and Jarrus' rebel companions in a successful effort to force them to surrender the Sith holocron from Malachor and Kanan's Jedi holocron. He wanted to merge the holocrons in order to create the clarity of vision needed to see his ultimate desire: Kenobi's death by his hand. Maul also hoped to take Ezra as his apprentice. Despite his promise to Bridger that he would not harm his friends, Maul secretly made an attempt on Jarrus's life and ordered his droids to execute the other Spectres in an attempt to claim Bridger as his apprentice. Despite Jarrus convincing Bridger to close his eyes and stop the vision, Maul nonetheless learned that his old enemy Obi-Wan Kenobi was still alive.[30]\n", "Maul's still burning desire for vengeance against Kenobi led him to use his mastery of the dark side to torment Bridger in an effort to gain his attention. While Maul was aware of the high price of Nightsister magic, his desire to learn Kenobi's location led him to risk the wrath of these spirits. Due to their revelations, Maul came to believe that his destiny was linked to finding and killing Kenobi on Tatooine. Maul regarded Bridger as an excellent candidate to be his apprentice. However, Bridger's attachment and loyalty to his friends angered Maul, who chastised his desired apprentice as a \"disappointment\" for refusing to break the chains of the past.[31]\n", "Later, Maul's vendetta towards Kenobi led him to once again use his mastery of the Force to lure Bridger to Tatooine. Despite his hatred for Kenobi, he was able to reconcile with his adversary in his last moments. Maul passed away with the belief that Kenobi was protecting the Chosen One who would restore balance to the Force and avenge them by destroying the Sith.[2]\n"], "quotes": [["\"If you define yourself by your power to take life, a desire to dominate, to possess, then you have nothing.\"", "―Obi-Wan Kenobi, to Maul[src]"]], "figure_captions": ["Maul, at the time of the Rebellion.", "Maul, at the time of the Clone Wars."]}