{"id": "Finn", "name": "Finn", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Finn", "personality": ["Finn was a male human. During his time with the First Order, he wore the standard-issue stormtrooper armor. Following his desertion, he discarded his armor, but continued to wear the armor's body glove and shoes, and took to wearing Poe Dameron's jacket as a way to remember him. Upon discovering that Dameron was alive, Finn offered him his jacket back, but the pilot insisted he keep it.[4]\n", "While in service to the First Order, Finn was seen by his training cadre and his fellow soldiers as one of the best stormtroopers that the First Order had to offer. His instructors saw him as loyal to the First Order, as well as dutiful, brave, intelligent, and possessing the strength necessary to be a great stormtrooper and perhaps even eventually one of the group's officers.[12] Finn was trained to believe that the New Republic was depraved and that the First Order was necessary to bring law to a lawless galaxy, and everything he had seen of the galaxy was filtered through his training; the First Order showed him only what they wanted him to see, but he did not doubt its truth. Nonetheless, though as a cadet he was eager to be deployed and see the galaxy so he could serve the First Order and Supreme Leader Snoke,[5] he was plagued by doubt. That doubt came to a head on Jakku, when he refused to fire on the villagers and deserted from the First Order.[4]\n", "Despite his training and education by the First Order, Finn had a good heart and empathy for others. While deployed on Jakku, after witnessing his friend FN-2003 killed by Poe Dameron, he refused to fire on unarmed villagers. These two events shook his belief in the First Order, inspiring him to desert and free Dameron, and eventually help Rey and BB-8 and side with the Resistance.[4]\n", "Finn was also protective of those he cared about. He risked jeopardizing a training mission in order to save FN-2003,[5] and when seeing Rey being carried off by Kylo Ren, ran desperately to rescue her. He later accompanied Han Solo and Chewbacca on a mission to destroy the Starkiller Base's shield generator in order to rescue Rey.[4] As soon as he awoke from his comatose state, a result of his unsuccessful duel with Kylo Ren on Starkiller Base, he immediately inquired about Rey's well being.[6] He had a crush on Rey, partially what drove him to want to protect, help, and follow her to the point of Rose wondering if Rey had \"imprinted\" on him. Even after realizing that the conflict was greater than any one person, though, he still seemed to hold feelings for Rey, which kept him going throughout the Battle of Crait.[9]\n", "However, Finn was seen to be susceptible to his fear and stress at times, such as during his desertion of the First Order. He seemed desperate to escape their attention and would rather fly across the system than entertain the thought of facing his pursuers. At Maz Kanata's castle he almost abandoned Rey, Han Solo, and Chewbacca in an attempt to escape the conflict, but changed his mind and was later pulled into the battle anyway. He also panicked multiple times during his and Rey's escape from Jakku aboard the Millennium Falcon.[4] When he reunited with Rey outside of the mine on Crait he embraced her tightly, glad to be with her, safe once more.[6]\n", "Finn was courageous in battle once he had made his choice to fight. He immediately ran to battle Phasma when he and Rose were faced with her contingent of Stormtroopers on board the Supremacy's hangar, using the first weapon he could find, a Z6 Riot Control Baton, and ultimately was willing to go into battle and die for the Resistance without regard to his own life; he would rather die than let the First Order win.[6]\n", "As he had little experience with life outside of the conflict, he was initially taken with Canto Bight's glitz and glamour, until Rose showed him the extent of the corruption and evil at the heart of it, abusing fathiers and slave children.[6]\n"], "quotes": [["\"I've had a pretty messed up day, all right?!\"", "―Finn on his escape from the First Order[src]"]], "figure_captions": ["Awakened from his comatose state, the first question the protective Finn asks is \"Where's Rey?\"."]}