{"id": "General_Hux", "name": "Armitage Hux", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/General_Hux", "personality": ["Armitage Hux was a male human with red hair and pale skin. When he was a young child, his father Brendol Hux regarded him as a weak-willed boy.[8] In his childhood, Hux was frequently belittled by his father. Despite Brendol's disdain for his own child, both Gallius Rax and Rae Sloane recognized that Armitage had the potential to become a military commander of the First Order. Under Rax's influence, the boy grew more vicious and was willing to order his father's child soldiers to hurt each other in order to assert his authority.[6] From childhood, Hux was raised on stories of heroic Imperials and how the Empire had brought peace and order to the galaxy following the Clone Wars. Hux believed that the the galaxy needed to be saved from chaos and that the New Republic was too weak to rein in these problems.[9] Because he was born out of wedlock, he also held some incense against references to his mother, especially those done in a mocking light, which was best evident during the Evacuation of D'Qar, where Poe Dameron's insinuation that Leia wanted to give a message about Hux's mother was enough to have Hux angrily order for the ship to open fire on Dameron's squadron.[16]\n", "As an adult, General Hux was a methodical commander who continued his father's program of training stormtroopers from infancy. Hux was a scientific and technologically-minded man who had little patience and understanding for Force-wielders like Kylo Ren. Hux had an acrimonious relationship with Kylo Ren and the two competed for the favor of the First Order's Supreme Leader Snoke. This hatred often made Hux treat Kylo like he was inferior to him and address and talk to Kylo like an adult would to a child. This infuriated Kylo, and would turn out to be a bad decision for Hux in the future. Hux was also rankled by Kylo Ren's questioning of his faith in his men and methods. He also tried to deflect blame onto Kylo after First Order forces on Takodana failed to recover BB-8 and the map to Luke Skywalker.[3]\n", "He likewise hated Kylo Ren, to the extent that he secretly derived pleasure from whenever Kylo failed his mission or whenever Snoke reprimanded him, and also was glad that Kylo needed rescuing from the Starkiller Base after he was beaten by Rey, a lightsaber novice. Hux was also disgusted by Kylo's lack of self control and frequent emotional outbursts.[13] His disdain for Kylo was such that after Snoke was prematurely killed, he initially considered assassinating Kylo on the spot while the latter was still unconscious prior to his stirring forcing him to abandon that plan, and shortly afterward made clear he had zero intention of acknowledging Kylo as the new Supreme Leader, and only ended up acknowledging it after Kylo telekinetically strangled him. Even afterward, however, he made subtle jabs at Kylo's expense, as after the walkers attacked what appeared to be Luke Skywalker himself with a rain of blaster bolts on Kylo's orders, Hux proceeded to sarcastically ask if the blasts killed Skywalker before the cloud dispersed and revealed he was still present.[16]\n", "Due to his upbringing, Hux believed that he was destined to rule the galaxy. He regarded the New Republic as an illegitimate government that had to be destroyed in order to usher in the First Order. Hux believed that Starkiller Base held the key to retaking the galaxy from the New Republic.[9] Hux never saw the First Order as the restoration of the Empire, but rather a new and improved faction.[17] While Hux was distressed by the Resistance's destruction of Starkiller Base, he nevertheless complied with Snoke's orders to recover Kylo Ren and bring him to the Supreme Leader.[3]\n", "He also showed some degree of sadism, as evidenced during the late stages of the attack on the Resistance fleet, where he had the Supremacy pick off the various escaping U-55 orbital loadlifters.[16] He also was highly ambitious, wanting to have direct control over the Supremacy, although he was smart enough to know he should keep such desires buried lest he get negative attention from either Kylo Ren or Snoke.[13]\n", "Kylo Ren had always wondered why Snoke would keep Hux around. When this was brought to his attention, an amused Snoke revealed that for all his supposed weaknesses, Hux would always be a reliable asset.[16] Snoke, who used Hux as a tool, was unaware that Hux had ambitions of usurping him to take the title of Supreme Leader for himself.[17] Unfortunately for Hux, Ren had the same idea and took the position of Supreme Leader after killing Snoke, leading Hux to serve him.[16] However, as Hux was known to have ordered Phasma to kill his own father, Ren brought him wherever he went, like Crait, to supervise him and prevent any potential act of treason.[17]\n"], "quotes": [["\"You. Do you agree to do as I say? I want you to hit the boy to the right of you. Hard.\"", "―Armitage Hux, exercising power for the first time[src]"]], "figure_captions": ["General Armitage Hux was an ambitious officer who craved power and promoted technological innovation.", "Remorseless and driven by the desire for power, Hux caused the deaths of billions by giving the order to fire the Starkiller at the Hosnian system.", "Hux prided himself on the new generation of stormtroopers, all of whom were exceptionally trained and programmed from birth."]}