{"id": "Grand_Moff_Tarkin", "name": "Wilhuff Tarkin", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Grand_Moff_Tarkin", "personality": ["Wilhuff Tarkin was a human male who stood 1.85 meters tall[5] and had blue eyes. During the Clone Wars, he had auburn hair[8] which later turned gray by the time of the rebellion.[23] As a child, his parents instilled a sense of ruthlessness in their son by sending him into the untamed Carrion Plateau at the age of eleven. Through this experience, Tarkin came to believe that the strong and intelligent remained in power by maintaining control over those beneath them—that life was a constant struggle for survival. The lessons of Tarkin's childhood continued to influence him throughout his adolescent years, particularly in space combat where he killed a band of pirates while serving with the Outland Regions Security Force. Tarkin’s body was also covered in scarred wounds from blasterfire, claws of predators, and falls, collected throughout his life.[1] The ambitious Naboo politician Sheev Palpatine had a strong influence on Tarkin as well. Through Palpatine's influence, Tarkin pursued career paths in both law enforcement and government, serving first with the Judicial Department before gaining the governorship of his homeworld on the advice of his mentor.[5]\n", "With the outbreak of the Clone Wars, Tarkin opted for renewed military service following his tenure as governor of Eriadu.[5] As a captain in the Republic Navy,[8] he served under the command of the Jedi Generals due to their appointment as leaders of the Grand Army of the Republic, although he resented the Jedi Order for its independence from the bureaucracy and military hierarchy. He believed that the Jedi were ill-suited to lead the Galactic Republic's war effort due to their traditional role as peacekeepers, although this view did not apply to all members of the Order—having developed a grudging respect for the hardened warrior Even Piell and admiration for Anakin Skywalker. As an admiral, Tarkin remained resentful of the Jedi's independence and used the deaths of clone troopers in the bombing of the Jedi Temple to argue that the incident was a Republic military matter rather than an internal affair of the Order. Having made his case to the Jedi High Council, Tarkin sought to prosecute the defendant Ahsoka Tano to the full extent of Republic law, which included the penalty of death. While Tarkin ultimately failed to achieve his goal due to the confession of Barriss Offee, he listened with great interest[70] as the fallen Jedi[20] publicly denounced the Jedi Order[70] and the Republic[20] for their role in the Clone Wars.[70]\n", "As a loyal protégé of Palpatine, Tarkin became one of the strongest supporters of the New Order in the aftermath of the Republic's reorganization as the Galactic Empire. His tireless efforts to root out resistance to Palpatine's rule as Emperor was rewarded with a promotion to the rank of Grand Moff of the Outer Rim Territories. Over the course of his career under the Empire, Tarkin helped to consolidate the Empire's control of the galaxy through the use of ruthless tactics, overseeing mass arrests and executions of both Separatists and Republic loyalists on Antar 4. As Grand Moff, he did not tolerate failure and was keen on making examples of ineffectual officers by having them summarily executed. With the completion of the Death Star, Tarkin developed a simple and brutal philosophy—fear of the battle station's planet-killing superweapon would henceforth suppress all resistance to Imperial power.[70]\n", "In addition to his reputation as an ambitious and ruthless proponent of military power,[5] Tarkin was known for his sharp memory. He never forgot a favor or a slight and was capable of recalling people from meetings that took place over a decade before, even if he had only met them once. For example, when Ciena Ree greeted him via hologram, he recognized her from their encounter that took place when she was a child.[39] Although at times ruthless, Tarkin wasn't always uncaring. Upon learning that the citizens of Salient II had burnt their houses and fled the system, he told his adjutant he hoped they had taken their pets with them.[9] Although he was kind to both Ciena Ree and Thane Kyrell on Jelucan, this was only a deception to prove a point to Firmus Piett.[39]\n"], "personality_quotes": [["\"He's a heartless skeleton held together by the stiffness of his uniform.\"", "―Mon Mothma[src]"]], "figure_captions": ["Despite his respect for Piell and Skywalker, Tarkin was critical of the Jedi and their code of ethics.", "Angered by acts of failure, Tarkin resorted to execution as a method to motivate his subordinates.", "Tarkin displaying kindness to Ciena Ree and Thane Kyrell"], "quote": ["You may fire when ready.", "―Wilhuff Tarkin", "Star Wars: Episode IV A New Hope"], "description": "Wilhuff Tarkin was a human male who served the Galactic Republic and later the Galactic Empire. During the Clone Wars, Tarkin served as a Republic captain under Jedi Master Even Piell and was taken prisoner by the Confederacy of Independent Systems, before escaping with the help of a Jedi and clone trooper strike team. During the incident Piell was killed and Tarkin was later promoted to Admiral and served as prosecutor in the trial of Ahsoka Tano, who was framed for the bombing of the Jedi Temple hangar.\n"}