{"id": "Grand_Admiral_Thrawn", "name": "Mitth'raw'nuruodo", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Grand_Admiral_Thrawn", "personality": ["Grand Admiral Thrawn was a member of the Chiss species who possessed a calm and collected demeanor. He was a brilliant military strategist, known for his anticipation of enemy attacks and his own tactical precision. He was known to speak at least three languages; Cheunh, being his native tongue, Sy Bisti, being the language the Chiss use to communicate with traders, and Galactic Basic fluently after joining the Empire.[4] Thrawn worked to perfect the art of war. He had respect for his enemies, believing that in order to defeat a worthy opponent, one must understand them in every aspect, including their history and philosophy. In particular, Thrawn had a strong appreciation for art, and he believed that studying it could allow him to delve into the psyche of the people of the cultures that the artists belonged to. Thrawn's calm demeanor and suave sophisticated mannerisms masked his ruthlessness. Thrawn rarely wavered in his generally cool temperament, though at one point, he furiously grabbed Slavin by his uniform for regarding his collectible Kalikori as Twi'lek trash. He quickly regained his composure however and apologized to him for his emotional outburst.[8] This display may not have been an emotional outburst, however, but rather a calculated tactic on Thrawn's part. In a similar incident years earlier, Thrawn had apparently shouted in anger at a stormtrooper refusing to listen, but as he explained to his aide Eli Vanto he had in fact not been angry but had only broken his usual pattern of behavior, which he believed was an effective tool in dealing with people who would not listen to reason or change their normal pattern of behavior.[4]\n", "Thrawn was also polite and respectful, even towards his enemies, whom he generally tended to admire. Even when interrogating Hera Syndulla, he showed mannerly behavior despite their antagonistic relationship.[8] Thrawn did not have a high opinion of Konstantine and once sent him on a mission to deal with the Iron Squadron in the Mykapo system. Thrawn set a test for Konstantine by ordering the Admiral to depart with only a light cruiser in order to test his mettle. Konstantine underestimated the ingenuity and resourcefulness of the rebels there. Thrawn was astute enough to discern that Konstantine was lying when the latter tried to save face by claiming to have driven the rebels from the system. In fact, Thrawn was aware that the rebels had already evacuated their sympathizers from the system.[9]\n", "As a tactician, Thrawn sponsored a new initiative to develop starfighters that were equipped with deflector shields. He believed that this feature would give the Empire an edge over their rebel opponents, as he stated that even the smallest features can mean the difference between victory and defeat. Thrawn disliked incompetence and shoddy craftsmanship, personally engineering the death of rebel agent Morad Sumar (Thrawn was unaware that Morad was a rebel agent) by forcing him to ride a faulty speeder bike. After Morad's death, Thrawn informed the workers present at the scene that they would be personally testing each machine they built.[6]\n", "Thrawn's appreciation for art and his determination to defeat the rebellion led him to amass a vast collection of images and objects related to the crew of the rebel ship Ghost, who had outsmarted his predecessors. In addition, Thrawn's scrutiny of Lyste and Kallus' reports following the rebel infiltration of the Lothal Imperial factory led him to realize that the Empire had a spy within their ranks. Thrawn believed that interrogating all Imperial personnel would alert the traitor. Instead, he advocated engineering a trap for the traitor that would turn them into an asset of the Empire.[6]\n", "Thrawn was willing to take high risks as shown when he dispatched E-XD infiltrator droids to hunt for the Phoenix Squadron's Chopper Base. Despite the loss of a Star Destroyer, Thrawn succeeded in narrowing the the search for the rebel base from possibly thousands to 94 worlds.[11] Agent Kallus later tried to elude Thrawn's hunt for Fulcrum by planting clues that incriminated Lieutenant Lyste. However, Thrawn discovered Kallus' deception and decided to manipulate the traitorous ISB agent into helping him find the rebel base.[12]\n", "While other Imperial commanders overlooked the threat posed by rebel droids such as Chopper, Thrawn kept a catalog on these droids which he circulated to his intelligence operatives. This information enabled LT-319 to embark on an ambitious plot to hijack the Ghost and find the location of Chopper Base.[15]\n", "In an effort to find the location of Chopper Base, Thrawn set a trap for Kallus by revealing that his spies were aware that the rebels were planning to attack Lothal. Cross-referencing his knowledge of ancient Lothalian art with the trajectories of Dodonna's Massassi Group and Kallus' Fulcrum transmissions, Thrawn deduced that Chopper Base was in the Atollon system. As a career officer, Thrawn was not interested in personal glory but was only concerned with yielding results for his Emperor. His interest in the bigger game irked Konstantine, who was only interested in personal glory. Thrawn was angered by Konstantine's incompetence, as his folly ruined Thrawn's chance of crushing the rebellion once and for all.[17]\n", "Thrawn was also an excellent ground commander. To test the mettle of the rebels, he orbitally bombarded Chopper Base. When it was still standing due to a shield generator, Thrawn decided to test their strength by sacrificing several AT-DPs. Thrawn was skilled at coordinating both his ground and starfighter forces and also preferred to lead his men from the front. As a scientifically-minded man, Thrawn was unperturbed by mystical threats like Bendu as seen when he used the combined firepower of his troops and walkers to bring down the mystical Force-being. Thrawn was not intimidated by Bendu and tried to destroy the Force-wielding being by shooting him with his blaster, only to be surprised and unnerved by his sudden disappearance and mocking laughter.[17]\n", "As a seasoned military commander, Thrawn advised Governor Tiber Saxon to capture Sabine Wren in order to utilize the Arc Pulse Generator's full potential. While impressed by the weapon's ability to incinerate Mandalorian warriors by reacting with the beskar alloy in their armor, he believed that Saxon did not know how to utilize the weapon's full potential.[21]\n", "Due to his combat experience, Thrawn was not the least startled when Ezra and Sabine flew their stolen TIE/D Defender Elite inches above him. Maintaining a steely resolve, Thrawn instead fired back. Thrawn was not upset by the loss of the TIE/D Defender Elite prototype and instead used the rebels' theft as an opportunity to test the fighter's flight capabilities and weapons systems against TIE/IN Interceptors.[22] Thrawn's growing frustration with Governor Pryce's ability to capture the Spectres and Ryder Azadi's cell and stop the theft of the TIE/D Defender Elite led him to dispatched the Noghri assassin Rukh to hunt down and eliminate the insurgents.[23]\n", "When General Syndulla attacked Lothal with a strike force of X-wings, Thrawn unleashed the power of his Seventh Fleet on them. Despite using his ships to form a blockade, Thrawn's plan was undermined when Commander Skerris defied his orders to cease pursuing Hera's X-wing. Due to Skerris' insubordination, Hera was able to destroy his TIE Defender Elite, causing it to crash into an Imperial light cruiser, which collided with a Star Destroyer. This created a gap which allowed Hera and a few rebel pilots to land in Capital City. Thrawn was not worried that a few ships escaped his blockade because for one, many of the ships were destroyed, and two Thrawn personally had a second wave which consisted of TIE fighters and turbolaser cannons. [25]\n", "Thrawn's respect for his foe General Syndulla led him to visit her while she was being interrogated by Governor Pryce. While Thrawn regarded looking after her Kalikori as a sign of respect, Hera was insulted that her enemy would hold a valuable family heirloom. Thrawn believed that his TIE Defender project was a better investment than Orson Krennic's Death Star project and traveled to Coruscant to lobby the Emperor.[26]\n", "Thrawn's efforts came to naught when Governor Pryce destroyed the Lothal City fuel depot in an effort to destroy the Spectres, in the process damaging the TIE Defender factory. While Pryce managed to kill Kanan Jarrus, Thrawn thought that the loss of the TIE Defender factory outweighed the Jedi Knight's death. Frustrated with Pryce's incompetence, Thrawn resolved to deal with her when he returned to Lothal.[27]\n", "As a tactician, Thrawn detected a flaw in Ezra's plan to trap the Imperial garrison in the \"Dome\", a mobile Imperial Planetary Occupation Facility. With his army in a safe position, Thrawn used the Chimaera to bombard Capital City. Knowing Ezra's Jedi training made him put others first, Thrawn was willing to kill civilians and destroy buildings in order to force Ezra to meet him aboard the Chimaera to discuss his surrender.[31]\n", "Thrawn regarded the Jedi as rosy-eyed idealists who were willing to sacrifice strategically-sound choices for perceived \"just and moral\" reasons. Thrawn regarded the Force as a weapon and believed that the Jedi did not know how to use it. Intending to destroy Lothal, Thrawn collected Sabine's art since he regarded her as a talented artist and believed that he was safeguarding her legacy.[31]\n", "Thrawn displayed fear, anger, and frustration when Ezra's Purrgil allies attacked his fleet and latched onto the Chimaera. Despite his brilliant tactics, Thrawn for the first time was outmaneuvered by a lesser opponent, as he had no way of predicting that Ezra would unleash the Purrgil. It should be noted however, that before the arrival of the Purrgil Thrawn has stated the rebels had only created \"a momentary setback,\" implying the Grand Admiral did have a back up plan. Though he was surrounded by purrgil tentacles, Thrawn accepted his fate and maintained a steely resolve, telling Ezra that the same fate awaited him.[31]\n"], "personality_quotes": [["\"My apologies, Captain Slavin. I'd forgotten not everyone is able to appreciate art as I do.\"", "―Thrawn, to Slavin[src]"]], "figure_captions": ["Thrawn's calm demeanor occasionally gave way to frustration with his subordinates who lacked his appreciation for art.", "Grand Admiral Thrawn"], "quote": ["There are things in the universe that are simply and purely evil. A warrior does not seek to understand them, or to compromise with them. He seeks only to obliterate them.", "―Thrawn", "Thrawn "], "description": "Mitth'raw'nuruodo, more commonly known as Thrawn, was a Chiss male officer and Grand Admiral of the Imperial Navy during the reign of the Galactic Empire. An alien Imperial officer with striking blue skin, red eyes, and an angular face, Thrawn was well known as a brilliant and ruthless strategist. He believed that in order to achieve victory in war, one must know their enemy. As such, he dedicated himself to understanding the philosophy, art, and culture of his opponents, which included the Twi'leks of Ryloth and the warriors of Mandalore. When Governor Arihnda Pryce requested a strong commander capable of defeating the rebels on Lothal, Grand Admiral Thrawn accepted the challenge, intending to dismantle the rebellion one piece at a time.\n"}