{"id": "Han_Solo", "name": "Han Solo", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Han_Solo", "personality": ["Han Solo was a cynical, disagreeable individual whose primary concern was gaining enough money to preserve his own life. He and Luke immediately disliked each other: Solo found Luke irritating and overly eager, and his open disdain for Kenobi's beliefs and actions did little to change Luke's initial view of Solo as an extortionist.[5] However, after Han demonstrated his bravery on the Death Star and proved his loyalty, they became genuine friends, and soon after, Han would become loyal to the Rebellion. Aside from his seemingly self-centered ways, Han was actually very loyal to his friends, and a good man.[13]\n", "Han's wife, Leia, described him as someone who had no patience for speeches or memorials, and was allergic to politics and suspicious of causes. However, according to Leia, he also hated bullies and could never stand down when confronted with them, and when he took on a difficult mission, he was never interested in knowing the odds of success.[26]\n", "Following the Battle of Endor, Han endeavored to honor Chewie's \"life debt\" to him by liberating the enslaved Wookiee homeworld from Imperial occupation.[16] Despite several setbacks, Han persisted with his mission. Together, Han and Chewie led a combined force of Wookiees, rebels, and mercenaries to spark a successful Wookiee uprising against the Empire. During the campaign, Han displayed resourcefulness and proved a cunning and effective commander. After the liberation of Kashyyyk, Han freed Chewbacca of his life debt so that he could reunite with his family.[117]\n", "Han Solo initially found the task of fatherhood challenging. While he envied Leia's Force connection to their son, Ben Solo, Han found that he had a special bond as a father.[122] Due to their different interests and personalities, Solo and his wife lived separate lives. While she served as a New Republic senator, Solo managed a shipping company and organized starship races. Still, Solo kept in regular contact with his wife Leia. On one occasion, he rescued Leia from a pro-Imperial militia known as the Amaxine warriors.[17]\n", "Solo and Leia took their son's descent to the dark side badly. Their marriage collapsed, and the two separated. With his shipping business floundering, Han resumed smuggling and incurred large debts with the criminal gangs Kanjiklub and the Guavian Death Gang. Solo regained his purpose when the scavenger Rey and the former stormtrooper Finn sought his help in smuggling the droid BB-8, who was carrying a Map to Skywalker, to the Resistance. After reconciling with his wife, General Leia, Solo decided to try to bring his son back. Despite an emotional reunion between father and son, Kylo Ren killed his father, Han. Han's death devastated Leia, Chewbacca, and Rey, who had come to view him as a father figure.[6] BB-8 would then remember Solo as a \"maniac,\" to which R2-D2 clarified that Solo was \"one of the best maniacs.\"[134]\n"], "quotes": [["\"Han fancied himself a scoundrel. But he wasn't. He loved freedom—for himself, certainly, but for everybody else in the galaxy, too. And time after time, he was willing to fight for that freedom. He didn't want to know the odds in that fight—because he’d already made up his mind that he'd prevail. And time after time, somehow, he did.\"", "―Leia Organa[src]"]], "figure_captions": ["Solo tells Chewie how much he likes the Wookiee's bowcaster.", "Han Solo, after acquiring the Millennium Falcon."]}