{"id": "Iden_Versio", "name": "Iden Versio", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Iden_Versio", "personality": ["Before the evacuation of Vardos, Versio saw Emperor Palpatine as a great leader, and was fiercely dedicated to the Empire, due to her father's Imperial background and her planet's pro-Imperial sentiments. She believed that the Empire was the best hope for stability and peace in the galaxy, and existed to protect its citizens from terrorism and atrocities. She believed that the Empire should protect its own, and made a point to assist trapped stormtroopers during the Battle of Endor.[3]\n", "Iden possessed a stoic and occasionally intense personality, likely a product of her Imperial background. She recovered quickly from shock and thought quickly on her feet. However, she was also compassionate towards civilians and friendly, though professional, with her squadmates and crew.[3]\n", "Following the destruction of the Death Star II, however, Iden became increasingly disillusioned with the Empire. She expressed anger at how the Emperor's attempted trap at Endor had led to military disaster, and grew increasingly frustrated with and suspicious of the opaque and secretive nature of Operation: Cinder. She thought the Empire was turning away from what it was meant to be. This ultimately led to her deserting the Empire during Operation: Cinder's destruction of Vardos, which she saw as a betrayal of Imperial values.[3]\n", "After her defection, her political views came to change. She viewed the Empire as tyrants for destroying her homeworld and countless others. Iden took a liking to the rebels during the subsequent Battle of Naboo, and eventually joined them full-time.[3]\n"], "personality_quotes": [["\"She was a complicated woman but the galaxy was far better with her in it.\"", "―General Leia Organa on Iden Versio[src]"]], "figure_captions": ["Versio piloting her TIE/LN starfighter for Inferno Squad."], "quote": ["We fight so that others can live. And if we die, it better be for the same reason.", "―Iden Versio, to Zay Versio", "Star Wars Battlefront II"], "description": "Iden Versio was a human female soldier who served in the military of the Galactic Empire. A TIE fighter pilot in the Imperial Starfighter Corps, Iden became Commander of Inferno Squad, an Imperial Special Forces commando unit assembled by her father, Admiral Garrick Versio, in response to the destruction of the Death Star. Along with Agents Gideon Hask, Del Meeko, and Seyn Marana, she infiltrated the Dreamers and successfully destroyed them, though Marana died in the mission. Inferno Squad would later go on to participate in and conduct special operations for the Empire in the Galactic Civil War, and, in 4 ABY, participated in the Battle of Endor, which saw the death of Emperor Palpatine and the destruction of the second Death Star, resulting in the fracturing of the Empire with the lack of a line of succession and broken chain of command.\n"}