{"id": "Jango_Fett", "name": "Jango Fett", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Jango_Fett", "personality": ["Jango Fett was a ruthless[5] killer, an expert fighter, and reputedly the best bounty hunter in the galaxy.[6] He was also an honorable man according to his friend, the pirate Hondo Ohnaka.[12] As a combatant, he was proficient in both marksmanship and unarmed combat. By the time of the Separatist Crisis, his face had several scars that he chose to conceal with a Mandalorian helmet. In combat, Fett favored the advantage of speed and height that his jetpack provided him with against his opponents.[6] During a bounty hunting assignment, he warned Zam Wesell to be careful when handling a pair of poisonous kouhuns. However, he later killed his partner to prevent Wesell from revealing his involvement in Amidala's assassination attempt to her Jedi captors.[4]\n", "As a mercenary, Fett favored financial rewards for his services. Although he was generously compensated for his service as a clone template, he surprised his Kaminoan benefactors by requesting the creation of a clone for himself. This clone was unaltered in accordance with Fett's wishes, unlike the others who were modified for growth acceleration and enhanced docility. Fett provided the clone with a name, Boba Fett, and chose to raise him as his own.[4] He cared greatly for his \"son,\" who learned combat skills and ruthlessness from the elder Fett.[5]\n", "He was loyal to his employers whilst they retained his service as a mercenary. After Wesell failed in her first attempt on Amidala's life, Fett set a new plan into action and emphasized to his partner that their employer's patience was waning. He later served as Count Dooku's personal bodyguard during the battle between the Jedi and Separatists.[4] Despite his combat skills, Fett was no match for Mace Windu[6]—the Jedi Order's greatest champion[20]—who severed the hunter's head from his neck with one swing of his amethyst-bladed lightsaber.[6]\n", "Fett was a human[5] male who stood at 1.83 meters.[6] He had black hair, brown eyes, and tan skin.[4]\n"], "quotes": [["\"I'm just a simple man trying to make my way in the universe.\"", "―Jango Fett[src]"]], "figure_captions": ["Fett was known as the galaxy's best bounty hunter in his time.", "Fett passed his skills onto his \"son,\" Boba, whom he cared for."]}