{"id": "Jyn_Erso", "name": "Jyn Erso", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Jyn_Erso", "personality": ["Standing at 1.6 meters in height,[4] Jyn Erso was a human female with short brown hair, green eyes, and light skin.[5] Even as a small child, Jyn began developing a rebellious attitude[1] but had a clear sense of right and wrong gained from her parents while growing up on Lah'mu.[4] During her time with Saw Gerrera's insurgents, she developed a strong bond with the extremists. After being abandoned at sixteen, Jyn was forced to adapt and developed fighting skills and a keen knowledge of the galactic underworld.[4] Initially, Jyn cared little about the Rebels' cause, but after watching the hologram message from her father, Jyn realized how important it was that the Empire be rid from the galaxy and sacrificed herself for their cause.[5]\n", "As a result of being trained by Saw Gerrera and being abandoned, she wielded a calm yet cold demeanor in interactions with others or when completing tasks. That being said, the pain she held on to was expressed when seeing her father's hologram message, becoming teary-eyed, falling to her knees once the message had finished. In addition, she was aggressive and distrusting, fighting off the Rebellion squad that was sent to rescue her, and keeping others at arms length until the battle at Scarif. Despite her aggressive and cold demeanor, she showed herself to be selfless and caring, saving a child from death during a battle against stormtroopers on Jedha.[5]\n", "Jyn's relationship with Andor was complicated, as the two didn't trust one another when meeting. After learning that the Alliance ordered him to kill Galen, she learned of his experience from the war, and the two would later become respectful allies once they disobey orders and headed to Scarif. Her relationship with K-2S0 was distasteful, with the latter having restrained her when she attacked the squad that was sent to rescue her. Despite this, K-2S0 showed himself to care for Jyn, saying he will do anything for her, and sacrificing himself for her and Andor in his last moments.[5]\n"], "quotes": [["\"Jyn, I think, never knew the effect she had on others—never realized the intensity of her own humanity or the presence she brought to a room. She was, as expected, troubled and quarrelsome; she was also impossible to ignore or forget.\"", "―Mon Mothma[src]"]], "figure_captions": ["Sergeant Jyn Erso during the Battle of Scarif."]}