{"id": "Kylo_Ren", "name": "Kylo Ren", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Kylo_Ren", "personality": ["Kylo Ren was the embodiment of conflict. The dark warrior, whose blood flowed with the legacy of some of the most powerful Jedi and Sith in galactic history, represented a focal point between the dark side and the light, a balance that made him a target of Supreme Leader Snoke so Ren's powers could be used to further the ambitions of the First Order. His fall to the dark side suppressed the boy who had once been named Ben Solo, a name that the Supreme Leader decreed could never be spoken in the First Order.[15]\n", "Even prior to his descent, however, Solo nonetheless had deep-seated insecurities rooted from Han Solo and Leia Organa's neglect in raising him.[15] He also believed that his parents thought he was disturbed, having overheard their conversations about him and his perceived lack of control over his innate Force abilities when he was still a child.[11] As a result, he interpreted his mother's decision to send him away for Jedi training as her way of abandoning him.[15] Despite his feelings of desertion, Ren did not hate his parents. Although the act of patricide led Rey—who did not understand the dark warrior's motive for killing his father—to believe that Ren loathed Han, Ren confessed that it was not hatred which had caused him to strike down the elder Solo.[21] Whereas he struggled against his conscience to take the life of his father,[38] he could not bring himself to commit matricide.[11]\n", "As Kylo Ren, he strove to bury his past, though the painful experiences and emotions from his youth were nonetheless something he could channel in order to further his own power. He ultimately hoped to build an immunity to the light, and to succeed where Darth Vader failed.[20] Although he intended to adhere fully to the dark side's teachings, he did ultimately have reservations to what he deemed to be unnecessary casualties, as evidenced by his speaking out against the ordered destruction of the Ileenium system before being outvoted by Snoke.[26] After the Battle of Starkiller Base, Ren reflected on his duel with Rey and how she regarded him as a \"monster.\" By then, he too saw himself as such.[21]\n", "Like Vader before him, Ren believed it was his destiny to rule over the weaker beings of the galaxy. He idolized his grandfather, but only the darkness that was Darth Vader—not the light of Anakin Skywalker. To Ren and the Supreme Leader, it was not poor strategy or arrogance that brought about the fall of the Galactic Empire: it was the sentimentality Vader held for his son, Luke Skywalker, which led to the Sith Lord's redemption; a foolish error in judgment and a momentary lapse in an otherwise great life. Ren believed that if Vader had not succumbed to the light, the Empire would have prevailed.[26] Although Ren admired Vader, he remained torn by the conflict from within and, therefore, afraid of never attaining the strength his grandfather possessed.[5] He kept a shrine to Vader in his personal chambers aboard the Finalizer, with the charred remains of the Sith Lord's helmet that had been recovered from his funeral pyre on Endor, as both a monument to the dark side's powers and its weakness.[20] He also kept a table of ashes made from the remains of his enemies.[39]\n", "Similar to his father, Han Solo, Ren had a sarcastic sense of humor. During the attack on Tuanul, he told Lor San Tekka that the latter was \"so right\" just before decapitating him, in reference to the old man's claim that Ren could not escape the truth about his heritage. Ren's sarcasm was also evident during the interrogation of Poe Dameron, whom the dark warrior asked if he was \"comfortable.\" Shortly afterward, Ren posed a rhetorical question to General Hux in regards to the reliability of First Order stormtroopers, only to answer his own query by denouncing all of them as potential traitors.[5]\n", "Though Ren feared the light and knew he had to avoid Vader's sentimentality,[20] the Supreme Leader nonetheless encouraged him to use the heritage of both the light and the dark, which only furthered Ren's inner conflict.[3] He studied both the skills of the Jedi and arcane dark side lore, contradictory teachings that gave him his power through discord. These teachings made the often angry dark warrior, one whose great temper was honed to be a weapon of the First Order, the archetype of a new kind of dark-side user that filled the void left behind when the Sith were destroyed during the Battle of Endor.[20]\n", "Ren struggled to control his temper, yet often failed in his efforts when dealing with setbacks[5] or criticism,[21] resulting in destructive tantrums such as the destruction of computer terminals as well as his interrogation chamber. His tantrums appeared to have been common enough that any nearby stormtrooper avoided the area he was currently destroying.[5] He struggled to keep his temper in check while listening to Snoke's disparaging remarks, only to feel the dark side rising within him to the point where he was physically unable to keep it contained, causing him to take a defiant stand against Snoke until his master subdued him with the Force. Once dismissed, however, Ren unleashed the dark side in the form of a violent outburst of emotion, destroying his helmet and damaging the elevator in the process.[21][11] In addition to his temperament, Ren was known for his lack of patience, particularly in meetings with members of High Command such as General Hux.[28]\n", "At first, Ren sought to regain his master's approval which he lost as a result of his failure at Starkiller Base, in spite of how Snoke's criticism angered him.[2] By then, his emotions were more churned up than ever before, as observed by Snoke, due to his patricidal actions.[11] He had believed that his father's death would complete his journey to the dark side; instead, it worsened the conflict within him as Ren continued to feel the pull to the light side of the Force.[26] Despite the effect that Han's death had on Ren, the dark warrior justified his father's death as a stepping stone in his destiny. Even so, the conflict within Ren[38] filled him with doubt and uncertainty when presented with two choices: to either kill his father or return home with him.[5] Ultimately, he killed Han out of a desperate need[5] to free himself from his emotional attachments.[25]\n", "The first time Ren met Rey, he was puzzled by the strange connection he felt with the scavenger from Jakku. He was further surprised by Rey's ability to access Ren's mind while he probed hers, allowing her to see his thoughts as well as his conflicts and doubts.[25] According to Snoke, Rey's connection with the Force was not the cause of Ren's inability to successfully probe her mind—it was the compassion he felt for her that got in the way. Ren was in denial for he could not fathom how he could feel anything other than hate for an enemy of the First Order.[26] Nevertheless, he offered to make Rey his apprentice after gauging her raw strength in the Force.[5] Even after she defeated him, Ren was preoccupied by what he sensed from her; that their destinies were somehow intertwined.[25] From that point forward, much of Ren's churning emotions were about Rey.[11]\n", "His emotional state became even more intense as their Force-bond grew stronger;[25] to Rey's surprise, Ren no longer bothered trying to hide his pain and misery from her.[36] He allowed Rey to confide in him and reassured her that she was not alone.[21] Later, as Rey lay at the mercy of Snoke, all of Ren's doubts gave way to a newfound sense of purpose and determination[11]—he knew what he had to do.[25] Instead of executing Rey as his master commanded, Ren resolved to kill Snoke and take his place with Rey at his side. Despite knowing that Rey was a woman of no significant background, Ren reassured her that she still meant something to him. He envisioned himself and Rey ruling together as the architects of a new galactic order,[21] but her refusal caused Ren to feel betrayed[11] and he vowed to destroy Rey along with everyone else who opposed him.[21] However, when Rey blocked him as soon as the Force reconnected them, Ren was left feeling anything but victorious in spite of how he overthrew his master, all but destroyed his mother's movement and struck down Luke Skywalker.[25]\n", "Ben Solo was a human male[2] who stood at 1.89 meters[3] and weighed 89 kilograms.[4] He had black hair, brown eyes, and light skin.[5] As Kylo Ren, he often kept his face covered with a mask modeled on the battle gear of the Knights of Ren. His mask projected and amplified his voice in a deeper way, and his robes were a remnant of his training with the Supreme Leader and became singed from many battles. These elements combined to make Ren an intimidating presence as he boldly stepped onto the battlefield, where he sometimes arrived after victory was secured, yet he had no fear of battle. He boldly strode into battle, confident in his powers and his purpose.[20] As a child, Solo's eyes appeared ancient to his father. From Han's perspective, it was as though his son had been waiting for a millennium just to be born.[14]\n"], "personality_quotes": [["\"Yes. There it is. You have too much of your father's heart in you, young Solo.\"\"I killed Han Solo. When the moment came I didn't hesitate.\"\"And look at you. The deed split your spirit to the bone.\"", "―Snoke and Kylo Ren[src]"]], "figure_captions": ["Kylo Ren saw himself as the rightful heir to the legacy of his grandfather, Darth Vader.", "Ren idolized his grandfather, whose helmet he kept as a reminder of the dark side's power and weakness.", "Ren wore a mask not only to hide his former identity, but also to project a more intimidating persona.", "Though he projected the air of a loyal apprentice, especially in Snoke's presence, Ren cunningly plotted his own path to power.", "Beneath the theatrics of Kylo Ren's helmet, Ben Solo was being torn apart by the conflict between the dark side and the light within him.", "Dismissed by his master as \"a child in a mask,\" Ren destroyed his helmet and sought to claim his future by \"letting old things die.\"", "Ren understood Rey's feelings of abandonment and solitude, having experienced them as well during his formative years."], "quote": ["Let the past die. Kill it if you have to. That's the only way to become what you were meant to be.", "―Kylo Ren", "Star Wars: Episode VIII The Last Jedi"], "description": "Kylo Ren, a Force-sensitive human male, was the Supreme Leader of the First Order and master of the Knights of Ren during the New Republic Era. Once a promising student of Jedi Master Luke Skywalker, the former Ben Solo was neither Jedi or Sith but a product of both philosophies. Through the teachings of his predecessor, Supreme Leader Snoke, Ren came to embrace the dark side of the Force. However, he still felt the pull of the light side of the Force, resulting in much conflict within him. Yet despite his inner struggle, Ren believed it was his destiny to rule the galaxy. He was also determined to destroy the legacy of the Jedi Order as well as the Sith, believing it was time to forge a new galactic order in their place.\n"}