{"id": "Lando_Calrissian", "name": "Lando Calrissian", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Lando_Calrissian", "personality": ["Lando Calrissian was a human male with black hair, brown eyes, and dark skin. He often wore ornate clothing that included a cape.[3] In his youth, Calrissian enjoyed playing sabacc,[11] and Solo described him as having been a scoundrel.[3] Calrissian was also willing to undertaking dangerous risks. On one occasion, he, Lobot, and some companions stole the Emperor's luxury yacht Imperialis.[25] Calrissian hoped to profit from selling the ship's treasures.[26] The heist undertook a dangerous turn when the Sith objects aboard corrupted his companions Aleksin, Pavol,[28] and Korin Pers.[29] Calrissian had little appreciation for the Sith and Jedi, regarding them as \"con-jobs.\"[28]\n", "He was also familiar with the bounty Cha, which led her to spare his life.[28] Calrissian cared deeply for his friend Lobot and was unwilling to abandon him. The two were close friends. Lobot recognized Calrissian's charm and ability to motivate people and counseled him to find a greater cause than himself and to do good for others.[29]\n", "After losing the Millennium Falcon however, Calrissian sought to turn into a respectable businessman, and he turned Cloud City into a mostly-legitimate enterprise.[11] He was protective of his people to the point that he was forced to betray Solo and the Rebels to save Cloud City from the wrath of the Empire, for whom Calrissian had no love. He turned against the Empire, however, in order to give his citizens a chance to escape and to save Solo. Although Solo had felt betrayed by Calrissian's actions,[3] the two reconciled after Solo was rescued from Tatooine, and shared a warm embrace during the victory celebration on Endor.[6] When speaking or referring to Solo by his first name, Calrissian invariably pronounced the name the same way one would pronounce the word \"hand,\" rather than rhyming with \"on\" as it was normally pronounced.[5]\n", "Calrissian was known for his jocular and witty personality. Despite the wartime damage to Cloud City, Calrissian was undaunted and preferred to look on the bright side of things by hiring refugees to staff his facilities. Calrissian was also a smooth-talking negotiator who managed to convince several Imperial holdouts to surrender in return for being well-treated and allowed to leave Cloud City. Calrissian was also a man of honor who kept his promises. The only person that could exert an influence on Calrissian was his friend and employee Lobot. Calrissian welcomed the news that his friends Solo and Organa were expecting a child and looked forward to being an uncle.[35]\n"], "personality_quotes": [["\"He's a card player, gambler, scoundrel. You'd like him.\"", "―Han Solo, to Leia Organa — Listen (file info)[src]"]], "figure_captions": ["Calrissian's custom emblem.", "The Millennium Falcon under Calrissian's ownership."], "quote": ["I mean, he was brave, sure, but always in the service of saving his own hide or profit. But I had also detected that deep down, behind all that smooth talking and those well-ironed capes, there was a whole human being with a conscience and a desperate need to do something worthwhile with his life.", "―Kaasha Bateen, on Lando Calrissian", "Last Shot"], "description": "Lando Calrissian was a human male smuggler, gambler, and card player who became Baron Administrator of Cloud City and, later, a general in the Rebel Alliance. He was the owner of the Millennium Falcon before losing it to Han Solo in a game of sabacc on Numidian Prime. After losing the Falcon, Calrissian put an end to his days as a smuggler and became an entrepreneur, setting up a small mining operation on the planet Lothal before eventually becoming the leader of Cloud City in the skies of the planet Bespin.\n"}