{"id": "Mace_Windu", "name": "Mace Windu", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Mace_Windu", "personality": ["During his formative years as a Padawan, Mace Windu was devoted to the Jedi Order, but struggled to temper his frustrations with everything that contradicted his ideals. While his feelings were not inherently wrong according to his Jedi Master, Cyslin Myr, she nonetheless believed that her apprentice needed to convert his hostility into a positive emotion. The teachings of the Jedi were sacred to Windu; during a mission on Mathas, he was offended by the way Drooz used religion to take advantage of the world's indigenous population. He regarded faith as something that was beautiful, and therefore saw Drooz's actions as heretical and offensive.[4]\n", "Although he struggled to temper his animosity for heretics and con artists, Windu expressed empathy for other people, in particular the natives of Mathas who suffered from the effects of the Niffin plague. He saw them as innocents, but was also stunned by their refusal to see Drooz as a charlatan instead of a prophet. While in pursuit of Drooz, who mocked Windu by insulting the esteem of the Jedi Order, the young Jedi almost took Drooz's life, believing he deserved to be punished for using the Jedi's own belief system to prey on the people who expressed faith in the Force.[4]\n", "As a senior member of the Jedi High Council, Mace Windu sought to protect the Jedi Order from the corruption and unrest that undermined the Galactic Republic from within. Noted for his grim demeanor, Windu held corrupt politicians and rebellious Jedi in low regard. He had very little patience for the failures of the Galactic Senate and was disdainful of the Jedi who disobeyed the will of the Council. A staunch traditionalist, Windu was long regarded as the great champion of the Jedi Order. His commitment to the Order's ancient traditions often put him at odds with less orthodox Jedi, such as Qui-Gon Jinn and especially Anakin Skywalker.[2] In their first encounter, Windu was unimpressed with Skywalker.[13] He was not only skeptical of Skywalker's status as the Chosen One, but also felt that he was too old to dedicate himself to the ways of the Jedi and the Force without the distraction of his emotional attachments. Although he never stopped doubting Skywalker, Windu came to regard him as an exceptionally skilled, yet tempestuous Jedi.[2][5] However, his ill-concealed distrust had an adverse effect on his relationship with Skywalker—a sentiment which also extended to Skywalker's apprentice Ahsoka Tano, whom Windu regarded as another rebellious Jedi.[2]\n", "In the early days of the Clone Wars, Windu wrestled with feelings of uncertainty concerning the Jedi's new role as warriors, as well as remorse for the Jedi who died during the Battle of Geonosis. In his moments of doubt, he turned to Yoda seeking wisdom and guidance. The ancient Grand Master advised his fellow Councilor to keep faith in the will of the Force; nor question his role in the Order, for in Yoda's eyes, Windu was a wise and capable leader. During a mission on Hissrich, Windu's faith was further tested by his interactions with the Jedi Prosset Dibs, who harbored his own reservations about the Order's part in the conflict.[7]\n", "Whereas Dibs grew increasingly doubtful, believing the Jedi did not belong on the battlefield, Windu became more certain that—as Jedi Knights—they had a duty to protect the innocent and restore peace to the galaxy. Dibs ultimately accused the Jedi Order of turning away from their traditions, causing Windu to hold fast to his conviction that it was not wrong to fight for the ideals he believed in. The Jedi, Windu felt, never wanted to fight in a war,[4] but circumstances compelled them to become a sword instead of a shield for the Republic.[7]\n", "When Padawan Ahsoka Tano was framed for treason, Windu supported the Council's decision to revoke her status as a Jedi and turn her over to the Republic for a military tribunal.[47] While their verdict pained him,[48] Windu concurred with Tarkin's position on the matter—an internal Jedi trial would appear biased, and to protect Tano would be to defy the wishes of the Senate. He therefore felt that the Council had little choice but to submit Tano for trial. After her innocence was proven, however, Windu joined his colleagues in offering to welcome Tano back into the Order, and proclaimed her a greater Jedi because of her ordeal, which he observed as the great trial in her path to Jedi Knighthood. Tano refused to come back, a decision which surprised Windu and the Council.[47]\n", "Notwithstanding his commitment to the ancient traditions of the Order, the Clone Wars forced Windu to rethink some of his beliefs and preconceptions.[2] Prior to the Battle of Geonosis, he did not believe it was in the nature of a Jedi—even a former one such as Count Dooku—to assassinate anyone. The onset of the Clone Wars caused Windu to realize that his old friend was more than a \"political idealist;\" he was now an enemy of the Order and the Republic he had once served.[5] Furthermore, as the death toll escalated after nearly three years of continuous warfare, Windu proposed to have Dooku assassinated in the hope of preventing further civilian casualties. Although his colleague, Obi-Wan Kenobi asserted that assassination was against the Jedi Code, Windu felt that it was also against the Jedi way to allow innocent people to suffer needlessly.[57]\n", "As the war progressed, Windu was compelled to engage in politics. Although he disliked the system, he nonetheless proved to be an able diplomat during the Ryloth campaign in which he successfully mediated a truce between two rivals, Senator Orn Free Taa and Cham Syndulla.[2] His efforts to find a diplomatic solution were less successful on Anaxes, however. Upon confronting a regiment of battle droids, he offered to have them reprogrammed in return for their unconditional surrender, citing his capacity for destroying Separatist droids as a reason to avoid fighting him. Their response was to attack, forcing Windu and Kenobi to defend themselves.[56]\n", "In spite of how the conflict forced the Jedi into the role of generals and warriors, Windu held fast to the Jedi Code for the most part. He refused to support the Dugs of Malastare when they proposed to kill the Zillo Beast, which he correctly presumed to be the last of its species.[2] He also chose to not seek retribution against Boba Fett after the latter attempted to assassinate him.[37] Despite his disapproval of maverick Jedi and the avarice of the Senate, Windu was very loyal to both the Republic and the Jedi Order to the point where he bravely risked his life for both institutions throughout the Clone Wars.[2] Even as the Jedi became officers in the Grand Army of the Republic,[5] Windu remained extremely protective of the Order's independence and jealously guarded its interests against external interference.[15]\n", "Though noted for his grim demeanor,[2] Windu was highly compassionate towards his fellow Jedi, the citizens of the Republic,[57] and the clone troopers under his command.[35] His own survival on Geonosis was of little comfort to him; the galaxy had fallen into a state of war, and the Jedi—once the peacekeepers of the Republic—were forced to adopt the mantle of warriors and military leaders.[2]\n", "Windu worked closely with Supreme Chancellor Sheev Palpatine, often acting as an adviser to the leader of the Senate throughout the Clone Wars.[21] As time went on, the Jedi champion grew increasingly suspicious of Palpatine's intentions. During the Zillo Beast's transportation to Coruscant, Windu strongly disagreed with the chancellor's decision to bring the dangerous creature to the Republic capital.[2] Though wary of Palpatine, Windu remained committed to his duty as a Jedi, which required him to ensure the safety of the chancellor. Yet even this responsibility resulted in a disagreement between himself and the chancellor; Palpatine claimed that the level of security around him was unnecessary during his visit to Naboo, but Windu insisted on taking every precaution to protect the chancellor.[42]\n", "In the waning days of the Clone Wars, Windu's trust and respect for Palpatine had all but evaporated. Following Dooku's death, he was uncertain whether Palpatine would relinquish his wartime authority as he once promised. At the same time, Windu came to sense the dark side of the Force surrounding the chancellor. By now he was certain that a plot was in motion to destroy the Jedi Order. When Skywalker confirmed that Palpatine's true identity was Darth Sidious, Windu was determined to take swift and decisive action against the Sith Lord, realizing that the fate of the Jedi Order hung in the balance. Although he initially attempted to arrest Sidious, Windu concluded that it was impossible to seek justice due to the chancellor's hold over the system. He therefore decided to end Sidious' life before the latter could succeed in his plan to fully take over the Republic, despite Skywalker's insistence that killing the Sith Lord—disarmed and seemingly beaten—was against the Jedi Code. However, in concentrating all of his attention on preventing the galaxy from falling under Sith oppression, Windu failed to anticipate Skywalker's intervention, resulting in the demise of the Jedi Order's great champion.[2]\n", "Mace Windu was a human[3] male[2] who had brown eyes, dark skin,[6] and a height of 1.92 meters.[2] His head was completely bald; although in his youth, Windu had black hair and a braid that marked his status as a Padawan.[4]\n"], "personality_quotes": [["\"He has taken everything we cherish, everything that we are, and spun it into a web of lies and deceit, for profit! He must atone for this.\"\"And he will. But not by your hands. Not like this. I understand your frustrations, but we have to be better than our adversaries. There will be times when we are called to violence. This is not one of them.\"", "―Mace Windu and Cyslin Myr, debating the fate of Drooz[src]"], ["\"Doubt not the ways of the Force. It tests us at times, but believe it will lead us where we are meant to be, we must. Similarly, doubt not yourself. You are a wise and capable leader.\"", "―Yoda, to Mace Windu[src]"], ["\"My name is General Mace Windu of the Jedi Order. At this point of the Clone War, I have dismantled and destroyed over one hundred thousand of you Type-1 battle droids. I am giving you an opportunity to peacefully lay down your weapons so that you may be reprogrammed to serve a better purpose than spreading the mindless violence and chaos which you have inflicted upon the galaxy.\"\"Blast him!\"\"Well, I guess it was worth a try.\"", "―Mace Windu, a B1 battle droid, and Obi-Wan Kenobi[src]"], ["\"We do what we have trained our whole lives to do. Trust in the Force. Believe in the path that is set out before us. Stand in defense of all peoples, not just of the Republic, but across the galaxy. We do what any Jedi would when staring into the face of evil. We fight.\"", "―Mace Windu, to Rissa Mano[src]"]], "figure_captions": ["Windu devoted his life to the Jedi Order, but struggled in his youth to temper his emotions.", "As a Jedi Master, Windu was highly regarded by Grand Master Yoda of the Jedi Order.", "Windu endeavored to protect the Order's traditions and independence during his time as a member of the Jedi High Council.", "Windu mediated negotiations between Orn Free Taa and Cham Syndulla by appealing to their mutual goal of freeing Ryloth.", "Mace Windu was known as the great champion of the Jedi Order.", "Windu confronted Sidious in the hope of preventing the Jedi Order's destruction."], "quote": ["In the name of the Galactic Senate of the Republic, you're under arrest, Chancellor.", "―Mace Windu, to Darth Sidious", "Star Wars: Episode III Revenge of the Sith"], "description": "Mace Windu, a Force-sensitive human male, was a revered Jedi Master and member of the Jedi High Council during the last years of the Galactic Republic. During his time in the Jedi Order, he once served as elected leader of the Jedi and, during the Clone Wars, as a Jedi General in the Grand Army of the Republic. He was the greatest champion of the Jedi Order and promoted its ancient traditions amidst the growing influence of the dark side of the Force in the corrupt, declining days of the Republic.\n"}