{"id": "Obi-Wan_Kenobi", "name": "Obi-Wan Kenobi", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Obi-Wan_Kenobi", "personality": ["In his youth, the loyal and dedicated Obi-Wan Kenobi possessed a dry sense of humor and sarcastic wit. Yoda said that he sensed Qui-Gon Jinn's defiance in him,[10] and Jinn himself reflected upon Kenobi's considerable knowledge and potential; he also considered his Padawan a lot wiser than him, if somewhat headstrong.[10] Often seen wise beyond his years, his humble and soft-spoken demeanor belied his warrior prowess. Despite his numerous complaints during flight, he was also a skilled pilot. In many ways, he represented the strength of the old Jedi Order: steadfast, selfless, and modest. His later skill at resolving disputes without a single battle would earn him the sobriquet \"The Negotiator\", at least in the eyes of General Grievous.[9]\n", "Over time, Kenobi lost some of his youthful audacity and assumed the role of a more cautious and conservative mentor to Anakin Skywalker, who was in many ways his opposite in personality. Kenobi carefully measured his actions in any situation, garnering him the aforementioned nom de guerre. Kenobi was also known to be an accomplished storyteller. While hiding in the Jundland Wastes in his later years, he appeared as a kindly and eccentric old hermit (or, in Owen Lars' words, \"That wizard is just a crazy old man\") to those not familiar with the ways of the Jedi. In his final days, Kenobi retained his traits of patience and foresight as well as gaining some of the boldness reminiscent of his youth.[10]\n", "Kenobi often thought out plans and strategies rather than leaping into action. He would usually place his hand on his chin or stroke his beard as he thought. This was a common trait of the Jedi Master, one that his apprentice Anakin Skywalker did not practice very often.[42] He sometimes mentally repeated the Jedi Code to calm himself.[8]\n", "Kenobi's respect for the lives of others led him to emerge from hiding to save Ezra Bridger and the C1-series astromech droid Chopper from succumbing to the deserts of Tatooine. Kenobi then reproved Ezra for succumbing to Maul's manipulation and counselled the young rebel to return to his place with the rebellion. Despite not hating Maul, Kenobi was prepared to fight and kill him in self defense. After mortally wounding Maul, Kenobi comforted the former Sith and assured him that he was watching over the \"Chosen One\", Luke Skywalker, though Luke was not the Chosen One by prophecy.[128]\n", "During Mandalore's Civil War and his apprenticeship under Qui-Gon Jinn, Kenobi fell in love with the young Duchess Satine. The two Jedi and queen lived on the run for over a year. Satine reciprocated his feelings as he saved her life from insurgents and bounty hunters. When Kenobi's mission ended, he chose to honor his obligations to the Jedi Order in accordance to the Jedi Code. However, he regretted leaving the Duchess alone to rebuild Mandalore.[15]\n", "Years later during the Clone Wars,[61] Kenobi and Satine still had feelings for each other, but found themselves on opposing sides. Satine had begun to advocate a course of neutrality for herself and 1,500 systems that wanted no part in the war, while Kenobi defended the use of military action to end the conflict with the Separatists, including a military presence on Mandalore to protect it from the Death Watch. As such, their inability to express their feelings led them to bicker relentlessly about their conflicting philosophies. Only when forced into action did their camarederie return. When Satine was taken hostage by Senator Merrick, she confessed that she had always loved him. Kenobi, despite the situation, confessed that he too loved her and would have left the Jedi Order if she asked it of him. Despite their confessions, Kenobi and Kryze continued with their responsibilities as peace keepers.[15]\n", "When Maul resurfaced on Mandalore, Kenobi attempted to rescue her from him but the pair were captured. Kenobi was forced to watch Maul choke Satine and ultimately watch Maul kill her with the Darksaber. Kenobi mourned her, but refused to give in to his anger to avenge her.[96]\n"], "quotes": [["\"Who's the more foolish, the fool, or the fool who follows him?\"", "―Obi-Wan Kenobi — Listen (file info)[src]"], ["\"I've loved you from the moment you came to my aid all those years ago.\" […]\"Had you said the word, I would have left the Jedi Order.\"", "―Satine and Kenobi — Listen (file info)[src]"]], "figure_captions": []}