{"id": "Orson_Krennic", "name": "Orson Callan Krennic", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Orson_Krennic", "personality": ["Orson Krennic was a human male with short gray hair, blue eyes, and light skin. He wore a white Imperial military uniform,[2] similar to those used by members of the ISB, like Colonel Wullf Yularen,[17] with an unusual addition of a white cape not commonly seen on other Imperial officers. Krennic sought to earn the favor of Emperor Palpatine,[2] using his knowledge of the Empire's system to manipulate it and ascend in the Imperial hierarchy. He was known to be unpredictable and volatile. During his time as part of the Futures Program, Krennic was renowned for his \"nocturnal carousing\" and partying, as well as frequently coming to Galen's rescue to ward off his tormentors. He had a high opinion of his own skills and felt that he deserved respect. He was not afraid to go toe-to-toe with other highly placed officials of the Galactic Empire, such as Mas Amedda[3] and Darth Vader, though, in the case of the latter, quite foolishly. He even had the audacity to make a direct request of Vader, for an audience with the Emperor no less, and ask if he could be put in charge of the Death Star, which led the irritated Sith Lord to Force-choke him.[2]\n", "Krennic was devoid of many human qualities such as compassion, mercy and regard for innocent lives. Additionally, he remarked on the subsequent cloud of flame and smoke as something of beauty, unremorseful of having just murdered hundreds of thousands of innocent people.[20] He was also dismissive of the Force and its importance in the galaxy, speaking of having just destroyed the last remnants of the Jedi with undisguised pride. He also ordered for the execution of the scientists on Eadu despite Galen having just admitted to being the traitor among the development staff. He also showed at least some sadism, as after knocking Galen to the ground, Krennic proceeded to gloat about his use of the Death Star in the destruction of Jedha City, specifically noting every element of Jedha City, including Saw's Partisans, being gone as a result. He was also shown to be somewhat sarcastic, especially when irritated with his underlings incompetence, as upon witnessing the explosions triggered by the Rebel forces alongside everyone else in Citadel Tower, Krennic bluntly yelled to the present personnel (who were still staring out towards the area the explosions were at) \"Are we blind?!\" before ordering the deployment of the base's garrison to drive off the attackers. In battle, Krennic had a DT-29 heavy blaster pistol in which he owned personally.[source?]\n"], "quotes": [["\"We stand here amidst MY achievement! NOT yours!\"", "―Orson Krennic, to Wilhuff Tarkin, claiming credit for the Death Star — Listen (file info)[src]"]], "figure_captions": ["Director Krennic, flanked by his Death Trooper bodyguards"]}