{"id": "Padmé_Amidala", "name": "Padmé Amidala", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Padmé_Amidala", "personality": ["Amidala was compassionate to other people and stood her ground firmly for what she believed in.[8] Amidala was very persuasive and empathetic speaker during her time as Senator,[4] especially when she opposed the escalation of the Clone Wars.[28] She even started to doubt the Republic when the Senate gave Palpatine more executive powers near the end of the Clone Wars.[4] Amidala could no longer ignore the needs of her people, and accepted Queen Réillata's offer to become senator after two terms as queen. Due her reputation as a beloved former monarch, Amidala kept several privileges such as her wardrobe and a chrome-plated ships when she became Senator.[8]\n", "Amidala was both responsible and strong willed who did what she believed to the right course of action despite objections from those closest to her. She spoke her mind to the Senate and was able to convince the Gungan to unite against the Trade Federation.[1] Amidala could be seen as fearless when she refused additional security to protect herself from assassins. She also did not like the idea of leaving during the vote on the Military Creation Act. When Skywalker came back into her life, Amidala knew that their future together would endanger ther lives. However, she gave and married Skywalker in secret.[8]\n", "Always at the center of the galaxy, Amidala was a determined and brave survivor.[54]\n"], "personality_quotes": [], "figure_captions": [], "quote": ["To those who act as agents of chaos, I say this: I stand resolute and unyielding. And if you strike my voice down, know that a chorus of thousands shall rise up in its place, for you have no dominion over the righteous. We are the defenders of truth.", "―Padmé Amidala", "Assassin "], "description": "Padmé Amidala, also known as Padmé Amidala Naberrie, was a human female senator who represented the people of Naboo during the final years of the Galactic Republic. Prior to her career in the Galactic Senate, Amidala was the elected ruler of the Royal House of Naboo. A political idealist, she advocated for the preservation of democracy as well as a peaceful resolution to the Clone Wars. However, her secret marriage to the Jedi Knight Anakin Skywalker would have a lasting effect on the future of the galaxy for decades to come.\n"}