{"id": "Palpatine", "name": "Darth Sidious", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Palpatine", "personality": ["Prior to the creation of his Empire, Palpatine was careful to put on a charade, presenting himself as a grandfatherly gentleman and a servant of the public good. When in character, he often spoke of himself with great modesty, and maintained only as much luxury as was expected of someone of his stature.[22] However, Palpatine was in fact a skilled manipulator and strategist, having orchestrated countless events in the galaxy, from the Invasion of Naboo to the Clone Wars, with the sole aim of increasing his own power.[6] Even when something occurred that he did not initially plan for, the Sith Lord demonstrated that he was as adept at improvisation as he was at plotting.[1]\n", "After his ascension to Galactic Emperor, Palpatine essentially dropped his public persona and started living as Sidious full-time.[16] Despite this however, very few people other than Vader and some of the Royal Guards knew that Palpatine was a Sith, as he took great pains to hide his capabilities.[70] Even Grand Moff Wilhuff Tarkin, perhaps Sidious's most trusted servant besides Vader, only suspected that Sidious was a Sith. Freed from having to portray his gentle alter-ego, Palpatine allowed his true personality, one of great cruelty and sadism, to occasionally shine through in ways that were obvious even to the most sycophantic of his servants. This caused many of those who worked closely with him, such as Senator Orn Free Taa and some of the Empire's intelligence chiefs, to greatly fear him. Palpatine was also known to loath ostentation and luxury.[70][3]\n", "Palpatine's most defining trait was his deeply manipulative nature, seducing many parties with promises of power, prize, even salvation to further his agenda. He successfully manipulated the leaders of the Separatists and Count Dooku under the pretense of a better future[9]; coerced Anakin Skywalker into becoming Darth Vader by promising to save his beloved, Padme Amidala[15]; attempted to sweet talk Bridger with being able to reunite with his deceased parents by altering fate[81]; and also tried to push Luke Skywalker into murdering his father and rule the Galaxy together.[5] While trying to steer Bridger he displayed himself in his public personality via hologram, showing himself as benign and polite. Once Bridger frustrated his plans, his true malignant self was revealed.[81]\n", "After toppling the Republic and shedding his benevolent persona, Sidious essentially disappeared from public life, and left most of the day-to-day affairs of the Empire in the hands of the Imperial Ruling Council. His absence did not go unnoticed by the citizenry of the Empire, and rumors began to circulate that the Jedi assassination attempt had not only resulted in his disfigurement but in the death of the sanguine politician that he had once been. In order to quash the gossip and rumor-mongering, the Ruling Council took to dispatching skycar processions in Imperial Center in an effort to make it appear as though Sidious still moved about in public.[3]\n", "As Emperor, Sidious devoted most of his time to study and meditation, often in the ancient Sith shrine situated beneath the Imperial Palace. Wishing to rule his Empire for eternity, Sidious launched numerous inquiries into the topic of immortality. One of the most notorious of these was Project Blackwing; an attempt to unlock the secrets of immortality through Sith alchemy, but the project ended in failure.[110] However, Sidious's true goal was ultimately to discover a way to use the dark side to manipulate reality itself, and with that power, not only achieve what he termed \"mere immortality\" but acquire the ability to reshape the galaxy and its people to his satisfaction. Whether or not Palpatine made any significant progress in obtaining this goal is not known however, as he would have needed Vader's assistance to perform the sorts of rituals he had in mind.[3]\n", "To those who had been at his nonexistent mercy, Sidious was known to be exceptionally sadistic, and he often took visible pleasure in torturing others.[50] He was similarly quite bloodthirsty as well, and frequently reveled in combat to the point of laughing while he fought or killed.[15][50][3] He was also noted for his lack of forgiveness. Darth Vader, who was well known for summarily executing officers who failed him, considered Palpatine to be even less clement than himself.[5] According to Sosha Soruna, the reason Palpatine left his homeworld of Naboo relatively untouched during his reign was because he enjoyed tormenting the populace with the fact that he could destroy the serene beauty of the planet at anytime.[105] In spite of his exceptional mastery of the dark arts, he was no less susceptible to fear, one of the primary emotions of the dark side, than any other Sith: after being attacked by a powerful Force push from Yoda, he displayed visible panic, attempting to flee rather than fight, and only confronted his opponent when he appeared to have no other choice.[15]\n", "Unlike his more conservative apprentice, Darth Vader, Sidious believed that progress was in no way contrary to the ways of the Sith. When Vader was presented to the cyborgs created by Doctor Cylo, he denounced them as abominations and heresy to the ways of the Force. However, Sidious claimed that he was merely an apprentice and was meant to learn what he knew, and that Sidious was meant to discover what there was to teach. He also dismissed Vader's hatred of technological superiority by replying that everything was of the Force.[94]\n", "Due to his Sith philosophy, Sidious was seemingly unwilling to let anyone else inherit the Galactic Empire in the event of his death. Using a game of Shah-tezh as an illustration, Palpatine seemed to believe that the Empire's sole purpose for existence was to protect his own life and well-being. He believed that the Empire was a failure if it failed to live up to this purpose. Even before the formation of the Empire, Sidious had prepared for this fate by formulating a Contingency plan. The Contingency involved luring the Empire to the barren Inner Rim planet Jakku and detonating the planet's core; destroying both the planet and the orbiting Imperial and enemy fleets. The key to the Contingency was the Jakku Observatory (which concealed a borehole that penetrated the planet's core) and Gallius Rax, a native of Jakku who rose to become Counselor to the Empire. As the Contingency showed, Sidious seemed to be willing to risk the lives of countless subjects to prevent the Empire from outliving him.[26] Sidious also regarded Rax as a confidante and allowed him to address him as Sheev Palpatine.[11] Decades after his death, however, Supreme Leader Snoke, a leader who had taken control of the First Order, an organization built out of the remnants of the Galactic Empire, had by then discovered that Palpatine's Contingency as a matter of fact involved ensuring the Empire's rebirth, going as far as secretly constructing shipyards and laboratories within the Unknown Regions in pursuit of this goal. [68]\n", "During the Imperial Era, Darth Sidious sought to gain access to the World between Worlds in order to control time and the universe.[80] He was even willing to manipulate Ezra by offering him the chance to reunite with his parents. However, Darth Sidious underestimated Ezra's hatred for the Empire and devotion to the Rebellion and new-found rebel family.[81]\n", "Prior to his disfigurement, Palpatine was a slim man sporting wavy hair, a prominent nose, blue eyes, and a narrow face.[1] By 32 BBY, his red hair was graying,[1] and it had turned entirely silver ten years later.[9] After his duel with Windu, Palpatine's visage was heavily disfigured and withered, with deathly pale, wrinkled skin, flesh sagging from his bulging forehead and around his piercing yellow eyes.[5] His voice was altered to a degree as well, becoming deeper and taking on an edge that many found to be sinister. Tarkin however was of the opinion that Palpatine's voice merely sounded strained when compared to that of his pre-war persona.[3] For most of his reign, the Emperor remained away from public view and crafted holograms or idealized portraiture that depicted him in his prime, as he was in the last years of the Galactic Republic.[111] Even so, as the reign of the Empire solidified, the citizenry of the galaxy largely forgot the name of \"Palpatine,\" knowing him only as a simply \"the Emperor.\"[112]\n"], "personality_quotes": [["\"We shall double our efforts.\"\"I hope so, Commander, for your sake. The Emperor is not as forgiving as I am.\"", "―Moff Jerjerrod and Darth Vader[src]"]], "figure_captions": ["Sidious speaks, in a hologram, to the Separatist Council.", "When angered, Sidious was a frightening sight to behold and an overpowering opponent."], "quote": ["Everything is proceeding as I have foreseen.", "―Darth Sidious — Listen (file info)", "Star Wars: Episode VI Return of the Jedi"], "description": "Darth Sidious, a Force-sensitive human male, was the Dark Lord of the Sith who founded the Galactic Empire after toppling its predecessor, the Galactic Republic from within. Prior to his term as Supreme Chancellor and subsequent reign as the Galactic Emperor, Sidious was born approximately eighty-four years before the Battle of Yavin and given the name Sheev Palpatine during the Age of the Republic. A native of the Mid Rim planet Naboo, Palpatine pursued a career in politics and eventually became his homeworld's representative in the Galactic Senate. Although he cultivated the persona of an honest and trustworthy public servant, Senator Palpatine was an ambitious Sith Lord who learned the ways of the dark side of the Force during his secret apprenticeship under Darth Plagueis. Following in a lineage of Dark Lords that began with Darth Bane, who reformed the Sith a millennium prior to the Fall of the Republic, Sidious spent years conspiring to restore his Order to galactic dominance. After killing his Sith Master, he trained an apprentice of his own, the Dathomirian assassin Darth Maul in accordance with the Rule of Two—Bane's decree that there should only be two Sith Lords at any given time.\n"}