{"id": "Poe_Dameron", "name": "Poe Dameron", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Poe_Dameron", "personality": ["The son of a Rebel pilot and a Rebel commando, Dameron grew up on stories of Alliance campaigns,[14] and while his mother taught him to fly and to love it, his father had taught him that when he committed to doing something, one committed to going all the way or not do it at all.[5] Thanks to them, Dameron developed a strong sense of commitment and duty, but had trouble with the line between his commitment to the Resistance and the commitment to his comrades,[6] willing to disobey a direct order from his superior, General Organa, to make sure that the Millennium Falcon safely left Starkiller Base before its imminent destruction.[33]\n", "Noted to be a \"bad liar\" by fellow comrades much to his indignation,[5] Dameron had a headstrong nature which often led him into trouble,[14] and a proud countenance that, those who did not know him, could mistake for arrogance. Confident in his skills and in his mission, he sometimes displayed an impatience that arose only from a desire to fulfill the task at hand.[33] While daring with an appetite for risk[2] as well as somewhat foolish, Leia Organa once noted that his need to do what was right and \"maybe find a little adventure along the way\", coupled with his outstanding piloting skills, reminded her of her brother, Luke Skywalker.[5]\n", "Dameron regarded his fellow pilots Karé Kun, Jess Pava, L'ulo L'ampar, and Temmin Wexley, and the technician Oddy Muva as close friends that he could trust. Poe was also adventurous and willing to risk danger such as when he entered the Cave of the Crèche. Dameron treated his hosts with respect.[7] Dameron's selfless and concern for the well-being of others led him to surrender himself to the First Order Agent Terex in an attempt to save the Crèche egg. As a commander, Dameron was a fair-minded and just leader who gave his Black Squadron mates ample room to improvise.[13] Poe regarded his astromech droid BB-8 as a close friend who would aid him in combat and someone he could confide with.[18][22] Poe was also magnanimous in victory and allowed Terex and his men to leave following the mission to Ovanis. This was also tempered by Dameron's unwillingness to provoke war between the First Order and the Resistance.[18]\n", "Dameron and his Black Squadron mates' devotion to the Resistance cause led them to risk life and limb on several occasions including the Mission to Megalox Beta. Poe and his comrades managed to fight their way to Grakkus' fortress despite being double-crossed by the prison guards.[12] When faced with competition from Terex, Poe showed resilience and ingenuity as a commander. He got BB-8 and the other astromech droids to lower Megalox prison's gravity shield; eliminating opposition from Terex and convincing Grakkus to accept their rescue offer.[20]\n", "After learning there was a spy within the Resistance ranks, Dameron found himself unable to trust his Black Squadron mates despite regarding them as friends.[22] Poe was also willing to walk into danger in an effort to recover information for the Resistance.[23] During a Mission to Kaddak, Poe was only saved from capture by the efforts of C-3PO. While Poe was able to work well with droids like BB-8 and C-3PO, he found the commando droid \"Nunzix\" self-serving and irritating due to the droid's strong self-preservation mechanism. Poe was annoyed that the droid refused to disclose the information in his memory banks.[24] Poe had little patience with Nunzix and expressed annoyance at the droid commando's unwillingness to fight; overlooking the fact that the droid had lost one of his arms. Poe's irritation with Nunzix was reinforced by his suspicion that the information Nunzix was carrying was a trap set by Terex.[25]\n", "Due to their repeated encounters on several missions, Dameron came to regard Terex as a nemesis and blamed him for sowing distrust among his Black Squadron pilots.[22] Poe was determined to root out the spy and eventually realized that the spy was Oddy Muva; who had been blackmailed by Terex into spying on the Resistance.[25] Despite his hatred for Terex, Dameron did not seek to destroy the First Order agent and instead handed him back to his First Order superiors. While Dameron grieved the loss of one of his pilots L'ampar, he took comfort in the fact that Terex's Ranc gang fleet had been destroyed.[27]\n", "By the end of the cold war, Dameron was a courageous hero of the Resistance dedicated to defeating the First Order.[41] Though brash, Dameron had great charisma and limitless respect for the founders of the Resistance, particularly Leia Organa,[8] a reason for which Organa tried to teach him that being a hero and being a leader wasn't the same thing.[41] Organa was sure that Poe would be a great leader one day, but he still had a lot to learn, even though Dameron didn't agree.[42] Dameron's fellow pilots joked that if the Resistance had recruitment posters, Dameron would triple their numbers with his dashing bravado alone. Unlike many starfighter pilots, Dameron delighted in atmospheric missions, soaring through skies and skimming the surfaces of planets.[2]\n"], "personality_quotes": [["\"Dameron's commitment is absolute. And he's our best pilot. He'll get what we need.\"\"I've never worried about Poe's commitment. My worry is for what that commitment may cost him.\"", "―Caluan Ematt and Leia Organa[src]"]], "figure_captions": ["Dameron in civilian attire", "Dameron's T-70 X-wing fighter, Black One"], "quote": ["You know, I've been thinking about all of this. Thinking about the ", "―Poe Dameron to Black Squadron", "Poe Dameron 31: The Awakening, Part VI"], "description": "Poe Dameron was a human male who served as a pilot in the New Republic and, later, the Resistance during its conflict and subsequent war with the First Order. The son of Lieutenant Shara Bey and Sergeant Kes Dameron of the Alliance to Restore the Republic, Dameron followed in his late mother's footsteps in becoming a pilot, serving the New Republic Defense Fleet as the commander of Rapier Squadron, but grew disillusioned with the Republic's inaction to the First Order's violations of the Galactic Concordance. Dameron defected to the Resistance, where he became one of General Leia Organa's most trusted operatives. Dameron flew under the callsign of Black Leader while piloting his specialized T-70 X-wing starfighter, Black One.\n"}