{"id": "Princess_Leia", "name": "Leia Organa", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Princess_Leia", "personality": ["Of commanding presence,[21] Leia Organa was a sharp-witted diplomat who was unafraid to speak her mind, even when confronted by powerful figures like Darth Vader and Grand Moff Tarkin.[5] Fierce, outspoken, and headstrong, she would accomplish whichever task she imposed on herself, for she would try to put duty before her own personal needs—likely, as a result of her upbringing.[20][11] Furthermore, she never cared much for being royalty for her priority was to help those who needed her, and not wealth nor recognition.[40] In spite of her self-discipline, Organa had a fiery temper she often struggled to control, and was eager to prove herself, to be recognized for what she could do instead of for her title of nobility.[21] Stubborn, brave, and smart, she only \"gave as good as she got\", which was one of the reasons why Han Solo had taken a liking to her.[37]\n", "Despite her commitment to Alderaan's values of pacifism, Organa believed in self defense and in fiercely fighting for the galaxy's freedom.[40] With remarkable leadership qualities, Organa was also known for being able to keep her composure even in humiliating situations to perform daring feats, like diving into a garbage chute or strangling the infamous Jabba the Hutt.[5][10] A woman of action, eager to get things done and making positive differences in the world, Organa was impatient, a trait she shared with her brother Luke.[11]\n"], "personality_quotes": [["\"I don't doubt your capabilities, not even for a moment. Taking on all these responsibilities… they've shaped you into a glittering star. You are remarkable. But this is too dangerous, Leia.\"", "―Bail Organa, before her mission to Tatooine[src]"]], "figure_captions": ["Organa was not afraid to fight for her convictions"], "quote": ["I would rather be a monster that believes in something, that would sacrifice everything to make the galaxy better, than be someone who sits on the sidelines and watches as if it has no consequences to them.", "―Princess Leia Organa", "Star Wars Annual 2"], "description": "Leia Organa, a Force-sensitive human female, was a princess of Alderaan, a member of the Imperial Senate, a leader of the Alliance to Restore the Republic, a member of the Galactic Senate, and general of the Resistance. Born alongside her twin brother, Luke Skywalker in the year 19 BBY as Leia Amidala Skywalker, she was the daughter of the Jedi Knight Anakin Skywalker and Senator Padmé Amidala of Naboo. As a result of her father's fall to the dark side of the Force, the Skywalker children were separated with Leia becoming the adopted daughter of Senator Bail Organa and his wife, Queen Breha Organa, who renamed her Princess Leia Organa. Raised with the values of her adoptive parents, Organa supported the principles of the Galactic Republic and opposed the rule of its successor, the Galactic Empire. Despite succeeding to her adoptive father's post in the Imperial Senate, Organa worked in secret to undermine the Empire's operations and was entrusted with the stolen plans to the Death Star, an Imperial superweapon capable of destroying entire planets. Although she was unable to prevent the annihilation of her adopted homeworld, the plans were ultimately delivered to the Rebel Alliance, resulting in the destruction of the Death Star during the Battle of Yavin in 0 BBY.\n"}