{"id": "Qui-Gon_Jinn", "name": "Qui-Gon Jinn", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Qui-Gon_Jinn", "personality": ["Qui-Gon Jinn was a human male who stood 1.93 meters tall[3] and had light skin, blue eyes, and long, brown hair. Though he had risen to the rank of Jedi Master, Jinn did not always agree with the structures and rules of the Jedi Order. He was known to disobey the Jedi Code if he felt he needed to, and was willing to rebuff the Jedi Council when they declined to train Skywalker.[2] After Jinn's old master, Dooku, fell to the dark side and became the Sith Lord Darth Tyranus, Dooku told Kenobi that he wished Jinn were still alive so the late Jedi Master could have helped him with the Confederacy of Independent Systems. Kenobi rejected the idea that Jinn would have joined Dooku, but Dooku told Kenobi that Jinn knew about the corruption in the Galactic Senate and might have joined the Separatist cause—especially if he had learned that the Republic was under the control of Darth Sidious, though Dooku did not tell Kenobi that the Separatists were also under Sith control.[2]\n", "While other Jedi focused on meditation to try to understand the future, Jinn lived in the moment.[3] He believed that one's focus on the future should not compromise the concentration on the present, and believed in trusting one's instincts.[2] Even after his death and return as a spirit, Jinn was confronted with Jedi thinking only of the future[source?]; he guided Yoda through Dagobah to learn the secret of eternal consciousness, but Yoda was interested in knowing if Jinn, existing outside of normal time, could tell him the true identity of Darth Sidious. Although Jinn hinted that he knew the truth, he explained he could only guide Yoda towards greater knowledge, not provide him with the answers.[8] Jinn's belief that Anakin Skywalker was the Chosen One looked both at the future and in the moment. Though he acknowledged that Skywalker's future contained an uncertain destiny, he did not dwell on the danger that the Council saw in Skywalker's potential.[2]\n", "Qui-Gon Jinn had an empathetic nature, and had a tendency to take unfortunate life forms under his protection. It was this tendency, as well his defiance towards the Jedi Council, that often frustrated and baffled his Padawan, Obi-Wan Kenobi. When Jinn saved the Gungan exile Jar Jar Binks, and Binks swore a life-debt to him, his compassionate nature was such that Jinn took the hapless Gungan under his wing, much to Kenobi's dismay. This empathy toward all life forms, including the most pitiful and unfortunate, was Jinn's greatest strength.[1]\n", "Jinn's training to retain his identity after death led him to new philosophies, ones unknown to the Jedi Order of the time.[source?] Jinn learned that there were two sides to the Force, a Living Force channeled by the energies of all living beings, and the Cosmic Force into which it fed. It was this symbiotic relationship that allowed the Force to bind the galaxy together, and speak to living beings through the midi-chlorians.[8]\n"], "quotes": [["\"Do not defy the Council, Master, not again.\"\"I shall do what I must, Obi-Wan.\"", "―Obi-Wan Kenobi and Qui-Gon Jinn — Listen (file info)[src]"]], "figure_captions": ["Jinn's spirit explains to Yoda how the connection between the Living Force and Cosmic Force helped him retain his identity after death."]}