{"id": "R2-D2", "name": "R2-D2", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/R2-D2", "personality": ["R2-D2 was known for his loyal, courageous, and assertive personality. Over the years, R2-D2 had served several masters diligently including the Royal House of Naboo, Senator Padmé Amidala,[12] the Jedi Knight Anakin Skywalker,[13] Senator Bail Organa,[17] and Anakin's son, Luke Skywalker.[74] While R2-D2 was not designed for combat, R2-D2 was still able to hold himself well in a fight on several occasions during the Clone Wars and the Galactic Civil War. Unlike his fastidious and worry-prone protocol counterpart C-3PO, R2-D2 had an adventurous spirit and was able to cope well under challenging circumstances. Unlike C-3PO, he was able to keep secrets and employ deception to achieve his masters' goals.[9]\n", "Due to his resourcefulness and quick-thinking nature, R2-D2 acquitted himself well during a number of difficult and challenging missions including repairing the Naboo Royal Starship's shield generator.,[12] preventing T-7 ion disruptor rifles from falling into the hands of the Empire,[17] and delivering Luke's lightsaber during a mission to rescue Han Solo and Chewbacca from Jabba the Hutt.[9]\n", "R2-D2 and the former Jedi Padawan Ahsoka Tano also had a mutual liking and respect for each other. R2-D2 helped Ahsoka escape a pair of pilots that Senator Organa had hired to bring her to him. Senator Organa once joked that R2 was far too independent for an astromech droid but did not give him a memory wipe out of respect. Tano quipped that R2-D2 had several \"bad\" role models including Anakin Skywalker and Senator Amidala. Later, R2 repaired Tano's freighter.[60]\n", "R2-D2 was loyal to his master Princess Leia Organa and was determined to get her message to Obi-Wan Kenobi despite the odds stacked against him.[5] R2-D2 showed ingenuity when he helped Princess Leia and Evaan Verlaine defeat a platoon of stormtroopers on Sullust by luring a pack of rockrenders to attack them.[66] R2-D2 also showed initiative when he beamed Princess Leia's message to Chief Beon Beonel, helping repair the breach between the Alderaanians and the Alder-Espirions and save the Alderaan Flotilla from destruction at the hands of an Imperial Star Destroyer.[68]\n", "R2-D2's determination to deliver the Death Star plans to the Alliance once led him to attempt to sabotage R5-D4 in an attempt to improve his chances of being sold. However, R2 relented upon learning about R5's sad story. Instead, R2-D2 managed to convince R5-D4 to help him get sold by telling him that the fate of the galaxy depended on it and that he was working for the Rebellion. This moved R5, who once worked for the Rebellion. R2-D2 could also speak in Binary with other astromech droids.[63]\n"], "personality_quotes": [["\"Artoo's here to handle it. Believe me, I've never seen a jam he couldn't beep his way out of.\"", "―Leia Organa[src]"], ["«Thank you, friend. You may have saved the galaxy today. I will never forget you.»", "―R2-D2 to R5-D4[src]\n"]], "figure_captions": ["Artoo playing host to several porgs on Ahch-To"], "quote": ["Thank you for telling me all this. I know it can be hard to talk about, but war stories are important. I sometimes think it's my destiny—to see things, to be present, to witness the galaxy moving, evolving. It happens to me over and over again—but even so, I can't see everything. And so, I like hearing the stories. Recording them.", "―R2-D2, to BB-8\n", "Poe Dameron 28: The Awakening, Part III"], "description": "R2-D2, pronounced Artoo-Detoo and often referred to as R2(Artoo), was an R2 series astromech droid manufactured by Industrial Automaton with masculine programming. A smart, spunky droid serving a multitude of masters over its lifetime, R2 never had a full memory wipe (apart from a partial mind-wipe by Cad Bane during the buildup to the senate hostage crisis) nor has he received new programming, with these factors resulting in an adventurous and independent attitude. Oftentimes finding himself in pivotal moments in galactic history, his bravery and ingenuity saved the galaxy time and time again.\n"}