{"id": "Rey", "name": "Rey", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Rey", "personality": ["Rey was a human female who stood at 1.7 meters[3] and weighed 54 kilograms.[4] She had brown hair, hazel eyes, and light skin[3] that adapted to the extreme ultraviolet radiation emanated by the sun that shone down on the desert world of Jakku. The harsh realities of such a world could have easily made a person cynical or guarded against sympathy and weaknesses, but not Rey. Despite eking out a meager existence in the scorching heat of the Western Reaches planet, Rey possessed a heart full of generosity and a willingness to help other people in need.[2] It was this willingness that led her to not only help BB-8 be free of Teedo's interference and Plutt's attempts to acquire the droid, but also led her to help BB-8 in its mission to return the star map it carried to the Resistance. Though she never wanted to leave Jakku for fear that she would not be there when her family returned for her,[5] she believed in the importance of the Resistance and its fight against the First Order enough that it gave her strength to continue on BB-8's mission to find Luke Skywalker and defeat the First Order.[2] She also believed in the importance of the Jedi Order; in spite of Skywalker's jaded views and rejection of his Jedi heritage, Rey remained steadfast in her belief that the return of the Jedi was paramount to defeating the First Order.[21] Notably, her courage and utter refusal to concede to despair made her the only Jedi to earn Snoke's respect as a worthy adversary.[6]\n", "For years, Rey's imagination took her mind to other worlds, including those with lush green forests[2] and beauty that she could never even dream of. The adventure she found while helping BB-8 and Finn brought her to one such world in the form of Takodana,[5] where she began to realize that her destiny was not in the junkfields of a remote desert planet. Her encounter with Maz Kanata profoundly impacted how she saw herself and what she was capable of, and Rey began to see that she was part of a larger galactic fight—and that the power of the Force was with her. Her recognition of these abilities and her destiny coincided with turbulence in the Cosmic Force, which for years had remained dormant,[2] and ultimately led her to find Skywalker.[5] The years that she spent on Jakku also proved useful when faced with Skywalker's obstinacy; having learned the value of patience, Rey remained on Ahch-To despite the old Jedi Master's refusal of her entreaty, determined to wear him down.[22]\n", "Though optimistic and hopeful, Rey spent years living in denial about her parents until Kylo Ren forced her to confront the truth.[21] Rey tearfully admitted that her parents were no one special,[6] merely junk traders who sold their daughter in order to satisfy their alcoholism. She had hoped to learn more about her parents during her visit to Ahch-To, but was left with feelings of disappointment and even greater loneliness than before. She also felt abandoned by Skywalker, and therefore confided in Ren, whom she assured was not alone. Her feelings toward Ren gradually changed due to the bond they shared in the Force. At first, Ren's presence incited anger within Rey,[22] who mourned Han Solo as the father she never had.[21]\n", "As their connection grew stronger, Rey was surprised by how open Ren was with his emotions and became driven to learn the truth about his fall from grace.[22] Whereas she initially dismissed Ren as a failed student, Rey came to see Skywalker as a failure for losing faith in his nephew.[6] Trusting in the Force,[21] Rey firmly believed that Ren would turn from the dark side with her help,[6] having perceived a glimmer of good within the conflicted Knight of Ren.[26] After Ren declared himself the new Supreme Leader, Rey felt neither hatred or compassion for him yet also grew to believe that Kylo Ren was nothing more than a shell and Ben Solo was the true persona.[21]\n", "Rey, who learned from Han Solo that the legends of the Force were true,[22] was deeply spiritual. She believed in the existence of the Force, but her knowledge of it was lacking due to her limited exposure to its powers. As her training progressed under Skywalker, Rey began to see the Force as something more than the abilities it granted to Force-sensitive individuals. She agreed with Skywalker that the Force was the balance between opposite concepts—such as life and death, creation and destruction, or light and darkness—though she continued to disagree with her master's intention to end the Jedi Order. It was her faith in the Force that led Rey to confront Ren in person. She initially felt vindicated by Ren's betrayal of Snoke, exulting at the way he saved her by striking down his own master, yet was shocked by his resolve to continue down the dark path, having felt certain that Ren's redemption was the will of the Force. Nevertheless, she refrained from killing him while he was unconscious, in spite of her own inclination to take his life while he was defenseless. To Rey, it was the Force's will that Ren continued to live, though for what purpose she did not know. As such, Rey adopted a \"wait and see\" approach regarding the Force's plans for Ren.[21]\n", "During Rey's time on Ahch-To, Skywalker felt that she reminded him too much of himself:[27] full of hope,[21] impatient[28] and reckless.[29] Snoke preyed on those attributes, knowing that Rey could not \"resist the bait\" he had laid before her.[6]\n"], "personality_quotes": [["\"Actually, the droid's not for sale.\"", "―Rey refuses to sell BB-8[src]"]], "figure_captions": ["Despite the harsh conditions of her upbringing, Rey was compassionate and willing to help those in need.", "Rey wielded her quarterstaff against one of Unkar Plutt's thugs, successfully repelling him.", "Rey's empathy gradually extended to her nemesis Kylo Ren, causing her to reach out to the former Ben Solo in the hopes of turning him back to the light."], "quote": ["Something inside me has always been there, but now it's awake and I'm afraid.", "―Rey", "Star Wars: Episode VIII The Last Jedi"], "description": "Rey, a Force-sensitive human female, was a scavenger who lived on the forlorn frontier world of Jakku during the era of the New Republic. In 34 ABY, events drew her away from her homeworld and into the galactic conflict between the First Order and the Resistance. Though initially unaware of her connection to the Force, Rey's powers would manifest during the waning days of the cold war, consequently leading her on the path to becoming a Jedi under the guidance of Jedi Master Luke Skywalker.\n"}