{"id": "Saw_Gerrera", "name": "Saw Gerrera", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Saw_Gerrera", "personality": ["Saw Gerrera had a reputation as an able but ruthless and cunning commander during the Clone Wars and the rebellion against the Galactic Empire.[8] His harsh methods led many to regard him as an unrepentant extremist.[2] Saw bore great antipathy towards the Separatists for invading his homeworld Onderon. He also disliked the Geonosians due to their alignment with the Separatists and for building gunships which led to his sister Steela's death. This coupled by the loss of his comrades during a mission on Geonosis led him to brutally interrogate the Geonosian Klik-Klak, much to the discomfort of his former comrade Rex and the Spectres.[8]\n", "Despite his antipathy towards the Geonosians, Saw was horrified by the Empire's genocide against the species and believed that they had the same right to rebuild as other species. Saw's change of heart led him to release Klik-Klak and the Geonosian queen egg he was guarding. Saw disagreed with the Jedi's principled tactics and believed that it cost them the Clone Wars. Saw also opposed the Empire and was prepared to defeat it through any means necessary.[8]\n", "Saw's aggressive tactics including the killing of prisoners, civilians, and violations of the rules of engagement created strife with Mon Mothma, the leader of the Rebel Alliance. Saw regarded Mothma as weak and indecisive while Mothma regarded him as a war criminal and terrorist. Saw saw potential in Ezra, Sabine, and Chopper as effective soldiers for a mission to discover the Empire's secret superweapon. However, Saw's willingness to risk the lives of civilians in this quest strained his partnership with Ezra and Sabine. Ezra, who initially admired Saw's ability to acquire intelligence, became disillusioned with his ruthless and aggressive tactics.[34]\n", "Saw became a mentor to Jyn Erso after she lost her parents to the Empire. He abandoned her at the age of sixteen in order to protect her from other rebels who wanted to use her as a hostage due to her status as Galen Erso's daughter. Saw initially did not believe the Imperial defector Bodhi Rook's report that the Empire was building a new superweapon called the Death Star and had him tortured with a Bor Gullet. Despite his estranged relationship with Jyn, Saw was still able to inspire her to find the weakness in the Empire's superweapon in order to save the rebellion. Saw was unafraid of death and stayed behind when the Empire destroyed the Jedha Holy City.[2]\n"], "personality_quotes": [["\"You target civilians, kill those who surrender, break every rule of engagement! If we degrade ourselves to the Empire's level, what will we become?\"\"There she is! That's the leader the Rebellion needs! Where is that fire, that passion, when your people need it most? I hope, Senator, after you've lost, and the Empire reigns over the galaxy unopposed, you will find some comfort in the knowledge that you fought according to the rules.\"", "―Mon Mothma and Saw Gerrera[src]"]], "figure_captions": ["Saw Gerrera"], "quote": ["I'm not a terrorist. I'm a patriot. And resistance is not terrorism.", "―Saw Gerrera", "The Soft War"], "description": "Saw Gerrera was a human male Onderonian resistance fighter who, as a leading member of the Onderon rebels, fought against the Confederacy of Independent Systems on Onderon during the Clone Wars. He and his sister, Steela Gerrera, were instrumental in the rebel liberation of their homeworld during the Onderonian Civil War. He later became a key member in the fight against the Galactic Empire and the formation of the Alliance to Restore the Republic. His tactics against the Empire led him to be seen as an extremist, one whose notoriety was recognized by the Empire and, many years later, the New Republic.\n"}