{"id": "Wedge_Antilles", "name": "Wedge Antilles", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Wedge_Antilles", "personality": ["Wedge Antilles was a human male with brown hair, brown eyes, and light skin.[2] While Antilles had earned a place at the prestigious Skystrike Academy, he became disillusioned with the Empire for shooting unarmed transports. This led him and Derek Klivian to desert the Empire and join the rebellion.[4] In his youth, Antilles could be carefree at times and was once had to reminded by Hera to remain alert for an upcoming training exercise.[10] Antilles also found the droids AP-5 and Chopper petty and argumentative. Still, he was a good team player and joined forces with his fellow rebels to steal Imperial clearance codes and to prevent an Imperial-hijacked Chopper from transmitting the coordinates of Chopper Base to the Empire.[12]\n", "Through his service to the Rebel Alliance, he garnered the respect of his fellow Rebel fighters.[3] Focused and calm during his flights,[2][6][27] he firmly believed that the only way to improve as a pilot was to constantly come up against the impossible and push oneself to the limit; during battles, he would concentrate on keeping his cool and trusting his instincts.[15] Antilles disliked being away from a cockpit for too long, and though he did not mind commanding, Norra Wexley once noticed that his whole body seemed to hunger for being behind a flight stick.[8] Despite his talent and standing among his fellow pilots, Antilles remained approachable and friendly to those around him.[15][16]\n", "Bitter at the Empire for what it had done to the people he loved,[7] Antilles had an unwavering strength of belief in the Alliance,[24] and although courageous and full of resolve, he once resorted to bravado at the prospect of being tortured to death.[7] He was also unaccustomed to not being taken at his word—if he believed someone was good and told them so, he really meant it as he was not one to flatter others in his own interest,[24] and was not capable of telling others easy lies.[8] Antilles was known to be fond of giving everyone lectures about trigger discipline, which meant not putting one's finger on the trigger until they were ready to pull it.[8]\n", "Wedge's loyalty to Princess Leia led him and his Phantom Squadron pilots to take part in an unsanctioned mission to liberate Kashyyyk.[8] While the New Republic military leadership publicly praised Wedge and his fellow pilots, they were transferred to support duties as punishment for acting outside the official chain of command. Due to this disciplinary action, Wedge was despondent and unwilling to take risks. However, his friend Temmin managed to convince him to change his mind by reminding Wedge of his past heroism during the Galactic War. Wedge was a competent commander who led his squadron in attacking Imperial ground forces on Jakku in order to aid the New Republic ground assault.[30]\n"], "quotes": [["\"Phantom Squadron is shut down.\"\"Then bring it back from the dead! Nobody has to know we're doing it. Nobody has to see us coming. We can be like real phantoms, Wedge. Not heroes in the books, but who cares about being in the books? My mom is there. My droid, too. I want them back. You don't want to help me get them? Fine. But then I'll know who you really are, and it isn't the guy who flew against two Death Stars and all the Empire. I'll know you're not a pilot anymore. You're just some hangar-monkey, some tired old sir-yes-sir game-leg who cares more about docking ledgers than he does about actual people.\"", "―Temmin Wexley managed to convince Wedge Antilles to participate in the Battle of Jakku by appealing to his past heroism[src]"]], "figure_captions": []}