{"id": "Yoda", "name": "Yoda", "fandom": "starwars", "url": "https://starwars.fandom.com/wiki/Yoda", "personality": ["Known for his wisdom, Yoda had spent eight centuries training and tutoring generations of Jedi.[2] He was reluctant to accept Anakin Skywalker or Luke Skywalker for Jedi training, considering them unfit. In both cases, however, he allowed Obi-Wan Kenobi to persuade him into accepting them as trainees.[7][59]\n", "When Dooku triggered a partial room collapse during his duel with Yoda on Geonosis, the Jedi, confronted with the choice of pursuing the fleeing Sith or protecting the hurt Obi-Wan Kenobi and unconscious Anakin Skywalker from the falling debris, opting to save his comrades instead of going after Dooku.[10] However, when fellow Master Plo Koon's fleet was destroyed by the Confederate superweapon Malevolence, Yoda forbade Anakin Skywalker and Ahsoka Tano to conduct a search for Koon, citing the danger posed by the Separatist vessel.[33]\n", "Yoda was able to resist being tempted by the specter of the dead Sith Lord Darth Bane, who had appeared to him in a vision on the planet Moraband, recognizing that the spirit was a mere illusion and rejecting its call to the dark side.[47]\n", "As he neared his death before the Battle of Endor commenced, Yoda accepted his own mortality and imminent demise and died becoming one with the Force.[2]\n", "Yoda's ears were expressive and would sometimes curl when he was expressing strong emotions like surprise.[6] These ears were also highly sensitive.[11]\n", "Despite his intensive Jedi training and high status within the Order, he stated that he secretly had a dislike for ancient Jedi texts. He also had a good sense of humour and a sense of curiosity, despite his age and wisdom, which was shown when he playfully rummaged through Luke's belongings when he first met him, fought R2-D2 for a torch, and laughed gleefully when he supposedly set the ancient Jedi texts on fire, and finding Luke's continued ignorance amusing, commenting that he had \"missed him\".\n", "Yoda was highly secretive about his homeworld and never revealed it to anyone.[11]\n"], "personality_quotes": [["\"You knew Master Yoda?\"\"Yes. He taught almost all of the younglings in the temple, at one point or another.\"\"Kanan described him to me. Small, green, and wrinkly with pointy ears. But he didn't know what he was really like.\"\"I'm not sure anyone did. He was wise, kind, but when I was young, he seemed happier. As the Clone War dragged on, he carried a great burden, a deep sorrow, as if he knew before anyone else that one time was ending, and another beginning.\"", "―Ezra Bridger and Ahsoka Tano[src]"]], "figure_captions": ["Yoda served as a teacher for the Jedi for 800 years."], "quote": ["For my ally is the Force. And a powerful ally it is. Life creates it, makes it grow. Its energy surrounds us and binds us. Luminous beings are we, not this crude matter. You must feel the Force around you. Here, between you…me…the tree…the rock…everywhere! Yes, even between this land and that ship.", "―Yoda to Luke Skywalker", "Star Wars: Episode V The Empire Strikes Back"], "description": "Yoda, a Force-sensitive male member of a mysterious species, was a legendary Jedi Grand Master who witnessed the rise and fall of the Galactic Republic, as well as the rise of the Galactic Empire. An ancient Jedi revered for his advanced age and wisdom, Yoda served as Grand Master of the Jedi Order during the latter days of the Republic and also held a seat on the Jedi High Council along with other legendary masters such as Mace Windu and Ki-Adi-Mundi. For over eight-hundred years, he mentored others in the ways of the Force and had a hand in the training of many Jedi during their time as younglings.\n"}