{"id": "Alliser_Thorne", "name": "Alliser Thorne", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Alliser_Thorne", "personality": ["Though Alliser Thorne is depicted as a stern, unsympathetic and sometimes cruel man, he is not inherently malicious or evil. His behavior and animosity towards Jon Snow and the other recruits of the Night's Watch appear to be due to his noble background and his distaste at how the Watch has become nothing more than a glorified penal colony. His resentment towards Jon stems from his dislike for Ned Stark, one of the rebels who brought down the Targaryen dynasty, which led to Tywin Lannister having him exiled to the Wall. Thorne has become a hardened and bitter person as a result, and does not tolerate weakness or cowardice, demonstrated when, for entertainment, he humiliates Samwell Tarly in the courtyard, and shows anger at Jon protecting him, telling him that being soft will not help Sam and will only get him killed.\n", "Despite his flaws, however, Thorne appears to be a fundamentally decent man, and most of his actions are dedicated towards protecting the Wall and the Seven Kingdoms against any threat from the lands beyond, no matter how unethical they may seem. He holds Maester Aemon and Qhorin Halfhand in high regard, outright admitting to Jon that he saw Qhorin as a brother, and valiantly leads the Night's Watch into battle against the wildlings and duels Tormund Giantsbane alone. Prior to the battle, he shares a moment with Jon and explains the difficulties of leadership to him, and does his best to encourage Jon to not lose heart, though this is possibly because he believed they were both about to die soon. Following Maester Aemon's funeral, he warns Sam that he is losing his friends, which could be his own gruff way of warning Sam of what is coming.\n", "His dedication to his goal and his distrust for Jon are also what lead him to spark a mutiny against Jon: in his eyes, by letting the wildlings pass through the Wall into the Seven Kingdoms to avoid the coming White Walkers, Thorne believes that Jon has committed the ultimate betrayal towards the Night's Watch, since keeping the wildlings beyond the wall was the very cause that most of their sworn brothers bled and died for, which appears to depict him as somewhat shortsighted, given his hatred for the wildlings blinds him to the true danger approaching Westeros. Thus, he does not stab Jon out of spite or envy, but out of anger and grief for his slain comrades, hence his words, \"For the Watch\" (although David Benioff and D. B. Weiss have hinted that Thorne's personal vendetta against Jon may have been a factor in his decision to mutiny against him).\n", "In his final moments, Thorne contemplated that it wasn't a choice of betraying Jon or betraying his personal interest, but rather the latter meaning betraying the Night's Watch - Jon had brought the Wildlings from Beyond the Wall and broken a crucial element of the vow he took, and in Thorne's opinion that justified his execution. Despite this, Thorne admitted that he had ultimately lost the battle he was fighting, and calmly awaited his execution, believing it was finally his chance to rest - however he still pointed out to Jon that the latter would be fighting their battles forever in Alliser's place.\n"], "quotes": [], "figure_captions": []}