{"id": "Arya_Stark", "name": "Arya Stark", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Arya_Stark", "personality": ["Arya is a fiercely independent child who is unconstrained by social expectations like gender roles, courtly virtues, class distinctions, and the expectations of her parents and siblings. A tomboy, she never aspired to be a \"proper lady\" as her older sister Sansa did. Before the series of events that shatter her innocence and destroy her support system, Arya is full of life, and she makes others smile just by virtue of her spirited indifference to rules. \n", "Once she begins the journey to King's Landing, however, she endures a constant stream of loss and trauma. As she watches her pet, sword instructor, friends, and family members taken from her one by one, she becomes increasingly detached towards murder and death. This is only exacerbated when she is captured by the Hound and is exposed to his fatalistic worldview as they traverse the war-ravaged Riverlands, though the two develop a mutual reliance and almost grudging respect for each other. When she witnesses and learns of the betrayal and murder of her family at the Red Wedding, she becomes colder and her urge to seek revenge on those who have wronged her and her family increases.\n", "While she is initially horrified when she accidentally stabs the stableboy in King's Landing during the betrayal of her father and his men, by the time she and the Hound have fled the massacre at the Twins, she is able to kill without remorse and has accepted Syrio's belief that the only true god is Death. Following Yoren's advice to her before he died, she has taken to listing off the names of each person she intends to kill each night before she sleeps.\n", "Arya can be a rather cold-blooded, slightly sadistic person at times, especially while confronting and killing those who are on her death list. Though she was initially apathetic but satisfied with killing Meryn Trant and Polliver, she did not attempt to hide her glee over slitting Walder Frey's throat. While she certainly possesses compassion and kindness, her time with The Hound and the Faceless Men have taught her to be ruthless to those who have wronged her and her family and has shown to be willing to use psychological mind games to worsen her enemies fate before killing them. This is shown when she repeated every word Polliver said to Lommy before killing him in the same exact way with Needle; gouged the eyes of Ser Meryn before stabbing him repeatedly and butchering Lord Walder's sons before serving their corpses to their father inside of a pie.\n", "That being said, Arya is not completely blinded by hate. After learning that her family has retaken Winterfell, she ultimately chooses reuniting with her loved ones over vengeance against her enemies (at least for the time being).\n"], "personality_quotes": [], "figure_captions": [], "quote": ["A girl is Arya Stark of Winterfell, and I'm going home.", "―Arya Stark re-asserts her identity to Jaqen H'ghar", "No One"], "description": "Arya Stark is the third child and second daughter of Lord Eddard Stark and his wife, Lady Catelyn Stark. After narrowly escaping the persecution of House Stark by House Lannister, Arya is trained as a Faceless Man at the House of Black and White in Braavos, and uses her new skills to bring those who have wronged her family to justice.\n"}