{"id": "Barristan_Selmy", "name": "Barristan Selmy", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Barristan_Selmy", "personality": ["A seasoned knight, Barristan Selmy served under the Kingsguard of King Aerys Targaryen and Robert Baratheon and protected them both all his life. Though he was an old man when he came into the service of Robert and Daenerys Targaryen, Barristan was a courageous and fierce fighter who could duel evenly with much younger and skilled swordsman, once even claiming that he could cut into the five Kingsguard like \"carving a cake\" (Considering that barely any of the Kingsguard present were especially skilled warriors, this was probably true). He valued honor greatly and grew disgusted how Cersei and Joffrey were weeding the Small Council and court with sycophants; in rage he surrendered his title of Lord Commander but refused Varys's offer as he was a knight and would die a knights death. Like most honorable men, Barristan held some mistrust towards the Kingslayer, Jaime Lannister; although the two men had mutual respect for each others' skills, Barristan still saw his murder of Aerys as a very dishonorable act, and although he did not treat him with open contempt, he believed it would be dishonorable to reward Jaime with command of the Kingsguard after what he had done.\n", "However, Barristan's dutiful personality occasionally put him at odds with his sense of morality. As a knight does not question or go against the wishes of his King, no matter what the King does or will do, with the Mad King, he could only watch as Aerys burnt innocent people alive and do nothing about it due to the oath he had sworn. While this exemplified the fact that he was an extremely honorable man, it also marred his conscience for the rest of his life. He served Robert Baratheon faithfully on the basis that Robert was more or less a fundamentally good man, even though he was also an extremely ineffective King. However, when Joffrey relinquished him entirely, Barristan vowed to serve under a king who he was proud to serve and believed in. His loyalty to his monarch was such that he was verbally incredulous when Cersei tore up Robert's final decree, stating that they were the King's words.\n", "Barristan was also a deep supporter of House Targaryen. Though he was horrified regarding the acts that Aerys committed, he still fought to retain the Targaryen Dynasty during the Sack of King's Landing and was close with Rhaegar, Aerys's son whom he bodyguarded. Though he served under the man who killed Rhaegar and stole Aerys's throne, he continued to support the Targaryens and finally assisted the Mad King's last living heir, Daenerys in helping her seize her birthright. Ser Barristan Selmy was extremely brave, being completely able to confront a ring of Sons of the Harpy with only a sword and no armor, while his faceless opponents had the advantage of armored faces, numbers and weapons. Barristan fought incredibly well for a man of his age, cutting down a great number of the Sons without even crossing swords twice, even continuing after he was severely wounded and disoriented - what is fitting is that one of the greatest warriors that the Seven Kingdoms knew died the way he always wanted to, fighting against the forces of a malevolent and dangerous enemy with a sword in hand.\n"], "quotes": [], "figure_captions": []}