{"id": "Bran_Stark", "name": "Bran Stark", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Bran_Stark", "personality": ["Before the incident of his fall, Bran was an extremely curious and adventurous boy. He was noted by his mother, and by his brother Robb, to have done a great amount of climbing around the walls of Winterfell and having never fallen, showing a considerable amount of bravery on his part. His curiosity was in large part what led to his fall in the first place, since he was drawn into the encounter between Jaime and Cersei out of sheer curiosity as to what was happening. After his fall, Bran turned towards melancholy, citing that he would rather be dead than be unable to walk, distressing Robb upon hearing Bran say so. This factor is to be expected, because Bran had a previously extremely adventurous nature and couldn't bear to be unable to continue that way. However, Bran became happier once Tyrion gave him the designs for a special saddle, since he also loved riding as much as he did climbing. Bran had it in him to be a good lord in his own right, as proven by his brief tenure as acting Lord of Winterfell when Robb left to fight Tywin Lannister.\n", "After Theon Greyjoy betrayed his house and seized Winterfell, Bran's innocence proved to be a disadvantage for him, since Theon coerced him into surrendering Winterfell under the promise that nobody would be harmed. Bran proved unable to predict that Theon, under excruciating pressure from his bad reputation among the ironborn, would break his word the moment somebody openly defied him. Bran was a compassionate young man, still, and pleaded tearfully when Theon ordered for Ser Rodrik Cassel to be executed. Upon meeting Jojen Reed, however, Bran proved capable of accepting the powers that he possessed, showing an open mind on his part, even if such a thing set him apart from companions like Osha. He became almost unbreakably determined to meet the Three-Eyed Raven that kept coming to him in his dreams, even if it meant separating from his brother Rickon and, later on, from Jon Snow (who would have protected him at Castle Black). When Bran finally reached the Three-Eyed Raven, one of the first things he pressed the Three-Eyed Raven about is whether or not Bran could walk again, and is briefly disappointed when told that he will never walk again.\n", "After growing up under the tutelage of the Three-Eyed Raven, Bran maintains his curious nature, especially when he and the Raven visit Winterfell; his curiosity piques when he sees his long-dead aunt Lyanna. Bran is disappointed by the prospect of returning to the real world. Later on, Bran expresses confusion when witnessing the duel at the Tower of Joy, especially when his young father started losing the duel - this confusion turned to horror when he realized that Arthur Dayne lost only because Howland Reed blindsided him, having been told all his life that Ned ultimately killed the man in an honorable duel. This horror resurfaced when he realized that the Children of the Forest were responsible for the creation of the White Walkers, only to be silenced when Leaf cited the havoc caused by men to be the main reason for this course of action. He also shows incredulity at what his own powers can accomplish, as shown when he realizes how he is responsible for breaking Hodor's mind in the first place.\n", "Upon returning from Beyond the Wall, Bran's personality has changed significantly, as a result of the expansion his powers have taken since the battle at the Cave of the Three-Eyed Raven. He has become extremely calm to a fault, to the point of being almost detached from everyone else around him. Having become the new Three-Eyed Raven, Bran has been given access to many more events, which he explains several times, so much that Bran becomes aware of almost anything, for example the wedding between his sister Sansa and Ramsay Bolton, and even the conversation between Littlefinger and Varys. He also shows a rather dangerous and threatening side, as evidenced by his deadpan recital of Chaos is a ladder to Petyr Baelish, outright showing that he knows how treacherous Petyr is and what he has done against House Stark in the past, but also suggesting that Petyr is unable to manipulate him. Also, Bran shows himself to have become almost wiser than he was before, ultimately not accepting the Valyrian steel dagger that Littlefinger gives him, citing that it would be useless for a cripple, but at the same time obviously not trusting the gifts that the man gives him. However, Bran is not truly omniscient, as he still needs to witness events in order to find out about them, as shown by his surprise when he heard that Rhaegar and Lyanna were secretly married.\n"], "quotes": [], "figure_captions": []}