{"id": "Brienne_of_Tarth", "name": "Brienne of Tarth", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Brienne_of_Tarth", "personality": ["Brienne has spent most of her life as the object of scorn, rejection and – at best – pity. When she tried to dress and act like a proper lady, she was met with mockery and disdain for her unattractive appearance and lack of feminine social graces; when she turned to a career more suited to her talents as a warrior, she received only contempt and resentment for her gender despite her considerable skill. Her lifetime of scorn and condescension led her to becoming extremely pragmatic and blunt. However, it has also provided her with nerves of Valyrian steel, and she is completely unafraid to face off against warriors as powerful or as intimidating as Jaime Lannister (arguably the best sword in the realm), Loras Tyrell (a renowned warrior) and even Sandor Clegane (a physically brutal and extremely intimidating person with an infamous temper).\n", "Perhaps because of this background, Brienne is as awkward in personality as she is in appearance; Catelyn Stark notices that she has none of the easy confidence of some other warrior women. She yearns for respect and acceptance from others, and easily gives her love and loyalty to the few people who treat her with any degree of genuine courtesy. Renly Baratheon, Catelyn Stark, and Jaime Lannister are among those who have won Brienne's friendship and service in this manner. Brienne, much like Ned Stark, is motivated by her own sense of honor and duty, thus seeing most dishonorable acts as unacceptable. She often faces situations where her honor is eclipsed and opposed by her heart, since she confessed to Jaime that her failure to sway the Blackfish would result in the two of them fighting one another again, saying so in a tone that states outright she doesn't want to fight him - even though she has a considerable chance of defeating him.\n", "She can be headstrong, sarcastic, cynical and judgmental, but she is also honest, straightforward, loyal, and determined. Although she has received extremely poor treatment from most knights, Brienne clings to a naively idealized concept of knighthood. Despite – or perhaps because of – the fact that she has no expectation of ever being recognized by society for her accomplishments and strength of character, she nevertheless strives to live up to the ideal of a true knight at all times. Brienne adheres to the expectations and guidelines of knighthood almost formally, since she expressed at the climax of her fight with the Hound that she had no wish to kill him (which he ignored and continued to fight her), and also carried out the killing of Stannis Baratheon as if it were an official execution, even permitting him any last words. However, she incorrectly cited that Renly was the rightful king, even though he was second to Stannis, but this was done mostly out of personal loyalty.\n", "Brienne has proven herself to be one of the strongest fighters in Westeros, albeit the most underrated. In combat, she relies on a combination of her intimidating size, strength, and unrelenting brute force to win most fights. This unrelenting style is what allowed her to defeat Loras Tyrell and Sandor Clegane, two of the greatest swordsmen in the realm. She could fight three men at the same time, beat two armored soldiers in a confined space and hold her ground against Jaime Lannister. Even after she was presented with a prominent disadvantage, such as being disarmed, she would resort brutally to continue fighting, shown when she proceeded to fight the Hound even after he'd ridden her of her sword. Jaime confessed that he considered her a good fighter, even before they became friends.\n", "Brienne of Tarth is extremely noble and humble at all times, as evidenced by her confessing at several points that she was not a knight, and at one point not even a lady - even though she was inevitably a lady of Tarth as the only daughter of Lord Selwyn Tarth. This was probably motivated by her self-induced belief that she was inferior to the standards of a true knight, given that she has faced being underrated and underappreciated for her appearance and gender her whole life. The irony of the entire situation is that she exemplifies the qualities of a true knight: She is a strong and skilled fighter, is merciful and compassionate, unshakably loyal and determined, and takes her duties as a warrior sworn to a higher authority extremely seriously. The only reason she isn't viewed as such by the people of the Seven Kingdoms is because she is a woman.\n"], "personality_quotes": [], "figure_captions": ["Brienne faces down the Kingslayer."], "quote": ["All my life men like you've sneered at me, and all my life I've been knocking men like you into the dust.", "―Brienne to Jaime Lannister", "The Prince of Winterfell"], "description": "Brienne Tarth, commonly known as Brienne of Tarth, is a warrior of House Tarth, and the only daughter of Lord Selwyn Tarth.\n"}