{"id": "Catelyn_Stark", "name": "Catelyn Stark", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Catelyn_Stark", "personality": ["Catelyn was a woman who was both dutiful and complex: in many ways, she fitted the expectations of her house, and their words 'Family, Duty, Honour', but she often found herself at odds with these words. She was a loving mother, and her maternal disposition influenced much of what she did; all of her children loved her and they would come to mourn her as they did their father when she was killed.\n", "Catelyn was capable of being a very intelligent woman, as evidenced by many of her actions during the prelude of the War of the Five Kings, and later during the war itself. She was capable of deducing that the Lannisters were behind the attempted murder of Bran. Unfortunately, she jumped to the conclusion that it was Tyrion Lannister who hired the catspaw assassin, based on Petyr Baelish's lie that the dagger belonged to Tyrion. She was also clever enough to suggest aloud that she was taking Tyrion back to Winterfell, but goes to the Eyrie instead so nobody could stop her from bringing Tyrion to justice she had mistaken him for deserving. Catelyn would later prove her wisdom in times of war by reminding Robb of the man that they were up against - Tywin Lannister - and the fact that the Lord of Casterly Rock's completely ruthless reputation would mean that Robb would have to defeat the Lannisters openly in the field if they meant to survive. Despite being more politically savvy than her husband, however, Catelyn made her fair share of mistakes, as well: she impulsively arrested Tyrion, and her trust in Littlefinger and Lysa also blinded her to the fact that time and experience had changed them both for the worse.\n", "She was, to a great extent, a peaceful woman. This is shown when she pleaded with Renly Baratheon to make peace with Stannis instead of fighting his own brother to the death in open battle, even though she had seen the man Stannis had become and both of them knew that Stannis would never be agreeable with them. However, this did not prevent Catelyn from being incredibly fierce when she was pushed - when Loras Tyrell slighted Robb's actions during the war, she coldly repelled him by reminding the Knight of Flowers that Robb was actually fighting a war instead of playing at one. She later accosts Renly for treating this potentially disastrous war as if it were a game, showing that she had a very mature and pragmatic view of a situation. With Jaime Lannister as her prisoner, Catelyn showed disgust for him for the crimes he committed, and for what his family had done to hers; however, this did not prevent her from releasing Jaime in the hope that it would win her daughters back. When she met Tyrion Lannister, she didn't hesitate to compel the bannermen of her father into arresting him; when they reached the Eyrie, she actually tried to protect Tyrion when Lysa planned to have him executed without a trial. Also, when she heard of Ned's arrest, and of Lysa's total reluctance to contribute, she became furious when confronting her sister.\n", "Catelyn's resentful and less loving side was brought out in the situation of Jon Snow, who was publicly believed to be her husband's illegitimate son with an unidentified woman. She speaks very coldly to Jon when he came to say goodbye to Bran, and did not farewell him when he revealed that he intended to join the Night's Watch, outright ordering him to leave. She would explain later to Talisa that, when Jon caught the pox as a young boy, she prayed for him to die, only to truly hate herself afterward for wishing such a thing on an innocent child. She promised that she would treat him as her own son and ask Ned to legitimise him if the gods let him live. However, she couldn't bring herself to keep this promise in the end. This shows some amount of hypocrisy on her part, but it also shows that she is self-reproachful as well - this sets her vastly apart from her sister Lysa, who was completely unapologetic about her actions, which were much worse than Catelyn's.\n", "Towards the end of her life, Catelyn became melancholy at the loss of so many family members - her father, her husband, two of her sons and the captivity of her daughters. She laments that she could have done things differently, and that she was incapable of saving her youngest sons. Later, she tearfully remembers her father when she was a child. During the Red Wedding, Catelyn shows a ferocious will to ensure that her remaining family survived - she held Joyeuse, a wife of Walder Frey, at knife-point and threatened to kill her if Robb was not allowed to leave with his life. When Walder rebuked her, and Roose Bolton murdered Robb right in front of her, Catelyn made good of her promise and killed Joyeuse, screaming with despair and becoming catatonic as a result of the grief that overwhelmed her, moments before her death.\n", "Even the people who did not get on well with her admitted that they admired her - namely both Tyrion and Jaime Lannister. Tyrion and Jaime are two people Catelyn showed open contempt for, but Tyrion and Jaime nonetheless admit they admired her. Tyrion recognized that she showed strength when it came to protecting her children, which Jaime seconded later during a confrontation with Catelyn's brother Edmure.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Show them how it feels to lose what they love.", "―Catelyn Stark to her eldest son, Robb Stark", "The Rains of Castamere "], "description": "Catelyn Stark, née Tully, was born into House Tully as the daughter of Hoster Tully, the Lord Paramount of the Trident, and sister of Lysa and Edmure Tully. She married into House Stark through her marriage to Eddard Stark, though she was originally intended for Brandon Stark. Together, she and Eddard had five children: Robb, Sansa, Arya, Bran, and Rickon. Catelyn was a devoted mother and was fiercely protective of her children.\n"}