{"id": "Cersei_Lannister", "name": "Cersei Lannister", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Cersei_Lannister", "personality": ["She is not completely devoid of tact. Despite their blatant attempt to deceive her and collect the reward on her brother, Cersei opts not to punish a pair of bounty hunters to avoid discouraging the other hunters from finding Tyrion and acknowledges that mistakes will be made.\n", "Cersei's schemes may work initially, but they have a tendency to backfire on her. She was partially successful in her scheme to have Ned Stark falsely confess to treason before exiling him to the Wall in order to keep the North and the Riverlands in line. However, she failed to predict that Joffrey would be so foolish as to start a war by having Ned executed instead. Her scheme to undermine the Tyrells' plot to marry Loras to Sansa backfires on her when Tywin insists that Cersei will marry Loras instead, and coerces the Tyrells into consenting by threatening to have Loras appointed to the Kingsguard if they don't. After Tywin's death, she thinks she can co-opt the Sparrows into undermining the Tyrells, which briefly succeeds by having Loras and then Margaery imprisoned by the Faith Militant, but this plan ultimately backfired on her as well when she too was imprisoned and force to perform a walk of atonement. In this particular case, the combination of Cersei's own ego, as well as her belief that the Sparrows were loyal to her alone, did not allow her to comprehend that the same tactics she used against the Tyrells could also be used against her. Cersei's plan to destroy the Faith Militant and the Tyrells backfires on her as well with the suicide of Tommen, her last living child. Finally, Cersei's scheme to betray the Targaryens and the North after the parley of King's Landing has already backfired somewhat with Jaime abandoning her.\n", "A mistake outsiders often make when dealing with Cersei is assuming that she has the emotional maturity and wisdom of a queen, or at least an adult, when her real personality is closer to a petulant child inhabiting an adult's body (indeed, Lena Headey has stated that she plays Cersei as having the mind of a wayward 15 year old who never had any real parenting).[62] With her mother dead at a young age and her father away at court (and a cold disciplinarian anyway), Cersei was functionally raised by servants. In public, Cersei often tries to exude a sense of calm and regal control over her surroundings. When things do not go her own way, however, Cersei's usual response is to become childishly flippant, even when the assembled Small Council is trying to give her advice which would genuinely serve her own interests.\n", "She also has a tendency to irrationally blame other people for problems she actually started herself though her ego won't let her admit otherwise. When Jaime reminds her that the world mustn't know Myrcella really is their daughter, she hypocritically faults him for his caution, saying it led to Joffrey being murdered and Myrcella being sent to Dorne in the first place, even though she was the one who had Joffrey installed on the throne in the first place rather than flee when Ned Stark warned her of his intentions in order to spare her children's lives. Although she later acknowledges that Tyrion did not in fact kill Joffrey, she blames him for the deaths of her other two children by sending Myrcella to Dorne and killing Tywin, an act that she says made the Lannisters vulnerable to their enemies. Again, Cersei forgets that Tyrion's actions were brought on entirely by her own, namely her failure to stop Joffrey from executing Ned and igniting a war, and later irrationally accusing Tyrion for Joffrey's murder.\n", "Cersei's behavior is very mercurial, capable of switching between seemingly true affection for someone to extreme loathing over trifles. She is very petty about even small slights, both real and imagined, which ended up being her undoing, for she tried to use the Faith Militant to undermine House Tyrell due to her dislike of Margaery and the fact she replaced her as Queen, only to lose House Tyrell as an ally and find a powerful enemy in the Faith Militant. As Tyrion noted, Cersei often uses her honest feelings to dishonestly manipulate other people. For example, her fear for the safety of her children is actually genuine, but she will shamelessly use this to play on the sympathy of other people, to sway them into supporting her.[39]\n", "Cersei despises the restraints placed on her because she is a woman and is jealous of the freedoms that men have in her society. Several of the noble Houses in the Seven Kingdoms have more liberal attitudes when it comes to involving female members of their family in politics. The women of House Tyrell, for example, are expected to be involved in politics and have thus been trained from a young age in the skills of ruling. Unfortunately, Cersei's father Tywin is a staunch conservative, and never envisioned Cersei playing an active role in politics. Instead, her duty was to cement a marriage alliance and raise royal children, nothing more. It is also possible that instead of her gender being the object, Tywin believes she is simply too impatient and rash. Either way, the practical result is that, right or wrong, Tywin didn't raise Cersei to be skilled in ruling or in political intrigue. While confronted with these shortfalls, Cersei often blames her father or society in general for not giving her the years of training needed to rule, but complaining about it doesn't change the fact that she simply doesn't possess these skills. Although Cersei hates being a woman in Westerosi society, she shows no sympathy towards other women in similar circumstances, scorning them for what she perceives as their weakness: Cersei isn't so much angry at men for mistreating women, as angry that she isn't a man. When she was drunk during the Battle of the Blackwater she even openly said she wished she was born a man.[23]\n", "Cersei's lack of a parental relationship growing up is reflected in how poorly she has served as a mother to her own children, for whom she is unable to act as a stable moral instructor. While she certainly dotes on them, she doesn't genuinely \"love\" them so much as she treats them as extensions of herself. She is convinced that she is obsessed with their welfare, but when events threaten to take any of them away from her she is not so much worried about their happiness and well-being as angered that something she feels belongs to her is being taken away.[5]\n", "Tyrion once observed that Cersei's love for her children is her one obvious redeeming quality - but she even managed to twist this into a negative.[18] Cersei doesn't really \"love\" her children so much as she is obsessed with her mental constructs of them. She spent Joffrey's entire childhood convinced that he was going to grow up to be the best king ever, wise and brave - to the point that she blinded herself to his obviously psychopathic behavior. However, in spite of her obvious favoritism and far from realistic conception of her son, she at least acknowledged that Joffrey was indeed a monster after his death, implying she wasn't as deluded as she appeared. Her overindulgence of Joffrey also spoiled him rotten, filling him with an insatiable sense of entitlement - nor did he particularly give her much respect in return. Meanwhile, Cersei seems oblivious to the fact that she ignored her two younger children, Myrcella and Tommen. While Cersei is constantly upset that her own father Tywin played favorites with his children and focused all of his attention on her brother Jaime, she hypocritically visited the same treatment on her own children. She fixated on Joffrey so much that she barely knew Myrcella and Tommen, rarely engaging them in conversation except when she needed to manipulate them.[46] After Myrcella was sent away to Dorne in a marriage-alliance, Cersei assumed she was suffering away from her family, not suspecting that Myrcella would actually find happiness once she was free from Cersei's control and not even want to come back to her.[37] After spending some years in Dorne away from her, Myrcella outright said that Cersei doesn't even know her.[46] Finally, after the destruction of the Great Sept of Baelor, Cersei tells a captured Unella, she was motivated by protecting her last living child, Tommen. However, Cersei once again proves what a poor parent she is by not going immediately to Tommen after his wife is killed in the explosion and preventing his suicide as she was too preoccupied with paying back Unella for imprisoning and humiliating her.[55]\n", "After she was humiliated by the Faith Militant, the megalomania, immorality and vengefulness Cersei possessed all her life reached its peak. Combined with the rage she felt for her uncle Kevan and the fact that Olenna Tyrell and Pycelle deprived her of power, Cersei began plotting with Qyburn to avoid her trial, simultaneously destroy her enemies, including the High Sparrow and Queen Margaery and gain her revenge on the faith militant.This ended up destroying the alliance with the Tyrells, the only effective ally to King's Landing and a bloody revolt is to be expected by a vindictive Olenna. Cersei, however, does not seem concerned regarding this, displaying much more recklessness and slight mental imbalance on her part. Despite declaring herself Queen of the Seven Kingdoms, the title is effectively meaningless as currently the only major houses supporting her are her own and the Freys, although with the death of Walder Frey as well as the Freys' apparent military incompetence, they are unlikely to be useful allies. Along with the Lannisters now pitted against the rest of the great houses of Westeros, there is also the matter of the Crown's debt to the Iron Bank which has still not been resolved. So while Cersei might have achieved her ultimate ambition of being crowned Queen of the Seven Kingdoms, she is still in an incredibly precarious situation. However, this appears lost on her, further demonstrating her inability to see the far-reaching consequences of her actions.\n", "Beforehand, Cersei was known to have an extremely thinly-veiled sense of morality, which can be attributed to her love for her own children, no matter how twisted it was. Now that Tommen, Joffrey and Myrcella are all dead, however, Cersei has begun displaying more ruthlessness and depravity in her convictions. Her use of wildfire to destroy the Great Sept of Baelor can be considered somewhat of a symbolic envoi to her own descent into the same level of tyranny as the the Mad King. This act also destroyed the area surrounding the Great Sept for half a mile, effectively murdering hundreds of innocent people. Ironically, this may serve to drive a wedge between her and Jaime; Jaime outright said that the only thing he cares about is Cersei and that he was willing to kill even children if it reunited them, but Cersei has committed an act similar to the one he had to kill the Mad King for. Jaime's grim look upon returning to King's Landing and witnessing her coronation means that he understands that she is becoming exactly like him.\n", "Regarding her own crimes, Cersei appears to have become shamelessly sadistic. She outwardly admits that all her actions from having Robert killed to having an incestuous relationship with Jaime was solely because she enjoyed doing so. This, she \"confesses\" to a helpless Unella while vengefully playing with her, even quietly chanting \"shame\" (in a similar sense that Unella did during her walk of atonement) before leaving her to be tortured by Gregor Clegane. She also used her own motherly emotions for sadistic purposes when facing off with Ellaria Sand, going so far as to kill Ellaria's daughter Tyene with the same exact method which had been used to kill Myrcella. In the same scene, she vividly recalled Prince Oberyn's death to Ellaria, and pointed out that Oberyn died in vain since Gregor Clegane was still alive and stronger than ever before.\n", "All of this points to another mistake outsiders often make, Ned Stark for example, when dealing with Cersei as Olenna Tyrell noted before her death: failure to imagine just how far Cersei is willing to go to keep her power.[58]\n", "Cersei has been cited by Tyrion to be one of the most dangerous people in Westeros, because of her absolute ruthlessness in the face of those she perceives as her enemies. Cersei maintains a major amount of hypocrisy, blaming Tyrion for the destabilization of her family, and blind to the fact that she was an almost central influence in the deaths of Tommen and Myrcella, and showing no sympathy whatsoever when Tyrion apologizes but cites Tywin's own cruelty towards him - the hypocrisy here is that Cersei herself has complained about Tywin's mistreatment of her, and outright threatened to 'burn [her] house to the ground' if she were separated from her children (the latter being hopelessly ironic because Cersei accuses Tyrion of decimating the position of House Lannister, where she at least contemplated it herself). In addition, Cersei was a supreme influence in the arrest of Ned Stark (since she installed Joffrey on the Iron Throne rather than leave King's Landing when Ned warned her of his intentions in order to spare her children's lives), Tyrion's arrest (since it began with Bran Stark finding her having sex with Jaime), and giving free reign for Joffrey to do as he wanted and being unable to control him (which led to the death of Eddard Stark), making her an almost undisputed influence in the War of the Five Kings, which led to her family's decimation.\n", "Cersei has also become increasingly more arrogant and callous with her ascension to queen, disrespecting Jaime as the stupidest Lannister, having seen his logical and sound keeping of his promise as a betrayal. Perceiving this betrayal, Cersei feigns a threat with Ser Gregor, but Jaime knowing his sister so well as he does, calls it out. But the feelings of hurt are still the same. Cersei expresses her need to protect their new child by allowing the enemies to eliminate each other. By all logical guesses, it looks as if she is mimicking what Tywin Lannister had done during the end of Robert's Rebellion where he camped out and waited until the end game to see what he could do with what was left. Cersei Lannister's character has always been what it has always been about: Being a mother and ensuring the survival of the ones she loves, and that is her children and her lover, Jaime Lannister. Her behavior reinforces the belief that she has stated since the very beginning, that when you play the game of thrones, you win, or you die, and there is no middle ground.\n"], "quotes": [["\"I'm about to step into a room with the most murderous woman in the world, who's already tried to kill me twice, that I know of.\"", "―Tyrion's opinion on Cersei[src]"]], "figure_captions": ["A smug, calculating Cersei watches as the Sept explodes with innocent people."]}