{"id": "Daenerys_Targaryen", "name": "Daenerys Targaryen", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Daenerys_Targaryen", "personality": ["Daenerys is polite and well-spoken but filled with quiet determination. She used to be cowed by her brother's ambitions and his occasional cruel rages, but her time amongst the Dothraki has taught her pride, confidence, and skills of command. She is still somewhat naive of the world due to being young and living her life as an exile (with only her petulant brother to rely on for knowledge), but she is intelligent and quick to understand now that she is free to pursue her own path.\n", "Daenerys spent her entire life living on the sufferance of others, bouncing back and forth between one benefactor or the next (like Illyrio Mopatis) with her brother, until whatever dreams they had of supporting the exiles' claim wore off and they'd have to move on to another patron. As a result, Daenerys has never known a true home. Constantly living under her brother's domination has given Daenerys a great empathy with the downtrodden of the world. She is deeply sympathetic to those she perceives as oppressed, while at the same time, her pent-up frustration from years of being mentally and physically dominated by her petty would-be-king of a brother make Daenerys capable of being utterly ruthless against those she perceives as oppressing others. This has produced a large amount of black-white thinking in Daenerys's mind, and she can be idealistic to a fault. For example, on seeing the plight of the slaves in Slaver's Bay, Daenerys becomes determined that she must free all of the slaves in the region - with little thought devoted to the practical after-effects which will result from this. A particular example is when the Great Masters of Meereen crucified 163 children as she approached the city, in an attempt to intimidate her. After she took the city, instead of pardoning the slave-masters, she had 163 of them crucified in retribution, including many who opposed the crucifixion of the children, unconcerned about any negative political fallout which would result.\n", "Daenerys has also shown herself to be quite vengeful on several occasions to certain individuals for various grievances. When Mirri Maz Duur tricked her into allowing her to use blood magic to \"save\" Drogo, Daenerys had her bound and burnt alive. Upon learning the role that Xaro Xhoan Daxos and Doreah played in the theft of her dragons (and the deaths of her servants), she had them both locked in an empty vault. She is also responsible for the deaths of Randyll and Dickon Tarly after she had them burned alive as well for being her opposition. This quality might have further soured her reputation in Westeros along with Cersei's anti-Daenerys propaganda. However, it is worth noting that she executed them only after offering them the choice of surrender, which they declined. Tyrion also seemed to believe that her execution of Randyll and Dickon Tarly to be the result of losing her temper rather than deliberate ruthlessness. Although she has certainly become more ruthless over time, unlike her father Daenerys has never acted with deliberate cruelty; when she executes her enemies she does so swiftly, rather than torturing them to death for amusement, as Aerys did.\n", "Unlike many in her House, Daenerys has thus far not exhibited the \"Targaryen madness\" that plagued her father (and to a lesser extent, Viserys). She can be ruthless to her perceived enemies, but while Viserys was cruel and demanding to his servants and even his benefactors, Daenerys reciprocates the loyalty of those who follow her with gratitude and compassion, especially her inner circle of friends and her dragons. On the other hand, insanity was often a late-onset condition in the Targaryens, and it remains to be seen how Daenerys's mentality develops as she matures. One could argue that burning the remaining men of House Tarly with dragonfire could be a telltale sign of Targaryen madness, however, both were men in open rebellion to her who refused to bend the knee, thus making the distinction different.\n", "Despite her perceived confidence and ruthlessness, Daenerys has displayed surprisingly tender emotion and at times can appear quite vulnerable, at least in private. Her fondness for children has been shown multiple times, and when Drogon incinerated the young daughter of shepherd in Meereen, she was visibly disturbed, which led to her locking Rhaegal and Viserion in the catacombs to prevent further atrocities. When attempting to quell the opposition to her rule in Meereen, she finds herself at a loss and desperately asks Missandei for her input, not trying to hide her frazzled state. After rescuing Jon Snow and company from a wight attack - and losing Viserion in the process - she doesn't try to hide her tears. In the same interaction, when Jon declares his loyalty to her and says that the other Northern lords will come to see her as he does, she says in a rather small voice \"I hope I deserve it.\", showing a sense of doubt that had rarely been displayed before.  \n", "It remains to be seen whether Daenerys is a highly skilled battle commander. She has won some impressive victories, especially her swift conquest of Slaver's Bay and the Siege of Meereen, but each time she had a vast (and unexpected) advantage in numbers, as well as the support of her three dragons. Thus, her victories have more to do with overwhelming the enemy than brilliant tactical leadership. On the other hand, knowing that she is inexperienced in the art of warfare, Daenerys has taken care to surround herself with experienced and capable warriors who can advise her and help her coordinate her battles. She also has a clear sense of strategy, if not tactics; she knows how to win a battle in such a way to leave her in the strongest position possible, and she avoids heavy casualties to conserve and protect the troops at her disposal. Daenerys certainly knows how to put her dragons to decisive effect in battle; her use of Drogon at the Sack of Astapor and the Battle of the Goldroad ended both battles almost before they started.\n"], "quotes": [["Varys: \"The Seven Kingdoms need someone stronger than Tommen but gentler than Stannis. A monarch who could intimidate the High Lords and inspire the people. A ruler loved by millions, with a powerful army, and the right family name.\"\n", "Tyrion Lannister: \"Good luck finding him.\"\n"]], "figure_captions": []}