{"id": "Davos_Seaworth", "name": "Davos Seaworth", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Davos_Seaworth", "personality": ["Davos Seaworth is very loyal to his king. He is considered to be the closest friend that Stannis Baratheon ever had, which is impressive enough because Stannis had few friends due to his pitiless and cold personality. Davos's sense of personal loyalty has also, ironically enough, put him at odds with Stannis, especially when Melisandre was concerned - Davos openly mistrusted, and ultimately hated the Red Woman, but also feared that Melisandre would corrupt Stannis with her prophecies and promises of greatness. Davos is also a very dedicated man in his own right, originally opting to ensure that his son Matthos had a better life than he did, since Davos grew up in absolute poverty in King's Landing until he met Stannis. This gave Davos an unusual amount of empathy and compassion, since he supported Gendry's survival since his arrival on Dragonstone, using their aligning poverty in Flea Bottom as a way of gaining the young man's trust. It is almost hopelessly ironic that Davos's good nature and compassion is met with outrage or controversy by anybody else.\n", "Davos has no prejudice towards followers of another religion (which he himself expresses to Melisandre) but he believes that the Lord of Light himself is evil on the basis that his favor requires followers to burn people alive at the stake. He is shown to be rather frightened of the powers that Melisandre possesses, as shown when he witnesses her create a shadow to kill Renly Baratheon. It is unfortunate that his warnings against Stannis utilizing Melisandre and her powers to achieve his goals fell on deaf ears, since doing so would have meant avoiding an untold amount of destruction (which ironically is the reason that Melisandre used to persuade Stannis to keep her as an ally). Davos is a very practical man, understanding entirely that men and arms and territory win wars, not the hopeful prayers to some fire god. His suggestions to hire sellsword companies to Stannis's cause may have been met with incredulity by Stannis himself, but it would have been a potentially effective move.\n", "Davos had a very close relationship with Stannis's daughter and only child, Princess Shireen Baratheon, and was not at all bothered or intimidated by her disfigurement, which is impressive among most men. Davos was close enough with Shireen that she was the person who taught him how to read, and she openly didn't care that Davos was considered a traitor by Stannis and Melisandre because Davos was her friend. Davos even jokingly remarked that he saw similarities between father and daughter, demonstrating that he was almost as close with her as he was with Stannis. This friendship would become a tragic blow to Davos later on when he realized that Melisandre had Shireen burned at the stake to win favor with her precious Lord of Light - he exploded with rage against Melisandre upon hearing her confess and insists that Shireen's sacrifice was completely futile, since it achieved absolutely nothing in the end. Even after Jon Snow decided to banish the Red Woman on pain of death, Davos coldly threatened to execute Melisandre himself if they ever saw each other again, which is a massive departure from Davos's usual nature.\n", "Davos is unfazed by the condescension he has received from other high lords in Westeros for his common nature, which Stannis commended, expressing more contempt for such lords than Davos himself ever did. Davos was, in a way, of better service to Stannis or whomever he served than any other lord, considering the fact that he was unfailingly loyal to both Stannis, and later Jon Snow. He was not bothered by bastardy or by a person's disfigurements or social shortcomings, as evidenced by his relationship with Shireen and Jon. He is perfectly willing to stand astride the Free Folk after they come south of the Wall, even though he had been fighting against them not so long ago - he developed a good relationship with Tormund, as shown by their exchanging banter the night before facing Ramsay Bolton.\n", "Although he claims not being a skilled fighter, Davos is a very brave man who does not hesitate to put his life in danger when serving his lord. He notably took part in the Battle of the Blackwater and the Battle of the Bastards, to which he survived, and was also willing to fight against the Night's Watch mutineers who had killed Jon Snow, as well as risking to return to King's Landing while he was still officially considered a criminal. Davos's skills reside much more in his speech than in his fighting abilities: among his achievements, he convinced Stannis to contact the Iron Bank of Braavos and managed to secure a loan from Tycho Nestoris ; he persuaded Melisandre to try and revive Jon Snow and he helped Jon Snow in getting House Mormont's support from the young but harsh Lyanna Mormont. After Jon returned from death, Davos was the first man to greet him and firmly encouraged him to carry on fighting, since there were more important things to dwell on than the purpose of Jon's return. This makes Davos a precious and valuable advisor to whoever he serves.\n", "Davos also displays a forgiving nature, or at least does not harbor any kind of resentment towards people who could deserve it. He does not blame Stannis for cutting his fingers after he smuggled supplies during the Siege of Storm's End, nor does he formally blame Tyrion Lannister who masterminded the wildfire explosion which killed his son Matthos during the Battle of the Blackwater (he casually relays this to Tyrion when smuggling him into King's Landing but without a tone of reproach). The only exception known to Davos' forgiving nature is Melisandre, who Davos swore to execute should their paths meet again. Thus, Melisandre is the only person in Westeros that Davos irreparably, truly hates.\n"], "quotes": [], "figure_captions": []}