{"id": "Eddard_Stark", "name": "Eddard Stark", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Eddard_Stark", "personality": ["Ned was a very loving father to all of his children, including Jon Snow, his \"bastard son\", even though Catelyn was of a different opinion. He was very patient with Sansa's dreamy notions, visibly tolerating her adoration of the idea that she'd marry a handsome prince. When he tried to point out to her that Joffrey lacked bravery, strength of character, and even morality, a 13-year old Sansa was unable to see the truth at the time. He had a strong relationship with Arya, and was one of the few who could tolerate her feisty, adventurous mentality, and even encouraged it. He was, in many ways, like his son Robb, in that his sense of honor and duty ruled every aspect of his being, and he was a charismatic leader to those who served him. Ned had good relationships with both Robb and Jon Snow, the latter who Ned raised as his own alongside his lawful children. Like Robb, Jon inherited Ned’s traits of honor and duty. Ned treated Jon as his son - regardless of his legitimacy, and despite Jon being his nephew, not his son by blood. Ned was willing to sacrifice his own honor to protect Jon, and spent years letting everyone - including his whole family - believe that Jon was his bastard son to ensure Jon's protection. Ned's death provoked such a brutal reaction from all of his family because they all loved him more than words could say.\n", "Eddard was highly skilled in combat, both in strategy and in a duel. He killed Ser Gerold Hightower, survived the Battle of the Trident and held his own impressively against the younger Jaime Lannister. He had earned the respect of men like Ser Arthur Dayne, the greatest warrior of his generation - indeed, Ned's sense of honor seemed to impress everyone around him, including the rigid and cold Stannis Baratheon and the cunning Varys. Aside from being selfless, dutiful and brave, he was slow to anger and thus he was one of the very, very few who could withstand the temper and misgivings of Robert Baratheon, with whom he shared a relationship that was a hair's breadth from being considered a brotherly one. Robert admitted that he lacked love for Stannis and Renly Baratheon, and had instead called Ned his brother, showing that Robert's admiration for his old comrade was tremendous. Ned's calm and reasonable mentality was respected firmly by Robert, who recognized that Ned was the only one who would dare say no to him for the right reasons. Robert obviously trusted Ned, begging him on his deathbed to help Joffrey in a way that Robert himself had failed and even naming the man as Protector of the Realm until Joffrey came of age.\n", "However, he had the fatal weakness of being a poor politician, preferring to take the honorable route than doing what would politically benefit him - Cersei speculated that, in the game of thrones, one had to take what was in arm's reach or be damned, but Ned disagreed because the fight he fought was never to survive, but to preserve the lives of those he loved. Despite being usually straightforward, his honor could oftentimes blind him to reason, leading him to make highly impractical decisions and judgments. While intelligent, he wasn't the most imaginative person, which further exacerbated by his rigid sense of honor, made him unable to compromise or consider alternatives, usually going with the simplest and most straightforward course of action. Perhaps the best example is how he confronted Cersei about her children being fathered by Cersei's twin brother Jaime and not by Robert Baratheon. To save Cersei's children, whom he viewed as innocent and undeserving of punishment, he had proposed exile, even though it was obvious (to anyone with common sense) that Cersei would not accept Ned's offer - which meant giving up her power position and luxurious life and becoming a fugitive vagabond; instead, she took an action which Ned could easily predict, based on her former attempt to get Robert killed. Ned's intention was good, but the way he chose to act cost his best friend's life.\n", "One of Eddard's main flaws was his blunt, tactless attitude (similarly to Stannis). He failed to understand that \"you catch more flies with honey rather than with vinegar\". The best example for that is the manner he expressed his opinion about the suggestion to assassinate Daenerys: by acting so bluntly and disrespectfully toward Robert, Eddard only managed to anger him and make him stick to his decision. It never occurred to Eddard that he should have taken a different approach, like the way Davos tried to dissuade his king on similar circumstances (in the novels): talk with the king in private, calmly and softly, appeal to his conscience. Eventually, Robert did regret his decision, but by then it was too late.\n", "Eddard often evaluated matters and people by the evidence he saw with his own eyes, rarely ever looking underneath the surface or at the bigger picture. This made him a poor judge of character and he had a bad habit of trusting people, which was a mistake he disastrously made with Petyr Baelish. He also did not predict that Cersei Lannister would be unreasonable enough to turn down his offer of mercy if and when Robert found out that Joffrey, Tommen, and Myrcella weren't his children; a mistake that cost Ned not just his own life, but set off a chain of events that has also so far led to the deaths of his wife, two of his sons and many other lives. Finally, he near-automatically judged Jaime Lannister to have betrayed his king for dishonorable reasons the moment he discovered the Kingslayer sitting on the Iron Throne with the Mad King's corpse lying at his feet, without asking the knight his side of the story and despite the fact he was a rebel himself. Still, Jaime's arrogance did nothing to dispel this misconception.\n", "Though rare, he could be self-righteous in his honor. He was quick to judge Jaime's actions as dishonorable, despite himself publicly proclaiming to have sired a child out of wedlock with another woman, which he did in order to protect his nephew (Lyanna's son Jon Snow, birth name Aegon Targaryen) from Robert's wrath. He also accused Jaime of sticking to his Kingsguard vows when his family was being tortured and murdered by Aerys, something he did not do when meeting Barristan Selmy. He also had a tendency to choose personal honor over his duties as a leader of millions, ignoring pragmatic decisions for ones that would allow him to maintain his dignity, even at the potential danger of those he swore to protect (though he usually believed that he'd be capable of warding off the threats). This could be seen in the way he chose to deal with Cersei, and his refusal to participate in Daenerys's assassination, in spite of the immense threat her brother and the Dothraki presented to the Seven Kingdoms.\n", "Furthermore, as he \"grew up with soldiers\", he tended to put a lot of faith in the mindset and capabilities of efficient warriors and commanders in many matters. Ned had told his illegitimate son (revealed to be nephew) Jon Snow that true friendship is made on the battlefield. This sometimes caused him to ignore personality aspects that would have a negative effect in certain situations. He was unable to predict that Robert, despite having been his best friend, did not have the attributes required to make an effective king. Ned's belief in the importance of martial skill is supported when he stated to Renly that he believed Stannis's military accomplishments would help make him an efficient monarch.\n"], "personality_quotes": [["\"I'll say this for Ned Stark: He's serious enough.\"", "―Cersei Lannister to Robert Baratheon, regarding Eddard Stark.[src]"]], "figure_captions": ["Eddard Stark fights Jaime Lannister."], "quote": ["When the snows fall and the white winds blow, the lone wolf dies, but the pack survives.", "―Eddard Stark", "The Dragon and the Wolf"], "description": "Lord Eddard Stark, also known as Ned Stark, was the head of House Stark, the Lord of Winterfell, Lord Paramount and Warden of the North, and later Hand of the King to King Robert I Baratheon. He was the older brother of Benjen, Lyanna and the younger brother of Brandon Stark. He is the father of Robb, Sansa, Arya, Bran, and Rickon by his wife, Catelyn Tully, and uncle of Jon Snow, who he raised as his bastard son. He was a dedicated husband and father, a loyal friend, and an honorable lord.\n"}