{"id": "Edmure_Tully", "name": "Edmure Tully", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Edmure_Tully", "personality": ["Edmure was a well-meaning but often impetuous man. As a military leader, he showed himself to be fairly competent but a little proud, and at one point acted of his own accord instead of following Robb Stark's direct orders. Although he successfully warded off Gregor Clegane, his victory cost the northmen more than if he had followed his orders. His proud nature led him to refer to Robb, his king, as his nephew, much to the chagrin of his uncle Brynden, with whom he frequently clashed.\n", "Despite being described as a fool by the Blackfish, Edmure was not a bad person nor a true fool, as he was capable of recognizing and apologizing for his mistakes. When being cowed by Robb for his blunder at the Stone Mill, Edmure apologized, but still had gall enough to suggest that it wouldn't have gone so badly if he had known from the beginning about the long-term plans. He was capable of thinking logically at times, knowing that if word of Rickard Karstark's crimes left Riverrun it would be a disaster, and agreeing with Catelyn that keeping him a hostage would be the wisest move.\n", "Edmure had more gall than was good for him, and fiercely protested to marrying a daughter of Walder Frey, citing his right to refuse the betrothal. He also rather provoked his sister's incredulity by prioritizing his choice of a prettier wife over the triumph and freedom of his king's cause. Eventually, after being browbeaten by Robb, Catelyn and the Blackfish, he did agree to the match. Furthermore, he was relieved and very much pleased with the wife that he was eventually given, and throughout the wedding he enjoyed himself, right up to the point where the bedding ceremony was called and the prelude to the Red Wedding began.\n", "After the Red Wedding, the decimation of his family and the destruction of the northern cause that Robb Stark began, Edmure is shown to have been scarred by his experiences as Walder Frey's prisoner. When confronted by Jaime Lannister, Edmure showed pure contempt for the Kingslayer. Throughout the showdown that followed, he insulted and expressed bewilderment at Jaime's nature. Despite the fact that he manages to move his captor with his words, he prompts Jaime to graphically threaten the life of Edmure's infant son, causing Edmure to reluctantly agree.\n", "Edmure did love his family, especially his sister Catelyn. After Cat's death, Edmure showed fury when Jaime talked about her. It is unknown what he thought of Lysa, or how he reacted to her death (or if he heard of it at all).\n"], "quotes": [], "figure_captions": []}