{"id": "Ellaria_Sand", "name": "Ellaria Sand", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Ellaria_Sand", "personality": ["Before the death of her paramour Oberyn, Ellaria was shown to be an adventurous, carefree, and spirited woman who shared her lover's tastes and zest for life. She was also rather peaceful as shown when she initially tried to dissuade Oberyn from getting into a fight with two Lannister men at Littlefinger's brothel until one of them made a lascivious remark about her, implying that she must also be a whore, and a prejudiced remark about Oberyn and Dornishmen in general, even though she too is Dornish. Ellaria is also initially courteous to Tywin and Cersei at their first meeting but was rather quickly vexed when Cersei hypocritically mocked her bastard surname. When Oberyn went to fight the Mountain, Ellaria expressed shock that he had chosen to fight such a man, and pleaded that he not leave her alone in the world, and she reacted with horror when Gregor Clegane killed him. This shows that she and Oberyn had a genuinely loving relationship. She displays equally strong affection for her eldest daughter, Tyene, and treats Oberyn's two oldest daughters (Obara and Nymeria) with respect, despite them not being her own children.\n", "Since Oberyn's death, however, her personality has completely darkened. Despite the fact that it was ultimately Oberyn's hubris that got him killed, Ellaria has not only inherited his more vengeful side; she has transcended it to a whole new level. This started off as a considerably aggressive attitude towards anyone who crossed her, especially Jaime Lannister. She behaved in an aggressive and spiteful way, and when Doran treated with Jaime, expressed disgust that he was even considering breaking bread with Jaime. Beforehand, she was enraged that he hadn't declared war on the Iron Throne to avenge Oberyn. She became pitiless and dangerous, suggesting that they send Myrcella back to Cersei piece by piece, and later killing her in front of Jaime, all so she could mount a war against House Lannister.\n", "This being said, Ellaria isn't so blinded by her hatred and revenge that she isn't willing to make alliances as shown when she invites Olenna Tyrell, a member of a family that have been rivals of the Martells for centuries, if it meant that they could take their revenge on Cersei and her family for the damage that they caused to both their families. Still, for all intents and purposes, Ellaria fails to see that she has proven herself no better than the Lannisters and betrayed her lover's memory by murdering an innocent child and then later Oberyn's own brother in cold blood, despite Doran having treated her like one of their own family. \n", "Though aware of her baseborn origins, Ellaria's status as a part of Dornish nobility has also hindered her views slightly, such as when she asks Theon Greyjoy to pour her wine despite him legally being Balon Greyjoy's heir to the Iron Islands (which he himself gave up for Yara), and only stops when Yara tells her that Theon is not her servant. Her relaxed attitude towards sexual relations is reflected when she offers Theon to join her and Yara for a threesome, even though Theon and Yara are siblings (though it can be assumed that she intended for both Theon and Yara to pleasure her and not necessarily have sex with each other).\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Cersei Lannister: \"Can't say I've ever met a Sand before.\"\nEllaria Sand: \"We are everywhere in Dorne. I have ten thousand brothers and sisters.\"", "―Ellaria spars with Queen Cersei.", ""], "description": "Ellaria Sand was the paramour of Prince Oberyn Martell of Dorne and a bastard of House Uller, carrying the bastard surname \"Sand\" like all bastards in Dorne.\n"}