{"id": "Euron_Greyjoy", "name": "Euron Greyjoy", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Euron_Greyjoy", "personality": ["Euron is a wildly unpredictable and cruel man even among the ironborn, and is widely regarded as the most feared pirate alive, who has become the terror of the world's oceans from Oldtown to the Jade Sea. Even many of the other ironborn greatly fear Euron, and consider him to be half-insane - not in the sense of being impulsive, but in that he seems almost delusional, with an utterly fearless, warped personality. Unlike other psychotic characters of the series, Euron is not prone to outbursts of anger or impulsive violence; everything he does seems to be for some sort of calculated purpose, though others might not be able to perceive it - such as calmly ripping out the tongues of his entire crew for no other reason than \"I needed silence\". Euron possesses an unnerving coyness to him, tranquil and detached in the face of danger and mildly playful (but never indulgent in idle whims). When walking along the rope-bridges of Pyke during a massive storm, while Balon struggled not to fall over, Euron calmly stood his ground without bothering to hold on to anything. Euron also isn't particularly arrogant, in the sense that he doesn't have a sense of entitlement - he just does what he feels like, and is self-assured in his own power and abilities.\n", "In contrast, Joffrey Baratheon was an arrogant, petty fool prone to random outbursts of anger, obsessed with the title of king he believed he inherited, even though he was little more than a puppet backed up by his grandfather Tywin. Joffrey never actually wielded a weapon, however, usually making a cowardly retreat when confronted with real danger. Ramsay Bolton was sadistic and personally dangerous, capable of great violence and torment against people he had already captured, but he didn't have any true authority to back it up, and an impulsive, childish need to brutalize people for transient amusement (i.e. hunting women for sport and flaying men alive who disobeyed him, then leaving them on public display) with no thought to the long-term repercussions. Ramsay only knew random force and was in no way skilled at diplomacy, alienating potential allies. Euron Greyjoy, meanwhile, isn't impulsive but capable of cunning long-term strategies, and unlike both of them, is actually capable of being extremely charming when the situation arises. Euron needed to win over the ironborn to elect him king willingly, playing to their admiration for strength and audacity, while making grandiose promises. In many ways, Euron is the feared ruler that Joffrey and Ramsay wished they could be: genuinely dangerous and cunning, with a well-earned reputation, the authority to back it up, and a gift for long-term manipulation.\n", "Euron's true personality, however, is in some ways difficult to pin down - he is such a master manipulator that he tailors each performance, as it were, to fit his current audience. When he wins over the ironborn at the Kingsmoot, he shifts to a more low-brow register, playing to their love of battle and crass sex jokes. When he appears before Queen Cersei, however, he shifts to a different act of a swaggering and dangerous but very witty and charming persona. His private confrontation with his brother Balon may have been one of the few times he dropped the mask and the man underneath appeared: dark and threatening, making a few bitter quips, but with an unnerving sense of tranquility while making blasphemous claims about his own power, likening himself to a god, and to the storm itself.\n", "Euron is a terrifying and relentless warrior in personal combat if the need arises, laughing while shrugging off minor stab wounds. He is a master combatant, individually killing two of the Sand Snakes and capturing his niece; all of whom were deadly warriors in their own right. Euron's fighting style was just as savage and unpredictable as he was, and he used anything (even his opponents' weapons, as he did to kill the Sand Snakes) at his disposal. Euron also roared madly when he struck down Obara, lifting her high off the ground with the broken halves of her own spear, showing that he revelled completely in the thick of battle. He was capable of being intensely sadistic, laughing triumphantly when Theon Greyjoy fled from him after Euron defeated Yara. Euron also confessed that he was hugely impressed, if not awed, by Jaime Lannister's swordsmanship during the Greyjoy Rebellion, even though Jaime had been cutting down Euron's own kin and was Euron's own enemy at the time. Despite being such a great warrior, he was willing to admit that he was afraid when he encountered a wight for the first time.\n", "Additionally, Euron is a master sailor, admiral, and a genius in naval combat. His talent in naval warfare led to much of Cersei's early advantages in her war: destroying the rival Greyjoy fleet, crushing the Dornish forces and blockading the Unsullied in Casterly Rock. With his powerful navy and brilliance, Euron may well be the greatest naval power in the world.\n", "Euron also has no qualms with other social taboos such as kinslaying, openly killing his own brother to seize the throne and bragging about that in public, and flippantly announcing he will murder his niece and nephew. In that aspect, Euron proves to be worse than Ramsay: Ramsay has also killed his kin, but even he wouldn't admit that in public.\n", "Euron, like Ramsay, is pure evil. Euron is utterly psychopathic, and incredibly sadistic. He has no problem slaying his own kin, or torturing his own men. However, unlike Ramsay, Euron is highly intelligent, feared by even his own men, and capable of playing the long game to get what he wants. Euron may be one of the, if not the most evil person in Westeros.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["I don't mock the Drowned God - I am the Drowned God. From Oldtown to Qarth, when men see my sails, they pray.", "―Euron Greyjoy to Balon Greyjoy", "Home"], "description": "King Euron Greyjoy is the brother of Balon Greyjoy, the Lord Reaper of Pyke and later King of the Iron Islands, and Aeron Greyjoy, a Drowned Man. He is also the uncle to Balon's children, Rodrik, Maron, Yara, and Theon Greyjoy. After murdering his brother Balon, Euron takes control of the Salt Throne with the support of many ironborn and seeks to hunt down Yara and Theon, who oppose Euron and have allied with Daenerys Targaryen.\n"}