{"id": "Gendry", "name": "Gendry", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Gendry", "personality": ["King Robert's actual son Gendry is everything that his alleged son and heir Joffrey Baratheon was not, both in terms of physical appearance and personality. Joffrey was an arrogant, sadistic fop, with a massive sense of entitlement. He was not skilled at anything - particularly not at combat, in which he was also a coward when faced with real danger. Joffrey's one real claim to importance was that he was Robert's son – which was itself a lie even if he himself didn't know. Gendry, by contrast, is the exact opposite: a generally humble and polite working-class blacksmith, who didn't grow up rich in a castle, and a brave and capable fighter when called to do so. He also needlessly defends the boy \"Arry\" when he sees the other recruits picking on (what he thinks is) a smaller boy. Unlike Joffrey, who thought the throne was his by right but was utterly unsuited to rule, Gendry has many qualities which would make a fine king, but he doesn't even know he has a potential claim to the throne. Growing up having to work for a living, at Mott's smithy, Gendry became disciplined, and doesn't have any of his father Robert's negative qualities of self-indulgence (in food, drink, and women).\n", "Gendry is extremely pragmatic and practical, as evidenced by his ability to understand how social standing benefits people unlike him: he understood that if he returned to Riverrun with Arya, she would be his 'lady' rather than his friend. This sets him further apart from Joffrey, who outright fell back on social standing and had massive delusions of grandeur where his own position was concerned. Joffrey accentuated his title as king to be the reason that he should get his way, whereas Gendry fought and survived for other people and was nowhere near as arrogant or temperamental as Joffrey. Also, he was surprisingly self-reproachful about his own actions, shown prominently in the aftermath of Melisandre seducing him; Joffrey was not the slightest bit self-reproachful, never blaming himself for anything even if he were the central catalyst for an incident. Joffrey would brutalize women at court, taking out his frustrations by having his guards publicly beat Sansa Stark and citing his authority as king when Tyrion Lannister confronted him about it. In a direct parallel, Gendry is polite and deferential to her sister Arya Stark when he learns who she is, worried at his behavior and insisting on addressing her with formal titles.\n", "Gendry is still somewhat self-conscious about being a commoner, with a commoner's lot in life. Like many of them, he is terrified and subservient when he encounters members of the nobility, while somewhat resenting the great lords for oppressing the lower classes and tearing Westeros apart with their bloody wars. Nevertheless, he readily agrees to help the King in the North Jon Snow, both for his mutual dislike of the Lannisters and his father's past alliance with the Starks.\n", "Though he has no formal combat training, Gendry is remarkably skilled with a hammer, both as a weapon and a tool - much like his father Robert. While escaping from King's Landing, he effortlessly killed two curious Gold Cloaks with a war hammer, having inherited his father's incredible strength. This strength has been a prevalent factor throughout his life, as he commented to Hot Pie that when he strikes steel with a hammer it 'sings'. A glaring difference between him and his father is that Gendry does not love fighting, whereas Robert Baratheon absolutely lived for fighting.\n", "Gendry seems now to take some pride in his Baratheon blood, hating the Lannisters for killing his father Robert and immediately informing Jon Snow that he is Robert's bastard son, knowing his father and Jon's (adoptive) father were best friends. His personal war hammer features a design of a stag's head with full antlers on either side of the haft socket, the stag being House Baratheon's sigil.\n", "Finally, what sets Gendry so far apart from Joffrey is his immense sense of compassion and care, as evidenced from his blossoming friendship with Arya. It is clearly seen in their eventual parting in that not only is Arya clearly heartbroken, but as a result she lists the names of people responsible for him being taken, solely for the feelings and strong relationship she had with Gendry.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Davos: \"Don't be a fool. You're not a soldier.\"\nGendry: \"No, but I'm a fighter.\"", "―Davos Seaworth and Gendry", ""], "description": "Gendry is a skilled blacksmith and an unacknowledged bastard son of King Robert Baratheon. After escaping the massacre of Robert's other bastards in King's Landing, Gendry is slated to join the Night's Watch before being captured and traded multiple times- first to Tywin Lannister at Harrenhal, then to the Brotherhood Without Banners, and finally to Stannis Baratheon on Dragonstone. After escaping from Dragonstone with the help of Ser Davos Seaworth, Gendry returns to King's Landing and remains in hiding until Davos returns for him. He later accompanies Jon Snow north of the Wall on a mission to capture a wight to use as a bargaining chip at the Parley in King's Landing.\n"}