{"id": "Jaime_Lannister", "name": "Jaime Lannister", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Jaime_Lannister", "personality": ["At first glance, outsiders perceive Jaime to be arrogant, cocky, cold, dishonorable, extremely dangerous, ruthless, disdainful, and sarcastic. To a large extent he is arrogant about his own abilities, but not without cause. Even all of his enemies admit that he is unarguably one of the greatest swordsmen who has ever lived with very few (such as Ned Stark, Jon Snow and Brienne of Tarth) able to match him. Jaime is unquestionably one of the greatest warriors in the world, he is an extremely lethal fighter, a highly skilled warrior, and he has incredible combat skills. Jaime's loss of his sword-hand did much to humble him, given that in many ways he was that hand and how much his self-identity depended on his incredible skills with a sword and knife. Jaime is famous throughout the world for being one of the greatest warriors of all time and for being a \"brilliant swordsman\" which he is widely feared for. Jaime does not mock others over minor insults the way Cersei does, and he can muster up polite behavior, but he is usually very blunt and straightforward. Much like his brother Tyrion, he typically just says what he is thinking, and has no reservations about mocking those he perceives as incompetent. Despite this, there were men that Jaime admired (like Ser Barristan Selmy, for whom he squired) and, underneath this cold and sarcastic attitude, Jaime is a very complicated man.\n", "Tywin Lannister has raised Jaime and Cersei with the principle of ruthlessness as a virtue. Yet even though Jaime Lannister often behaves unapologetically amoral, in his own warped way, Jaime is the only member of the core Lannister family (Tywin and his three children) aside from Tyrion who shows any hint of honor or principles, whilst Tywin claims to see family as his highest priority but simultaneously is willing to have Tyrion, whom he views as an incalculable disgrace, killed, and Cersei herself ironically sees no immorality whatsoever in anything she does. This is largely based on his arrogance and pride at being a member of the Kingsguard. Jaime became extremely disillusioned with ideals of honor and loyalty when he saw firsthand the atrocities committed by the Mad King, how other \"honorable\" members of the Kingsguard stood by and did nothing while King Aerys had people burned alive for imagined insults, because they felt bound by vows of faith and fealty - in this sense, Jaime is surprisingly similar to Sandor Clegane, since they both have powerful disillusionments about honor and nobility, yet they both frequently avoid unnecessary violence.\n", "A key difference between Cersei and Jaime is that Cersei honestly believes, in her skewed view of the world, that she is \"good\", Joffrey is a great king, and all of her enemies are \"evil\" people trying to destroy her and her children. In contrast, Jaime does not maintain any pretense of being a \"good\" or honorable man, as he has become apathetic to such concerns - this was influenced by him being hated and loathed by everyone because he killed a man who had infamously terrorized the Seven Kingdoms, opening his eyes to how people perceive goodness and honor. However, he still has some respect for the rules of engagement, as he refused to kill Ned Stark when their duel ended abruptly, since Ned was incapacitated by an opportunistic guard rather than Jaime himself - Jaime personally punished that guard seconds after the duel ended. Jaime also was capable of treating his own enemies rather respectfully, telling Ned Stark that his father and brother didn't deserve to die the way Aerys killed them, and saved Olenna Tyrell from a crueler fate that Cersei would have inevitably given her, by allowing her to die painlessly.\n", "Moreover, Jaime isn't a very politically ambitious man, much to Cersei's annoyance, and often turns down her frequent urgings that he should try to become Hand of the King, stating that the days are too long and their lives are too short. Political maneuvering is not his way, and he sees himself foremost as a soldier who when confronted with a problem takes out his sword and cuts its head off. Up until the day his hand was cut off, he had immersed himself in combat so much that it is his sole value, and when he does lose his hand, his sword hand, he loses the will to live because, thus far, he has only ever had to decapitate a problem so as not to face it again, but now he cannot wield a sword the same way ever again - he laments that he was that hand. Brienne of Tarth is quick to tirade to him about him having a small taste of a world where people have their good things ripped from their possession, and after that one small taste he gives up - she mistakes him for a coward at this point. Indeed, Jaime's lack of political thinking leads to him heatedly suggesting that either he or someone else execute the High Sparrow and his followers for manipulating Tommen - at the time, he did not quite see the long term ramifications of such an act because he was angry at the possibility of losing his only surviving child.\n", "After losing his hand and confessing the real reason he killed Aerys to Brienne of Tarth, Jaime begins to redevelop a sense of personal honor once again as he reevaluates his past and future. In no small part to Brienne's influence, Jaime begins to see his father for who he really is and begins to wonder if there are ideals worth fighting for. To this end, he outfits Brienne with new armor and even gifts her the Valyrian steel sword reforged from Ice so that Brienne can fulfill her oath to Catelyn Stark. Jaime himself is more mindful of the promises he makes, and eventually tries offering his solemn oath in certain circumstances, treated with understandable skepticism by the likes of Edmure Tully. Jaime's new outlook develops to the point where he is disgusted with Cersei for stabbing Daenerys's faction in the back, and announces his intention to keep his own promises (although the undead horror bearing down on the Seven Kingdoms clearly has something to do with it).\n", "Jaime is the only member of Tyrion's immediate family who ever treated him with respect or kindness. In fact, he admires Tyrion's intellect and his ability to tell off those who insult him. Jaime never approved of Tywin and Cersei's long history of abuse towards Tyrion, and has always treated him like a brother, the only adult of Tyrion's immediate family to recognize how irrational it was to blame him for their mother's death in childbirth. Indeed, Jaime is the only member of the core Lannister family who has a reasonably good relationship with all of the others. Among the three siblings, Cersei and Tyrion can't stand each other, but they both like Jaime (both Cersei and Tyrion have acknowledged the only reason they haven't gone out of their way to seriously harm or kill each other is because Jaime would never forgive them if they did). However, in recent times, Jaime's good relationship with Tyrion was tarnished with the death of their father, and Jaime said he would kill Tyrion the next time they meet (though it is unclear if he really meant it). His relationship with Cersei has also deteriorated in the aftermath of Tywin's death since it was Jaime who set Tyrion free and inadvertently allowed him to kill their father.[33] Over time, however, and especially after learning that it was Olenna who killed Joffrey, Jaime comes to accept that Tyrion effectively murdered Tywin out of self-defense, a man bound and determined to execute his son; when they meet again in King's Landing, Jaime is initially hostile towards Tyrion, but deep down understands his motives and listens to him, and by the time of the parley in the Dragonpit, Jaime treats Tyrion with the same respect as before, indicating that he has at least partially forgiven his brother.\n", "Tywin was a stern man feared and resented by all of his children, ignoring Cersei for her gender and scorning Tyrion for both his stature and 'killing' his wife in childbirth. However, Jaime is on reasonably good terms with Tywin - not so much that he is \"proud\" of Jaime so much as he has the \"least shame\" for him compared to his brother and sister. Even so, Tywin is upset that Jaime willingly joined the Kingsguard, as while it is considered the highest honor for a knight, its members give up the rights to marry or inherit lands, meaning that Jaime cannot be Tywin's heir. Jaime wasn't in a position to act as a father to his biological children with Cersei, though he is generally supportive of Tommen and Myrcella. However, in sharp contrast with Cersei, Jaime isn't particularly fond of Joffrey, nor will he defend his actions the way Cersei does. He shows obvious joy when Myrcella reveals her knowledge that Jaime is her father and is happy about it, and embraces her, since this is the first time he has ever been able to show his feelings as a father to his children. He is equally saddened when Myrcella dies in his arms moments later. He also becomes enraged when the High Sparrow brainwashes his only son, and he contemplates a plan to bloodily finish the High Sparrow's schemes, even though sound judgment states that this plan wouldn't work.\n", "Jaime's attitude towards violence is also complex: he threw Bran Stark out a tower window to kill him, but later saved Brienne twice (from being raped, then fed to a bear) from Locke's soldiers. The difference seems to be that after witnessing the depravity of the Mad King, needless violence and brutality deeply offend Jaime, though if he decides that violence and murder are absolutely necessary he will ruthlessly carry it out himself. He threw Bran out of a window because had the boy reported that he saw the incest between Jaime and his sister, Cersei, the woman he loved, then all of their children would be executed, so he felt he had no choice. Jaime killed his defenseless cousin Alton Lannister in order to orchestrate an escape from Robb Stark's camp, but he deeply regretted it afterwards, subtly hinting at it to Tyrion and then outright confessing to the High Sparrow about it, showing that he has a greater conscience than he is given credit for. This sets him apart from Cersei, who destroyed the Sept of Baelor and everyone inside (including their uncle and cousin) and around it, and proved unapologetic about what she had done. Jaime also was capable of reproach for the mistakes he made and their consequences, unlike Cersei: he felt guilt for freeing Tyrion because it led to the death of his father, whereas Cersei is blind to her own mistakes, which led to the deaths of her children. The upshot of this is that Jaime has no delusions about his own conscience. He is certainly ruthless when he needs to be, but unlike Cersei or Joffrey he does not act with cruelty for his own enjoyment. Quite the opposite, in fact: the very murder of Aerys that gained Jaime his negative reputation was actually an act of prevention against a potential genocide that would have engulfed all of King's Landing.\n", "Overall, Jaime is a surprisingly skilled battle commander. While he is far less intellectual than Tyrion, he inherited at least some of Tywin's ruthless intelligence, as demonstrated by his decisive handling of the siege of Riverrun; on arriving, he quickly corrected most of the inadequacies that the Freys had created, then ended the entire siege almost bloodlessly by coercing Edmure to enter Riverrun and (as head of House Tully) force his men to surrender. Previously, Jaime had won the Battle of Golden Tooth against the River Lords under Hoster Tully, which forced them back and allowed him to besiege Riverrun. He placed Bronn as his second-in-command in recognition of the man's military prowess, though Bronn followed him more out of ambition than loyalty. Jaime also learns from his mistakes; remembering how Robb Stark tricked him by leaving a small decoy force to be overwhelmed while the rest of the army moved to attack more important targets, Jaime allowed the Unsullied to take Casterly Rock (after having emptied its larders) while taking most of the Lannisters' forces south to storm Highgarden.  Even though he spectacularly lost the Battle of the Goldroad, the battle was almost decided from the start due to Daenerys having overwhelming advantage in numbers and firepower.  Regardless, Jaime quickly recognized that the only way he could turn the tide was by killing the enemy commander, even risking his own life for the sake of a chance to kill Daenerys; this demonstrates him to be a man of courage as well as military skill. \n", "Jaime seems to care about those beneath him, refusing to flog stragglers after the Sack of Highgarden, refusing to leave his men at the Battle of the Goldroad, and lamenting at how easily the Dothraki army broke his own army. Not only is Jaime a prodigal leader, but he has a good amount of common sense, as evidenced by his decision to ride north to combat the threat that the White Walkers posed to Westeros, and his utter incredulity at Cersei's refusal to contribute.\n"], "quotes": [["Jaime Lannister: \"By what right does the wolf judge the lion? By what right?! \"\n", "Brienne: \"Help! The Kingslayer!\"\n"]], "figure_captions": []}