{"id": "Janos_Slynt", "name": "Janos Slynt", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Janos_Slynt", "personality": ["Janos Slynt was a disgraceful, arrogant and corrupt man who would commit any action given to him by the king or queen, without hesitation, without remorse and without honor. While he claims to be a loyal and faithful servant of the King and his main priority would be to defend the city and serve the king; Janos's true drive appears to be to obtain power through political positions and abuse such power to dominate his command over others by the use of immoral and cruel means, and later defend such actions by stating they were justified in the name of the king or otherwise. Amongst other things he accepts solicited bribes from criminals and other members of the City Watch.\n", "Janos naturally enjoys authoritative positions, having found himself in them his entire life, including Lord Commander of the City Watch, member of the Small Council, head of House Slynt and an unspecified high-ranking position in the Night's Watch. However, this is more of a compliment to his ability to squirm his way into the favor of other people with high-ranking positions by blind obedience and being outwardly sycophantic rather than his own accommodations.\n", "Janos is not above treachery or hypocrisy at times. He would never have risked his position by doing the honorable thing and helping Eddard Stark remove Joffrey Baratheon from power, instead he betrays Eddard and his men on the spot and defends this to Tyrion Lannister by saying he was a traitor who attempted to buy him off, ignoring that he was already bought off by Petyr Baelish in the first place. A common mistake Janos usually makes is believing himself an important or valued necessity, whilst he is usually disregarded altogether. When being exiled to the Night's Watch, he proclaims he has \"powerful friends\" who would be upset about this but in reality, no one appeared concerned over Janos's exile. He uses this excuse again when about to be executed, unaware that Tywin Lannister was dead and he was making empty threats. Finally, when Jon Snow orders the Night's Watch Rangers to take Janos outside so that he can execute him, he stands staunchly as Alliser Thorne seemingly defends him, only to be shocked when Thorne moves aside and lets them have their way with him.\n", "Janos seemed to have a strong dislike of bastards and consider them beneath him even by the usual standards of people in Westeros, to the point where he had no problem even with killing a baby bastard when ordered to do so, as shown when he coldly killed Barra, who had been fathered by King Robert Baratheon, on Joffrey's orders upon seeing another knight hesitate and also killed other bastard children of Robert's, never showing any sign of regret over it afterwards. While interrogating a man over Gendry's whereabouts Janos sneeringly referred to Gendry as \"the bastard\" and also mocked Jon Snow for being a bastard, never once showed him any respect and openly welcomed the idea of Jon being killed or executed despite the fact that Jon, who showed himself to be brave, compassionate, competent, resourceful and always as reasonable as his circumstances would allow, was a better man than Janos in every way. All of this shows that the seemingly compassionless Janos lacks empathy for other human beings. Janos was also rather hypocritical, as he justified his killing of Barra to Tyrion by saying \"Orders are orders\" but when Jon later gave him an order he didn't like, he completely contradicted his earlier statement by telling Jon to \"shove your order up your bastard arse\" which ironically proved to be a fatal mistake for him as his disobedience caused Jon to execute him.\n", "Beneath his confident and defiant exterior, Janos is actually a coward. While other Lord Commanders of the City Watch are either knights or have some knowledge of the battlefield, he possesses none of these traits. He prefers attacking those who cannot fight back, including Lord Eddard's defenseless soldiers in the Throne Room and Barra. His cowardice is displayed during the Battle of Castle Black where he hides with the women and children and, when finally realizing Jon was serious about executing him, breaks down in tears, begging and claiming, \"I've always been afraid.\" He dies begging Jon for mercy even though he didn't show any mercy to Ned Stark's men, Barra, or any of Robert's bastard children when he killed them, dying the pathetic and disgraceful person he always was.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Janos Slynt: \"Are you drunk?! I'll not have my honor questioned by an imp!\"\nTyrion Lannister: \"I'm not questioning your honor, Lord Janos. I'm denying its existence.\"", "―Tyrion Lannister to Janos Slynt", ""], "description": "Lord Janos Slynt was the commander of the City Watch in King's Landing and founder of House Slynt.\n"}