{"id": "Joffrey_Baratheon", "name": "Joffrey Baratheon", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Joffrey_Baratheon", "personality": ["Joffrey was a cruel, arrogant, sadistic, malicious, egotistical, remorseless and tyrannical ruler even by the standards of his times. He immensely enjoyed indulging in the agony of others and played barbarically vicious 'games' with them (for example, giving a man a choice between losing his hands or his tongue) and even joyously speculating serving Sansa Stark the head of her brother Robb at his wedding feast. However, he was also incompetent, unintelligent, naive, impulsive, petulant, extremely cowardly, and prone to rash outbursts of violence when angered, frightened or even mildly slighted. Much like earlier Targaryen kings, it was suspected that Joffrey's sociopathic behavior was a result of his incestuous bloodline (though his sister and brother both were of a kinder disposition) as well as being intensely sadistic, Joffrey was consumed by megalomaniacal delusions of grandeur, even though he was absurdly unskilled at ruling, making far more problems than he solved (though he was literally unable to recognize this and unapologetic for doing so). \n", "He was convinced that he deserved praise and utter devotion from everyone around him because of his purported royal blood. Even though at the start of the War of the Five Kings most of the realm rose in rebellion against him, to the point that his faction essentially controlled only The Westerlands, The Crownlands, and a narrow strip of the southern Riverlands between them, Joffrey was convinced that he was the greatest king in the history of the Seven Kingdoms; proving just how arrogant and delusional he truly was. Added to what was an unstable personality to begin with, Cersei utterly spoiled and indulged Joffrey his entire life, resulting in him possessing a massive sense of entitlement as well as having no impulse and self-control due to getting whatever he wanted whenever he wanted it. Cersei also outright told him that the world could be exactly as he wanted it to be, fuelling his narcissism to the extreme. Moreover, his father-figure King Robert was largely absent from his life and a terrible role-model, with his constant drinking and whoring (though Robert, at least, lamented on his deathbed that he hadn't been a good father).\n", "He was deceitful, but showed even less tact than his mother. He was willing to take advantage of the trust that Sansa Stark initially placed in him, when she was blinded by fantasies of marrying her handsome prince. In general, however, Joffrey was usually too short-sighted to bother lying, often simply committing various atrocities in public, without concern for the consequences. Joffrey had precious little restraint emotionally, and would continuously resort to petty, impractical, illogical and childlike delights on violent degrees - for example, pouring wine over Tyrion's head, grinning at the brief duel between the Mountain and the Hound or sneering whilst scarring Mycah. In his deluded and pathetically emotionless fashion, he would cling to any sadistic urge that came to mind and never truly considered the long-term repercussions of his actions (not unlike his mother). His execution of Ned Stark was more than likely an impulsive decision for his own sole and personal enjoyment, than for the latter's supposed treason, and was a politically disastrous move that plunged the Seven Kingdoms into war.\n", "Joffrey's view on his own family (immediate and alleged both) was extremely influenced by his own impulsiveness and self-absorption. Despite her protectiveness of him and constant support for his actions for most of his life, he was entirely comfortable being misogynistic and condescending towards Cersei - insulting her status as a woman, and mocking Robert Baratheon's disloyalty to her. Joffrey taunted and belittled his true father Jaime Lannister as an unexceptional knight and for the loss of his hand. In addition, he apparently bullied and tormented Tommen and Myrcella their entire lives, never connecting with them the way, for example, the Starks did, and even considering Tommen weak for crying like any normal person. Even his grandfather Tywin Lannister was a person he held in contempt, being arrogant enough to furiously accuse Tywin of being a coward during Robert's Rebellion, in comparison to Robert Baratheon (who climactically killed Rhaegar Targaryen in combat and took the crown for himself). This particular scene is interesting, because Joffrey did almost exactly this: Tyrion and Tywin fought, bled and prevailed against the insurgent Stannis Baratheon, while Joffrey hid behind the walls of the Red Keep without even killing a single invader personally. Based on all this, Robert was probably the only relative that Joffrey held in any high regard - and Robert wasn't even Joffrey's father. The worst relationship that Joffrey had was with his uncle Tyrion, and on several occasions Tyrion stymied and accosted Joffrey for his sadistic, cruel and arrogant actions, and Joffrey at several points went to petty means of mocking and deriding him. This probably influenced Joffrey's urge to point at Tyrion mere moments before he died, as one final stab at his uncle for so much as standing in his way.\n", "Joffrey was obsessed with the self-conception that he was a great warrior like King Robert, but displayed no martial skill. Joffrey never raised a weapon against an enemy combatant in his entire life, excluding Tyrion's birthday present to him, despite bragging melodramatically that he would personally cut down Robb Stark and Stannis Baratheon in battle (which he never came close to at any point in the war). Particularly, despite the fact that his faction was losing the war and bracing for a siege in King's Landing, Joffrey insisted that was the time for him to strike against the Stark forces as they were distracted by the Fall of Winterfell. However, Tyrion pointed out that his own city was on the verge of attack by Stannis's superior forces. His delusions were so extensive that during breakfast prior to his wedding - Joffrey noted, after receiving the Valyrian steel sword Widow's Wail, that using it would be like cutting off Ned Stark's head all over again - implying that he was the one who beheaded Lord Eddard, even though he simply ordered it and Ilyn Payne was the one who actually beheaded him. He also boasted, before the Battle of the Blackwater, that he would personally engage Stannis and kill him in combat, but never crossed the latter in combat throughout the entirety of the battle. Later on, to add stupidity to absurdity, he arrogantly claimed that he saved King's Landing and personally broke Stannis Baratheon at the Battle of Blackwater, when it was in fact entirely down to his uncle and grandfather's military efforts, whereas Joffrey turned coward and fled the battle, and Stannis himself was not entirely broken because he could still pose a threat to his opponents in the war and his claim still stood to reason. His bloodlust was often overpowered by sheer cowardice. He rarely killed manually nor did he initiate a fight where his opponent stood a decent chance of besting him. Because of this he preferred tormenting animals and vulnerable people rather than fighting warriors and regularly went on hunts because of this (akin to Robert, but at least the latter was legitimately skilled at fighting men).\n", "Aptly described as a vicious idiot by his uncle Tyrion, Joffrey was not simply a ruthless, exceedingly cruel tyrant, but absurdly incompetent. While Robert was also not skilled at ruling (though not as bad as Joffrey), he was at least respected as a great warrior. Joffrey, in contrast, had no redeeming values whatsoever: his only claim to rule was that he was the son of Robert, the previous king. The great irony, of course, was that Joffrey was actually Jaime's bastard son and had no valid claim to the throne, but a shockingly large number of Joffrey's followers continued to blindly obey his crazed orders without question. After hearing the rumors of his true parentage, Joffrey unwisely ordered that all of Robert's bastards be killed to make sure nobody would legitimately challenge his claim, which backfired drastically and only served to heighten suspicions when the people saw it as Joffrey destroying the evidence of the truth. This is one of the several occasions where Joffrey overextends himself, the other being when he apparently sends Ser Mandon Moore to kill Tyrion during the Battle of Blackwater Bay, ignoring two factors: Tyrion was leading Joffrey's men against Stannis when Joffrey abandoned the battle; also the Kingsguard (at least, by reputation) only ever serve major members of the royal family, among whom Joffrey is supreme, and his hatred of Tyrion is far too well known. Thus, Joffrey's actions are never properly calculated, and he never anticipates repercussions from them.\n", "Joffrey possesses all of the classical traits of narcissism, as he possesses an outrageous temper, is delusional about his self importance and superiority, and quick to torment and harm anyone who displeases him. He is known for his unstable mannerisms and affect when insulted, and has a very short fuse. He lacks remorse and empathy towards people, and has no ability or desire to expand it, and he is entirely apathetic and even cold towards his brother Tommen when the latter cries over the departure of his sister Myrcella - he even conceitedly claimed that princes shouldn't cry, despite the fact that he was witnessed crying himself. When confronted with this fact, he brushed it aside when Sansa pointed out that her brother Rickon cried himself, to which Joffrey claimed it was irrelevant because Rickon Stark wasn't a prince and Joffrey was, but he did not stop to speculate that this didn't make the slightest scrap of difference.\n", "Once in a while, Joffrey does make a valid point, such as that the feudal levy system in the Seven Kingdoms is somewhat antiquated, or that his advisors should be worried about Daenerys Targaryen reportedly hatching three new dragons in Essos or that his grandfather Tywin Lannister bode his time before he finally aided the rebels during Robert's Rebellion. Joffrey was capable of logic but only if the solution was obvious and even then he got it wrong. After being poisoned at his wedding feast he (incorrectly) assumed that it was Tyrion's doing. Presumably, he came to this conclusion due to his uncle's constant chiding, insulting and threatening as well his use of physical punishment to discipline his wild, uncontrollable nephew or the fact that he was made cupbearer and the only person who held the opportunity to poison his wine (this makes no sense, however, as Joffrey made Tyrion his cupbearer on the spot to humiliate him further and he would have no chance to poison him). His hatred of his uncle might have also been a factor in this conclusion.\n", "Generally, however, Joffrey only rarely made a valid insight as a means for the narrative to underscore that everyone else is overlooking something, i.e. \"if someone as stupid as Joffrey realized this, it should have been obvious to everyone else\". Even on those first two points Joffrey was quite short-sighted: he was concerned about Daenerys in the far east, despite the fact that Robb Stark was already leading major armies in rebellion in Westeros itself, and didn't consider that he should concentrate on the much more immediate threat (which is how Tyrion reacted to news of Daenerys). Similarly, while he vaguely said that having a standing royal army was better than using feudal levies, Cersei had to explain to him that his suggestion for how to make one was too impractical to work (if a royal army conscripts men from the North, they still wouldn't feel enthusiastic about attacking their fellow Northmen). Joffrey may also have been correct when he said that the Stark forces were distracted after the Fall of Winterfell, and that would have been the perfect opportunity to strike, but once again Tyrion had to remind him that his own city was preparing for a siege by Stannis Baratheon. Despite his lack of technical abilities and shortcomings in battle or combat, he was surprisingly knowledgeable on crossbows which he demonstrates to Margaery, knowing their make and models, effectiveness and was able to use them averagely well. His only direct kill with one, however, was Ros a prostitute whom he restrained and it was shown that he missed his shot multiple times due to the scattered arrows across the room.\n", "Despite all these negative traits, however, Joffrey is shown to be capable of feeling very limited emotion. On Robert's deathbed, he is visibly shocked and saddened at that his (legal) father may be dying and holds his hand, and (in the books) it is stated by various characters that Joffrey was very fond of Sandor Clegane despite his outwardly aloof manner towards him. He was probably more fond of the Hound because the man was a prolific and savage warrior, and had no complaints or restraints about killing, disregarding the fact that the Hound hated his even more savage brother, who was probably more aggressive and impractically violent than Joffrey himself, making him more interested in the Hound's combat prowess and aloofness (and Joffrey probably would have been terrified of the Mountain). He treated Margaery Tyrell much better than he did with Sansa Stark during their betrothal, although this is due to Margaery manipulating him by pretending to be intrigued by his playful sadism. On the other hand, he also acted charming and kind to Sansa, initially before turning her into his plaything to abuse and this one act was because his mother demanded him to do so, but he only became this way after her father confessed treason and her brother raised his armies against his claim.\n"], "personality_quotes": [], "figure_captions": ["Joffrey torments Sansa on the traitors walk in \"Fire and Blood\".", "Joffrey torments Ros and Daisy"], "quote": ["Everyone is mine to torment!", "―Joffrey Baratheon", "Mhysa"], "description": "King Joffrey I Baratheon was the eighteenth king to rule from the Iron Throne. He was formally styled as Joffrey of Houses Baratheon and Lannister, the First of His Name, King of the Andals and the First Men, Lord of the Seven Kingdoms, and Protector of the Realm. Though believed by most to be the eldest son of King Robert Baratheon and Queen Cersei Lannister, Joffrey is actually a bastard born from Cersei's incestuous relationship with her twin brother, Ser Jaime Lannister of the Kingsguard. He is the older brother of Myrcella and Tommen Baratheon, both of whom share the same parentage. Joffrey's actions during his rule sparked the War of the Five Kings and ended when he was poisoned at his own wedding feast by Olenna Tyrell and Petyr Baelish.\n"}