{"id": "Jorah_Mormont", "name": "Jorah Mormont", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Jorah_Mormont", "personality": ["Jorah is a complex character. He is Daenerys Targaryen's most loyal advisor and a formidable warrior. Jorah has a deep respect, loyalty and love for Daenerys, and has always tried to give her reasonable, practical, and effective advice. While Jorah is a moral person and always tries to be honorable, he has done several dishonorable acts out of love or for his own survival. He sold poachers into slavery to pay for his wife's spending habits, fled Westeros to escape execution, and briefly spied on Daenerys in the hope of receiving a royal pardon, though he stopped spying on her after becoming her advisor. Jorah is Daenerys's most level-headed advisor, at least until the arrival of Barristan Selmy.\n", "Jorah is intelligent, literate and well traveled, knowing the histories of Essos and speaking several tongues, including Dothraki.\n", "His relationship with his father, and likely the rest of his family, wasn't approached until the fifth season. Although he never showed any feelings towards Jeor, once he was given the news about his death, Jorah was visibly shaken and deeply upset, even angrily demanding to know the details of his father's death. This is most likely because he was still feeling guilty about bringing his family shame and never fully reconciling with Jeor.\n", "Although stoic, short-spoken and sometimes cold, Jorah does have the ability to warm up to people once they earn his respect. At first, he treated Tyrion like a hostage, but later, after the two barely survived the sinking of their boat, he started to trust Tyrion enough to leave him untied and later the two men shared their life stories and freely discussed Daenerys and her claim to the throne, although their newfound trust was shattered when Tyrion convinced Daenerys to exile Jorah from Meereen again (which he did to spare him Daenerys's wrath). However, after reuniting on Dragonstone, their relationship seems to be repaired, as Tyrion gives Jorah the coin that the slaver Yezzan had given him, with the promise to bring it back after returning from the wight hunt beyond the Wall.\n", "He is also a skilled warrior, though he does have a honor code, and tries not to kill his opponent if such option is possible. This is shown in the fighting pit, where every other warrior was brutally slaughtering one another, but Jorah came victorious without any loss of life in his hands. This worked in his favor since he was aware that Daenerys was becoming increasingly appalled by the needless violence happening in the pit right before Jorah got into the skirmish. And even after using brute force to harm another person, he does seem to try compensate for his actions, as he did give some money to a knocked out fisherman for his stolen boat. Also, Jorah has an immense tolerance for pain as he managed to stay silent during Sam's procedure to cure him of the greyscale even though the Citadel apprentice was effectively cutting bits of Jorah's own skin.\n"], "quotes": [], "figure_captions": []}