{"id": "Lancel_Lannister", "name": "Lancel Lannister", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Lancel_Lannister", "personality": ["When Lancel was young, he was shy, timid and extremely slow-witted, constantly falling for Robert Baratheon's harsh jokes and bowing before his fearsome tempers. He rarely spoke when he was with Robert except to offer him more wine, and to suffer his temper when there was no wine left. After Robert was killed in a hunt, which Lancel was partly responsible for, Lancel was knighted and this made him a tad bolder - more accurately, it made Lancel entitled, pompous, arrogant and melodramatic, speaking down to Tyrion as if he were a title superior to him and using his title as a knight in order to justify actions. When Joffrey had Ser Meryn Trant beat Sansa Stark in public, Lancel callously recited Robb Stark's recent victory against a Lannister army, making no attempt to shield Sansa from harm despite knowing she was playing no role in House Stark's rebellion against the Crown. He still remained timid and cowardly when someone with the means to push back did so; for example, he fell to pieces when Tyrion responded to his attempts at intimidation by guessing at Lancel's dalliance with Cersei and threatening to inform Joffrey of it. He could be truly courageous when he had to be, however: when Cersei refused to let Joffrey continue to fight in the Battle of the Blackwater after it started to turn against the Lannisters. he stood up to Cersei and tried to force her to let Joffrey return to the field, because he did not see any hope that any of them would survive without the morale boost the king could provide. In the end Cersei wasn't able to intimidate him into silence, and instead forced him to be silent by striking him on his already fairly seriously injured arm.\n", "Even after he dedicated himself to the Sparrows, he still maintained an arrogant and self-righteous attitude. In fact he was at least as arrogant as a holy man as he was as a knight. With the rest of the Faith Militant to back him up, Lancel would repeatedly try to intimidate others regardless of these people being lords, priests or generally powerful people. That being said, he was not incapable of being self-reproachful and he seemed to be genuinely apologetic about 'leading' Cersei into their unlawful relationship, which is in stark contrast to when he literally was rendered speechless when confronted by Tyrion with the consequences of what he had done.\n"], "quotes": [], "figure_captions": []}