{"id": "Loras_Tyrell", "name": "Loras Tyrell", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Loras_Tyrell", "personality": ["Before the start of the War of the Five Kings, and later his arrest and imprisonment by the Faith Militant, Loras led a carefree life as a tourney knight. A prodigiously skilled warrior and an extremely popular young man, he is shown to be gracious towards everyone around him and grateful whenever someone does him a favor. He was quick to thank Sandor Clegane when the latter saved Loras's life from his ferocious brother, Gregor, and showed his appreciation by declaring him champion without having a joust. However, Loras was also rather spoiled to a fault, which could have arguably played a role in his downfall. Renly pointed this out to Loras by the expensive and extravagant suit of armor that his father procured for him to wear at tournaments. Loras also shows a hint of his grandmother's influence when he mocked Robb Stark for \"hiding behind his mother's skirts\" as opposed to appearing in person to treat with Renly and Jaime Lannister for his incest when the latter tried to intimidate Loras into calling off his engagement to Cersei Lannister.\n", "Loras thought that Renly Baratheon would have been a wonderful king because he didn't enjoy killing like Robert did, and he was extremely popular unlike Stannis. When Renly was murdered, Loras correctly deduced it was Stannis and furiously vowed that he would personally execute the man, overlooking the fact that the odds were against him being able to do so. One of Loras's weaknesses was he did not always think through the risks of his actions, and it took much persuasion by Margaery to get him to back off from confronting Stannis immediately and instead wait for a better moment to seek revenge. Loras takes further risks in later seasons when he becomes involved with Olyvar, despite Margaery's warnings that people could find out about it, and gave little thought to the possibility that their relationship might be used against him. Due to the protection afforded him all his life as the heir to Highgarden, Loras reacted with anger and disbelief when Lancel Lannister and the Faith Militant arrested him. Only when the Sparrows call Olyvar forward to testify at the inquest does Loras begin to show genuine fear that he will be betrayed, which occurs when Olyvar tells the High Sparrow about their past relationship. His subsequent imprisonment by the Faith Militant demoralized Loras to the point that he was willing to publicly renounce all he once held dear and humble himself before the High Sparrow in order to be released.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Where is it written that power is the sole province of the worst? That thrones are only made for the hated and the feared? You would be a wonderful king.", "―Loras Tyrell to Renly Baratheon", "The Wolf and the Lion"], "description": "Ser Loras Tyrell was a popular tourney knight and was regarded as one of the most skilled knights in Westeros. He was the heir to Highgarden, as well as being the younger brother of Margaery Tyrell, who would later become Queen of the Seven Kingdoms. He also had a long-term romantic relationship with Renly Baratheon and was devastated when Renly was murdered; following this, Loras fought at Blackwater to avenge his death, and helped to win the battle to save King's Landing. Afterwards he stayed in the city to support his sister in the new alliance between the Tyrells and House Lannister. However, following the Faith Militant's subsequent takeover in the capital, he was arrested and sent to prison. Informed that his only hope of getting out was to confess and give up his inheritance, he abdicated his titles and became known as Brother Loras. However, he died only a few minutes later along with his father and sister when the Great Sept of Baelor was destroyed in a plot orchestrated by Cersei Lannister.\n"}