{"id": "Lord_Varys", "name": "Varys", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Lord_Varys", "personality": ["Varys is a mysterious man if ever there was one. He is completely unpredictable, in no small part thanks to his stoic, calm and reserved demeanor and his ability to wade through one confrontation after another without losing his dignity, temper or advantage. He frequently claimed that his one and only ambition was to accomplish and to achieve for the good of \"the realm\", although exactly what this means is extremely subjective to those unaware of his true loyalties. Varys is one of the very few people in Westeros who possess immense political power and do not intend to sit on the Iron Throne themselves. He never appears to serve one side for long at all, and may not have served that side in the first place when all is said and done, and nobody appears capable of trusting him.\n", "Varys, in spite of appearing subservient and passive, is an extremely intelligent man, a master of deception, manipulation and calculation. Varys's subtle and calculative nature is made more impressive by him owning the most prominent spy network in all of Westeros, which is only matched by the spy network of Petyr Baelish. Despite having a mutual rivalry and hatred for one another, both Baelish and Varys are incredibly similar: they appear to be sycophantic and meek, but are in fact shockingly ruthless and possess powerful intellect, they both have vast networks of personal spies, traitors and double agents that are entirely at their disposal, and they both rose to positions of great political power. Varys and Littlefinger have such a rivalry with one another so unusually complex that they are able to spar verbally with one another intensely without ever coming to blows. Instead they calmly insult one another as quickly and as precisely as two master swordsmen sparring to the death. However, while Littlefinger has a personal ambition to take all of the reachable power there is in the Seven Kingdoms for himself and eliminate anyone who obstructs him, Varys dedicates himself to be the ultimate kingmaker and is hell-bent on restoring what he sees as prosperity to Westeros for the sake of the people. For all the similarities in their means, the pair are antithetical to each other in their intended ends. Their origins are also significantly different: Littlefinger was born the heir to a noble house (albeit a lower-ranking one) whereas Varys was born a slave, a status he only escaped from after being left for dead following his castration.\n", "Entirely in spite of his reserved and subtle demeanor, Varys is an extremely dangerous man who is capable of unspeakable cruelty and ruthlessness — though usually only when absolutely necessary. He is not above threatening people to get what is required for his plans, but is also willing to give other players fair warning when warranted. For instance, when Tyrion threatened to throw him into the sea, Varys serenely retorted that he would simply survive and come back to return the favor.\n", "Varys is a survivor of the highest order. He compares the game of thrones to a dangerous body of water and says that he will \"keep on paddling\" through powerful storms, dangerous tides and fish eating each other. Having survived Robert's Rebellion and the War of the Five Kings with nary a scratch, it seems his metaphor is quite apt. Even so, Varys is not incapable of fear: when he was emasculated by a sorcerer, the most terrifying part of the entire experience was when the sorcerer threw his pieces into a fire and a voice answered the sorcerer's call. Varys would spend the rest of his life having nightmares about that voice, becoming painfully introduced to the horrors of the real and supernatural world. He has since developed a disdain for magic in general, especially blood magic, seen when his calm facade falters while confronting High Priestess Kinvara.\n", "Varys's calm facade also masks a somewhat vengeful nature, as he exhausted a great deal of influence to find and capture the sorcerer who castrated him. Varys tells Tyrion, upon observing the bound sorcerer, that revenge is perfectly within his reach, provided that he has the 'stomach' for such a thing—and leaves him alive, intending to take his time and savor the revenge he had long sought. However, with this notable exception, Varys usually does not employ his more ruthless nature unless necessary. He will betray, lie and kill without hesitation, yet he does not do so for his own enjoyment but strictly for the fulfillment of his plans and for his own survival.\n", "Despite his temperament as a skilled manipulator and unwillingness of others around him to trust people like him, he is not incapable of making true friends at a personal level. Tyrion Lannister is the most notable example. Initially saving the dwarf due solely to the fact that he perceived Tyrion to be essential in his plans, Varys and Tyrion eventually develop an amiable friendship during Tyrion's tenure as Hand of the King, enough for Varys to express regret at testifying against him and to put effort into smuggling him to Essos to survive and serve Daenerys. Tyrion has mentioned more than once that he will miss Varys's presence when the eunuch is needed elsewhere; they greatly enjoy conversation with each other, as they are both superb intellectuals with a dry, dark sense of humor, but unlike the sociopathic Baelish Tyrion's compassionate nature is more similar to Varys's.\n", "During a conversation with Oberyn, Varys states that he was never interested sexually in either men or women before his castration; however, this is difficult to verify, as he was castrated at a young age, most likely before puberty. Despite eunuchs having no sexual attraction, Grey Worm’s feelings for Missandei show they are capable of romantic attraction, Varys, however, shows no desire for any relationships on a sexual or loving level because of his devotion to seeing Westeros repaired and at peace. Most of the people of Kings' Landing assume he satisfies his desires with his \"little birds\" but this seems unlikely as Varys has never shown any malice or desire towards his spies, and he has himself stated that he would never seek to harm a child. Varys admits that, after his castration, he did sell himself sexually for a while in his struggle to survive the slums of Essos. However, he took no enjoyment from it, and, after witnessing so much cruelty take place in Westeros and Essos as a result of desire, he claims to be relieved that he can no longer experience it.\n"], "personality_quotes": [["Varys: \"I did what I did for the good of the realm.\"\n", "Littlefinger: \"The realm? Do you know what the realm is? It's the thousand blades of Aegon's enemies, a story we agree to tell each other over and over until we forget that it's a lie.\"\n"]], "figure_captions": [], "quote": ["Storms come and go, the big fish eat the little fish, and I keep on paddling.", "―Varys", "The Night Lands"], "description": "Varys, sometimes called the Spider, is a eunuch and was the Master of Whisperers on the King's Small Council until he is forced to flee King's Landing with Tyrion Lannister. He is a skilled manipulator and commands a network of informants across two continents.  \n"}