{"id": "Lyanna_Stark", "name": "Lyanna Stark", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Lyanna_Stark", "personality": ["At first glance, Lyanna is shown to be fiercely independent, tomboyish, and willful, much like her niece Arya. As a young girl, Lyanna was extremely spirited and self-confident, as evidenced by how great a rider she was. In addition, she was uncommonly kind to those of lower birth than her, shown prominently by her friendly treatment of Wylis, a mere stableboy in contrast to her being a great lady from a powerful family. Lyanna also showed herself to be quite practical, stating that with Ned leaving to the Eyrie someone would have to train their little brother Benjen.\n", "She is later revealed to have also been rather rash when her nephew Bran discovers that she flouted her betrothal to Robert Baratheon without making a clean break with him, and secretly wed Rhaegar Targaryen instead. It can be argued that she did not love Robert as she did the dragon prince, but it is rather surprising that someone like Lyanna wasn't swayed by the fact that their marriage (or the incidents surrounding their marriage) could bring about the deaths of her whole family, or that it would haunt her house (and Rhaegar's) for years to come. Although Rhaegar annulled his marriage to Elia Martell before marrying Lyanna, their discretion inadvertently led to the deaths of Lyanna's father and eldest brother, which in turn sparked a war that caused the deaths of tens of thousands, including that of her beloved Prince Rhaegar.\n", "Despite all of this, Lyanna was fiercely protective of her son in the brief time that she had with him, and begged her brother Eddard to protect him, knowing that Robert would surely kill him if ever found out the truth. She deeply loved and, more importantly, trusted her brother - she showed true gratitude that it was him who found her; furthermore, Lyanna freely admitted to him that, despite wanting to be brave so desperately, she was afraid to die. That being said, in her final moments, Lyanna pleaded with Ned to protect her beloved son, as opposed to lamenting about the fact that she was going to die. She held more value on the life of her child Aegon, the rightful heir to the Iron Throne.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["His name is Aegon Targaryen. If Robert finds out, he'll kill him. You know he will. You have to protect him. Promise me, Ned. Promise me.", "―Lyanna's final wish for her son, Jon Snow, to her brother Ned.", "The Winds of Winter"], "description": "Princess Lyanna Stark was the daughter of Lord Rickard Stark and sister of Brandon, Eddard, and Benjen Stark. She went on to be the wife of Rhaegar Targaryen, the Prince of Dragonstone, and mother to his son.\n"}