{"id": "Lyanna_Mormont", "name": "Lyanna Mormont", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Lyanna_Mormont", "personality": ["Despite her young age, Lyanna is shown to be a competent, effective, and intelligent leader, in sharp contrast to the psychopathic Joffrey, timid Tommen, and developmentally challenged Robin Arryn. While she emanates self-confidence, she does not hesitate to consult her advisors if she sees the need. At the same time, she is not overly-reliant on her advisors, and will wave aside her maester if she has reached a firm decision already. As a female and the only living heir of a major Northern house, Lyanna challenges and strives to live up to the expectations placed upon her, and behaves in a stern, no-nonsense manner when negotiating with other houses. She is extremely proud of her house, and she is devoted to protecting Bear Island's people, indicating that she views this responsibility with the utmost solemnity. Though Lyanna shares her family's fierce loyalty to House Stark, she was initially reluctant to help Jon and Sansa fight the Boltons until Ser Davos convinced her, comparing their recent rises to power and informing her of the greater threat beyond the Wall.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Lyanna Mormont: \"We are not a large house, but we are a proud one, and every man from Bear Island fights with the strength of ten mainlanders.\"\nDavos Seaworth: \"If they're half as ferocious as their lady, the Boltons are doomed.\"", "―Lyanna Mormont impresses Davos Seaworth.", ""], "description": "Lady Lyanna Mormont is the young Lady of Bear Island and thus the head of House Mormont of Bear Island ever since the death of her mother, Maege Mormont. She is the niece of Lord Commander Jeor Mormont of the Night's Watch and the first cousin of Ser Jorah Mormont. She pledges House Mormont's forces to House Stark upon meeting Jon Snow, Sansa Stark, and Davos Seaworth, making her house one of the few loyalists to fight for the Starks against House Bolton at the Battle of the Bastards. Afterwards, she is the first to declare Jon Snow the King in the North during a gathering of the Northern lords at Winterfell.\n"}