{"id": "Maester_Aemon", "name": "Aemon", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Maester_Aemon", "personality": ["Aemon Targaryen was an extremely wise old man, and a source of guidance at the Wall for anyone who approached him. Having lived for over a hundred years, Aemon has become aware of the struggles of men of the Night's Watch, in particular the significance of one's duty and dedication, primarily because he has faced a major struggle of such kind in his life. As a Targaryen, Aemon's refusal of the Iron Throne shows that he has no interest in personal power and would rather devote himself to knowledge and the guidance of others. He was aware that the Night's Watch was not what it used to be, and understood the severe weaknesses and threats that came with this fact.\n", "Clearly, Aemon does not suffer from the same Targaryen madness as the likes of Aerys and Viserys Targaryen did, since his mind remained completely and totally sharp and clear throughout his entire life, perhaps a tribute to the fact that he rejected positions of extreme power, whereas the Mad King and Viserys coveted extreme power. However, Aemon clearly had a deep and personal love for his family, and cited that the death of that family was absolutely devastating for him - he was faced with an extraordinary decision when he learned of the defiance and destruction of House Targaryen, between his family loyalty and his oath to the Night's Watch. He hints that he still deeply regrets his decision, but knows that he could have done very, very little. All the same, Aemon's love for his family shows with his reference to his father as 'Maekar, the First of His Name' in recognition of his ascendance to the Iron Throne, and continuing to refer to his brother Aegon as 'Egg'. He was particularly appalled by the slaughter of children, discussing with rage the deaths of Rhaegar's children. When he learned that his great-niece Daenerys was alive in Meereen, he once again showed how much he loved his family as he lamented that Daenerys is alone and he is too old and sickly to help her.\n", "Aemon was an intelligent man who loved reading, and lamented the irony of being blind and surrounded by so many books. He became an extremely close friend of Samwell Tarly, whom he (rather uniquely) didn't judge based on his cowardice and obesity, and was constantly respectful of him. Their friendship was so powerful that Sam didn't want Aemon to die, and he gave a heartfelt eulogy upon Aemon's death.\n"], "quotes": [], "figure_captions": []}