{"id": "Margaery_Tyrell", "name": "Margaery Tyrell", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Margaery_Tyrell", "personality": ["Margaery's beauty was equaled by her cleverness, which she had in abundance. A true protégée of her grandmother Olenna, she was a gifted manipulator who knew how to maneuver her way in court politics. Margaery's strength was in her ability to win the minds and loyalties of her subjects, which had proven to be a threat to those who rival her family, such as the Lannisters. She demonstrated her formidable skill in her charity work to win over the commoners of King's Landing, as well as her manipulation of Joffrey by making him think she was excited by his dark impulses.[9] In return, Margaery gained the acceptance of both her subjects and Joffrey,[10] who was an unpredictable and uncontrollable madman to everyone else, including his mother. This proved to be a threat to Cersei, who only relied on the fear of her family name and her position as a source of power.\n", "Margaery possessed the tact and politeness that Cersei lacks. While Cersei is blunt and often rude, Margaery was capable of exuding the courtly behavior and courtesies expected of a queen - while still privately engaging in palace intrigues to increase her family's power. Cersei scorns her status as a woman in a realm dominated by men, though she is willing to use sex as a weapon to seduce those she needs (such as her cousin Lancel). In contrast, Margaery worked within the social standards of \"proper\" femininity in Westeros, but adeptly turned them to her favor, to orchestrate political machinations from behind the scenes.\n", "​Although Margaery had to develop many different facades depending on who she is trying to manipulate, she was shown to genuinely have a good heart, compassion, and empathy. Margaery had loving relationships with all of her family members. She loved her brother Loras and was entirely tolerant of his homosexuality - to the point that when her father contracted a marriage-alliance between herself and Loras's own lover Renly, she acknowledged that it was a paper marriage, and was quite frank that she had no issues with her new husband continuing his sexual relationship with her brother. In addition, she rather resourcefully suggested utilizing Loras in order to help conceive a child with Renly. She also showed genuine concern for Sansa Stark and tried to form a friendship with her, even offering her help to get out of King's Landing once married to Joffrey - though this may have been in part because she had the more long-term goal of good relations with the North, sensing that the unstable Lannisters wouldn't be in power forever. She shared a very strong bond with her grandmother, sharing her acuity for manipulation and political maneuvering. Though she had developed many facades in order to sway the opinions of others in her favor, she was extremely loyal to her family and house, and would go to great lengths to keep them safe. Though she was willing and able to feign affection for Renly and Joffrey, she genuinely cared for Tommen (she may not have exactly loved him, but it's quite clear that she at least liked him) and bore him no ill will when he failed to stop the arrest of both her and her brother, a feeling which he reciprocated to such an extent that he willingly committed suicide when she was murdered by Cersei.\n", "It should be noted that Margaery herself was not technically outmaneuvred by Cersei in the end: Margaery, even without having any idea of the wildfire plot, realized the threat of Cersei's absence, and thus ordered an evacuation, potentially with time to spare to get everyone out. It was, instead, the High Sparrow who was outmaneuvred, refusing to listen to Margaery and not accepting that his plans were about to collapse.\n"], "quotes": [], "figure_captions": []}