{"id": "Melisandre", "name": "Melisandre", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Melisandre", "personality": ["Melisandre is best defined by her seemingly unwavering faith in the Lord of Light, which seems to dominate every move she makes. A religious fanatic, she attributes many, if not any, great thing to be done in the world as an act carried out by the Lord; however, funnily enough, she doesn't credit herself with anything she does in the fire god's service, describing herself as simply a vessel for his will. She is extremely intelligent in her own way and appears to have an uncanny understanding of other people, which enables her to either gain their trust or to subdue them in a confrontation without it coming to blows between them, which sets her apart from women like Cersei Lannister (who subdues them by threatening them with her own family's power) and Margaery Tyrell (who actually gets people to trust her and feel comfortable around her). The latter is a person whom Melisandre especially contrasts with in this regard, because almost everyone feels uneasy around her, in spite of her calm and serene behavior.\n", "Melisandre has a habit of being exceptionally changeable in spite of her absolute faith in R'hllor, which is demonstrated several times. When she meets Stannis Baratheon, she convinces him that he will win the war with great ease on the basis that he is the one true king, and goes to extremely great lengths to ensure that this victory is carried out (to the point of using blood magic to murder Renly Baratheon, which proves to be a wasteful move since Stannis ended up losing the Battle of Blackwater Bay anyway). When Stannis broods over losing at Blackwater Bay, he actually threatens her and she remains faithful to R'hllor, although she doesn't willingly admit that her god wronged both her and Stannis by causing the loss at Blackwater Bay - a suggestion which Melisandre ought to believe because she is convinced that the Lord of Light controls everything, and seems to have protected the usurping lords who stand against Stannis. She defends herself by assuring Stannis that the war between Stannis and his enemies will be long and costly, but eventually he will succeed.\n", "Melisandre is a woman who is completely aware of her own enigma - in fact, her enigma is something that she relishes. Very little is truly known about her past other than generalizations that she gives other people; she claims that she has been fighting for far longer than Stannis ever has (something which is strongly supported by how old she is revealed to be), and is revealed to actually be a ferocious opponent in her own right, as she subdues Stannis when he attacks her by reminding him of how he needs her alongside him. She also frightens Davos Seaworth with her own powers, especially by alluring him in anticipation for what he is about to see. One prime example is when Davos returns to Dragonstone and Melisandre maintains control over Stannis by provoking Davos into attacking her, which leads to him being arrested. In spite of her animosity, Melisandre wasn't above realizing that Davos was still of use to Stannis and that he would be needed in the coming war. Melisandre is also completely able, and adept, at using her own sex to her advantage, seducing Gendry into being a part of her ritual for Stannis - however, when Robb Stark is killed as a result of this ritual, Melisandre scorns Davos for wanting to see the Lord's power, since the ritual still hasn't brought Stannis closer to the Iron Throne, even though Melisandre performed the ritual herself.\n", "Melisandre, although apparently representing a god who is good and true, can deliberately be incredibly ruthless and cruel. She is completely willing to erase hundreds of lives in representation of her faith in the Lord of Light, to the point of outright murdering good men and allies under the assumption that it will win Stannis favor with her god. She saw nothing wrong with burning people publicly, and behaved as if they had been freed from their sinful bodies and become assets to the Lord of Light, comparing it to how a woman screams before she gives birth and is immeasurably happy afterwards - Shireen Baratheon is quick to point out the drastic difference being that women giving birth aren't ash and bone afterwards. Melisandre speaks of the sinfulness and cruelty of her enemies, even though she herself can be cruel and even arrogantly, unapologetically sadistic, shown prominently when she taunts Davos with the concept that the mass-casualties at Blackwater Bay were his fault because Melisandre wasn't there, and how she uses Mathos's own death (which happened right in front of Davos) as an example to this. The worst example of her cruelty by far is when she convinces Stannis to burn his own daughter alive in public, indifferent to the screams of both Shireen and her mother, and the brutal despair that Stannis experiences.\n", "As the War of the Five Kings climaxes and devolves into disaster, Melisandre's faith begins to crack. She begins to lose faith in Stannis as the Battle of Winterfell comes closer at hand, but remains at his side for the most part; however, after the deaths of Shireen and Selyse (the latter of which Melisandre is partly responsible for), Melisandre flees the battle, perhaps in fear of Stannis's rage, and is unable to do anything to help Stannis crush the Boltons in battle, even though she claimed to Davos that she would have eased Stannis's victory at Blackwater. Melisandre's faith is crushed at the news of Stannis's defeat and the concept that she was wrong, and she becomes more withdrawn than before. She seems to transfer her faith to Jon Snow, who actually proves to be the man who would win a great battle in the North, and supports him after she resurrects him. This is a surprising turn for Melisandre because she supported Stannis so strongly under the impression that he was the one true king that would defeat the great evil to come, only to transfer her faith to somebody else. On the other hand, this is an understandable move by Melisandre because she tries to maintain her faith in the Lord of Light, in spite of the misfires and obstacles that come her way. It should be noted that during her service to Jon, Melisandre stops proselytizing her faith and only uses her magic when he commands it, adopting a more subdued approach to her religion and future events and ultimately behaving a bit more like Thoros.\n", "Melisandre's inadvertent cruelty and ruthlessness, as well as her extremely costly faith in the Lord of Light, finally explodes in her face when Davos finally confronts her over the death of Princess Shireen. Having quarreled with Davos over the true greatness of the Lord of Light from the beginning, Melisandre is defenseless when Davos berates her over the wastefulness of her sacrifices and the fact that, in spite of her claims to represent a great god, she purposefully burned a child at the stake on the basis that she had king's blood in her veins. Melisandre is unable to speak when Davos condemns the Lord of Light as evil because of what he 'made' Melisandre do, and has the gall to shame Stannis and Selyse as equivalently responsible for Shireen's death, even though, out of the three of them, Melisandre was the only one who didn't show restraint in the act. She is unapologetic about her own blind faith, and maintains her philosophy that the Lord of Light is influential in the battle between good and evil, and the fact that she committed unforgivably evil acts in representation of good.\n", "Even though Melisandre stakes a claim of superior knowledge about the Lord of Light, she faces several incidents and outcomes which she proves unable to predict or even understand. She is speechless at the revelation that Beric Dondarrion had been brought back six times by the Lord of Light, which she deemed impossible. She is also disappointed at the concept that there is nothing after death, even though she convinced herself and tried to convince many others that death would be a release into someplace much greater than the hell that everyone lives in.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["The night is dark and full of terrors, old man, but the fire burns them all away.", "―Melisandre to Cressen", "The North Remembers"], "description": "Melisandre, often referred to as the Red Woman, is a Red Priestess in the religion of R'hllor, the Lord of Light, and a close counselor to Stannis Baratheon in his campaign to take the Iron Throne. After Stannis Baratheon's death at the Battle of Winterfell, she revives Jon Snow after he is murdered by various members of the Night's Watch, believing him to be The Prince That Was Promised, and serves Jon as an adviser until she is banished from the North after the Battle of the Bastards when Jon learns that she sacrificed Shireen Baratheon and countless innocent people while in Stannis's service. However, she later unites the newly crowned King in the North with Daenerys Targaryen, believing they both have an important part to play in the Great War.\n"}