{"id": "Meryn_Trant", "name": "Meryn Trant", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Meryn_Trant", "personality": ["Meryn Trant is a pompous and casually cruel man who follows any orders from the king no matter how ridiculous or unnecessary such as beating Sansa in plain view of the court to the disgust of Tyrion, Bronn, and the Hound. He also blindly follows orders from Cersei. Meryn is a superb example of what a knight of the Kingsguard should not embody: A man who wields his white cloak as a privilege to do whatever he wants, and would rather victimize the weak than help it, and would rather not take important matters into his own hands. A true knight of the Kingsguard would not raise a hand to the weak, as the white cloak is seen as a personification of his duty. Trant is also a sycophant, blatantly praising Joffrey as a loved person and showing \"loyalty\" to him when Tyrion mocks the boy. He also doesn't give Jaime Lannister much respect despite Jaime being Lord Commander.\n", "The Hound questions Syrio's skills, as he doubts that Trant would have been able to kill the First Sword of Braavos, quipping that any boy whore with a sword could beat three Meryn Trants.[2] He has been shown willing to beat those who cannot retaliate, like Sansa, children (as indicated by Tyrion when he describes him as a \"pompous child-beater\") and the young girls that he pays for the pleasure of beating.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Meryn: \"You're an up-jumped cutthroat, nothing more.\"\nBronn: \"That's exactly who I am. And you're a grub in fancy armor who's better at beating little girls than fighting men.\"", "―Meryn and Bronn discuss their statuses", ""], "description": "Ser Meryn Trant is a member of House Trant, a vassal house to House Baratheon. He becomes a knight of the Kingsguard of Robert Baratheon after Robert's Rebellion. He is a successful tourney knight, though Sandor Clegane is scornful of Trant's skills, remarking that \"any boy whore with a sword could beat three Meryn Trants.\"[2]\n"}