{"id": "Myrcella_Baratheon", "name": "Myrcella Baratheon", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Myrcella_Baratheon", "personality": ["Described as \"sweet and innocent\" by Tyrion Lannister, Myrcella is effectively the complete opposite of Cersei and Joffrey. While Joffrey is a villainous psychopath, Myrcella, much like her other brother, Tommen, is a kind and caring individual. While at Winterfell, despite not knowing Bran Stark all that well, she expresses concern for his well-being and is visibly happy to hear that he will live.\n", "After the outbreak of the War of the Five Kings, Myrcella continues to be kind to Sansa Stark, despite her older brother Robb being the Lannisters' primary enemy at the time. Having grown a little older, Myrcella appears to be looking forward to Sansa and Joffrey's wedding, partly due to the dress she will be wearing, though she makes a point to mention the nicer dress Sansa will wear as the bride. Her relationship with Joffrey is not elaborated on much, but Myrcella is shown to love her family to the point that she cries while leaving for Dorne, despite the intention to keep her safe from Stannis Baratheon.\n", "During her years in Dorne, Myrcella matures greatly and learns to become somewhat independent of her family, after falling in love with Trystane Martell and looking up to Doran Martell as a surrogate father. When Jaime Lannister arrives in Dorne to rescue her from Ellaria Sand, Myrcella appears more surprised than happy to see her \"uncle\", and refuses more than once to return to King's Landing with him. It is only when Trystane is ordered to accompany her that she agrees, given her love for her betrothed. Her relationship with Robert Baratheon, her legal father, seems to have been somewhat distant, as with Joffrey and Tommen, since when Myrcella tells Jaime that she knows he is her real father, despite the taboo against incest, she expresses happiness, implying that she held a lot more respect for Jaime than she did for Robert.\n", "However, one of her greatest flaws is her naivete. After Oberyn Martell is killed, more than one threat is made towards Myrcella, the first being the theft of her necklace, which she simply assumes was stolen from her room instead of suspecting Ellaria. Even after the Sand Snakes attempt to kidnap her from the Water Gardens and Ellaria shows obvious anger when Doran arranges for her to return to King's Landing, Myrcella's innocence gets the better of her one last time and she foolishly allows Ellaria to kiss her on the lips and poison her, very easily falling for Ellaria's apology despite her so openly having threatened her life numerous times.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Myrcella's a sweet, innocent girl and I don't blame her at all for you.", "―Tyrion to Myrcella's mother, Cersei Lannister", "The Ghost of Harrenhal"], "description": "Princess Myrcella Baratheon was commonly thought to be the only daughter of King Robert Baratheon and Queen Cersei Lannister. However, like her brothers, her real father is Jaime Lannister, making her a bastard born out of incest.\n"}