{"id": "Olenna_Tyrell", "name": "Olenna Tyrell", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Olenna_Tyrell", "personality": ["Olenna's most prominent traits are her sharp wit, high cunning and intelligence. A politically astute woman, Olenna has been a master of court politics and intrigue her entire life. Olenna's strength and competence in politics has made her the de facto head of House Tyrell and, by extension, the Reach itself. An outspoken woman with little patience for inconvenience, she is unafraid of using her power as head of House Tyrell to threaten her enemies. Olenna never shies from stating her opinion (unless it is more advantageous to mask it) and truly hates Cersei Lannister for her cruelty, incompetence, and deep selfishness. She also admits that she finds Sansa Stark rather dull and is interested in her political potential and not her personality. Olenna stated that she did not trust Tywin Lannister, nor did she especially like him as a person, but she did respect him for his steadfast diligence, ambition and intellect - she almost praised him for the fact that he actually lived up to his reputation. Tywin apparently felt the same way about Olenna, as she was one of the few people he ever treated as an equal – notably, when dealing with her, Tywin actually gave her his full attention and even poured her a drink,[25] rather than continuing with his paperwork as he did when almost everyone else – including his own children – came to speak with him.\n", "Olenna is incredibly intelligent, as well as wise enough to understand that sometimes people must work with their enemies rather than constantly compete against them, which also explains why she respected Lord Tywin. On the darker side, Olenna has no problem harming children - such as when she poisons Joffrey, leading to his death in his mother's arms - proving she can be just as ruthless as Tywin or Littlefinger when necessary. However, this was not entirely without reason, as she did it in order to protect Margaery from the monster that Joffrey truly was, describing the tyrant as a \"cunt\". She also mentioned to have done or had done unspeakable things for the safety of her house and family and never regretted them since she deemed them necessary.\n", "She appears to have a very dark sense of humor and likes to mock those around her, including her own family. Despite this, Olenna clearly loves her family dearly, especially her grandchildren. Furthermore, she reveals to her granddaughter that even though she considered her husband Lord Luthor Tyrell an oaf, she genuinely loved him and struggled to accept his death. Olenna clearly is a staunch supporter of House Tyrell, despite being born and raised a Redwyne (but the Redwynes are also known as strong supporters and loyal bannermen to House Tyrell). In this regard, she is very similar to Tywin Lannister, who also places the power and prestige of his House above all else. Olenna, however, is wise to not be as ruthless or as cold as he was. She strikes a much healthier balance between loyalty to her House and affection for her family than Tywin ever did: whereas all three of his children grew to bitterly resent him, Olenna's grandchildren dote on her, and even her exasperation for Mace's oafishness is affectionate. When she shoots down Mace's attempt to speak to her and Tywin, he doesn't show offense but smiles indulgently, showing that he too dotes on her and is quite content to be under her.\n", "Following the death of her family, Olenna's tongue grew even sharper. Instead of showcasing her cunning wit, her jagged barbs now stem from anger and pain. Olenna has not grown reckless or despondent, however: she is ready and willing to seek revenge, and remains strategic and pragmatic about doing so. She also makes it clear that since her entire future has been robbed from her, she doesn't care about survival; she is perfectly willing to die, and exhaust the considerable resources at her disposal, if it means she can bring Cersei to justice. Indeed, when facing death she is perfectly calm and willingly drinks the offered poison after ensuring it won't be painful; before she goes, however, she reveals her part in Joffrey's death and requests that Cersei be told, a last bit of vengeance for and from House Tyrell.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["I did unspeakable things to protect my family. Or watched them being done on my orders. I never lost a night's sleep over them. They were necessary. And whatever I imagined necessary for the safety of House Tyrell, I did.", "―Olenna Tyrell to Jaime Lannister", "The Queen's Justice"], "description": "Lady Olenna Tyrell, née Redwyne, was the elderly matriarch of House Tyrell. Lady Olenna had been a mistress of court politics, plotting and intrigue par excellence throughout her life. She was also known for her wit and sarcasm. As a result, Lady Olenna was popularly nicknamed the Queen of Thorns, in reference to the Tyrell sigil - a rose - and her cutting, barbed comments. In many ways she was the de facto head of House Tyrell at the time of the War of the Five Kings and appeared to hold a great deal of influence over the Reach.\n"}