{"id": "Petyr_Baelish", "name": "Petyr Baelish", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Petyr_Baelish", "personality": ["Baelish is a cunning, Machiavellian, unpredictable, and ruthless manipulator of court politics. He is at times capable of putting on a seemingly friendly face with a friendly smile - but his eyes don't smile when his mouth does. The exact inner motivations that drive Baelish are unclear, as are his ultimate goals, but he has no real loyalty or genuine affection for anyone. Behind his smiles and forced mild manners, Littlefinger is shrewd and calculating, willing to casually dispose of people who trusted him, like a man replacing a coat he no longer needs. He is an extremely intelligent man, not only a genius at financial matters but at cynically controlling those around him. As Varys observed, he is a grasper from a minor House, with a very great skill at befriending and ultimately maneuvering powerful people.\n", "Littlefinger started out as an impoverished noble from an insignificant minor House in the \"little Finger\" peninsula of the Vale, but felt constantly looked down upon for his relatively lowly status by much higher noblemen. His treatment by the Tullys when he was a young man, and his near-death at the hands of Brandon Stark, embittered him against both families. He was also never strongly attached to the other Vale lords who looked down on him most of his life. Petyr loved Catelyn, but she saw him only like a brother, and Catelyn's father wanted Petyr to have nothing to do with her.\n", "In truth, underneath Littlefinger's people-mask, he is a cold sociopath who hungers for power over others basically for its own sake. Curiously, even seemingly plausible goals such as \"revenge against the Starks and Tullys\" - which at times is what he tells himself he is doing - are really only excuses and rationalizations for his utter ambition to control everything around him - he has stated more than once that he wants \"everything.\" Even Littlefinger's alleged feelings for Catelyn Stark truly seem to have just been a rationalization for his greed for power. Though surely, Littlefinger himself is convinced that he truly \"loved\" her, in reality, his attraction was one-sided, and he was obsessively stalking a girl who never returned his affections beyond a platonic level. Hypocritically, Littlefinger became angered that the Tullys rejected him, probably for his low social status - when Catelyn's younger sister Lysa Tully was utterly obsessed with him. Petyr, ironically, wanted nothing to do with Lysa, and used her only as a means to an end to get to Catelyn. Later after Catelyn died, Littlefinger transferred his obsession to Sansa. Even though, as he himself noted, Sansa is young enough to be his own daughter, she reminds him so much of the young Catelyn at her age that he forgets himself, even allowing himself to try to kiss her - showing that he didn't really love Catelyn as a person so much as a concept, given that he feels she is interchangeable with her daughter.\n", "In brief moments when Littlefinger has opened up to Sansa Stark, it is revealed that despite his keen skill at assessing the emotions and goals of others and using this knowledge to manipulate them, he has a disturbing, highly warped, skewed view of the world. In Littlefinger's mind, he narrates himself as the hero of his own storybook, as it were: as he says, the weak boy from a minor family who hoped that in a better world, \"love could overcome strength and duty\". He genuinely feels (or seems to feel) that he is the victim in all of this, despite the fact that he was the one who orchestrated the entire War of the Five Kings - a war in which tens of thousands of soldiers and civilians have died. Littlefinger nonetheless believes he is the victim of the uncaring forces of a stratified aristocracy that prevented him from marrying Catelyn - when in reality, Catelyn herself was simply never romantically interested in him, regardless of his social status.\n", "Petyr's surprising lack of insight when it comes to his romantic obsessions was revealed when he encountered Catelyn again in Renly Baratheon's army camp after her husband's execution, a betrayal which Catelyn by now would surely have known he was at least partially complicit in. Instead, Petyr started babbling nonsensically to Catelyn that \"fate\" had granted them the opportunity to finally be together now that Eddard was dead - even though he previously saw that they were deeply in love, and any sane man would realize that she would be both deeply in mourning for her husband, and have reason to be suspicious that he had something to do with his death. Littlefinger's stalker-crush extended to the point that even after years of bitterly hating the Tullys and Starks, and even hating Catelyn at times for rejecting him, at other times he would persist to indulge in fantasies that one day she would come running into his arms.\n", "Some men, such as Varys, engage in court intrigue and murder because they feel they are doing what they must to ensure safety and order for the realm as a whole. Other men, such as Tywin Lannister, engage in court intrigue because they want to secure more power for themselves and for their family legacy. Meanwhile, Baelish does these things just because he can: he enjoys exerting power over other people. Sometimes this can take the form of outwitting or outmaneuvering major court players such as Varys or Cersei - even Tyrion Lannister enjoyed the challenge of \"the game\". Yet Littlefinger also enjoys crushing the powerless when he thinks he can get away with it. Baelish's acquisition of multiple brothels sums up a major aspect of his personality: he is willing to use other people, often vulnerable and weak people (i.e., prostitutes), purely for his own gain (cynically selling his whores' sexual services, or even their lives, for gold), while at the same time using the weaknesses of his enemies as leverage (i.e., blackmailing them about their visits to his brothels). Sometimes Baelish doesn't even use people for any actual purpose, but simply because he enjoys destroying them like a man swatting a fly.\n", "Despite his ingenious planning and manipulation, Baelish is not incapable of making mistakes, nor is he above overplaying his hand if he is convinced of the superiority of his position, political or otherwise, which is a direct contrast to Littlefinger's usual meek and cautious nature, proving himself not above arrogance. The first mistake was when he subtly made a jab at Cersei about her unnatural relationship with her brother Jaime, that knowledge is power, which resulted in Cersei nearly having him killed before deciding to remind him of his place. Another fatal flaw Baelish has is underestimating people. He remarked to Varys that Tyrion is an unworthy ally, seemingly underestimated Ramsay Bolton's vile nature, wrongly believed that the North would not rally behind a \"motherless bastard\" like Jon Snow, and was initially skeptical of Bran Stark's omniscience as the new three-eyed raven, the last of which led to his death.[45]\n"], "quotes": [["\"Littlefinger was born with no lands, no wealth, no armies. He has acquired the first two. How long before he has the army? Perhaps you'll laugh, but I know him better than most, and this is the truth. Littlefinger is one of the most dangerous men in Westeros.\"", "―Varys, regarding Littlefinger to Olenna Tyrell[src]"]], "figure_captions": []}