{"id": "Qyburn", "name": "Qyburn", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Qyburn", "personality": ["Externally, Qyburn appears to be an extremely harmless, polite and serene old man - he behaves calmly and patiently around everyone he meets, even if they do not have a good impression of him. Jaime viewed him as an \"odd little man\" and didn't entirely trust him, even when Qyburn operated on the wound left by his severed hand. Qyburn has proven himself to be, in his own right, highly intelligent to a fault, so much that he was the only one who knew a way to save Ser Gregor Clegane after he was savagely wounded by Oberyn Martell during their fateful duel in the trial by combat. When Qyburn expressed that he knew a way of saving Gregor, he did so without bragging, instead that it was a matter of fact, which Pycelle interpreted as arrogance and pride. Qyburn is, at the same time, extremely secretive, not truly revealing the methods he used to save the Mountain, instead expressing that the process would change Gregor, but not weaken him, and make him supremely obedient to Cersei. Qyburn doesn't seem to express any outward disdain towards Ser Gregor for almost killing him at Harrenhal, but then again Qyburn rarely expresses disdain for much of anything - Qyburn goes so far as to call Gregor his friend while the man is undergoing his experiments. It is therefore unknown whether Qyburn suggested he experiment on Ser Gregor out of revenge or if he simply did so in the interest of his constant pursuit of knowledge.\n", "In spite of Qyburn's soft and calm exterior, he is potentially a very dangerous man because of his secretive, ruthless and unethical methods. The Citadel once expelled Qyburn on the basis that the experiments that he enacted were unnatural and unacceptable, which Qyburn deemed foolish. Pycelle scorns Qyburn for this, naming him an embarrassment to the Citadel. Qyburn maintained his loyalty to Cersei and carried out any task she set for him, but it is unspecified if he had personal reasons or if he was simply loyal to Cersei. Qyburn was quick to end the interference of Pycelle in Cersei's plots by having him assassinated by his little birds. In spite of this, Qyburn expressed that he himself didn't have any personal grievances towards Pycelle and even told the old man that the necessity of murdering him pained Qyburn - this shows that Qyburn does not have sadistic or murderous intentions, but simply saw the act of killing the old Grand Maester as utterly necessary to consolidate Cersei's power. However, none of these factors prevented Qyburn from having a look of cold satisfaction on his face as he watched his little birds overwhelm Pycelle. This satisfaction was also shown when he witnessed Gregor Clegane ripping a man's head off during a showdown with the sparrows, showing that Qyburn is capable of taking satisfaction from his work and his actions.\n", "In terms of how efficient he is as Cersei's right hand man, Qyburn is actually impressive in that he hasn't changed loyalties at all since rising to this position; he has striven to serve Cersei's interests, good or bad, to the end, and notably is the first to comfort her in the tragic aftermath of her walk of atonement. He has proven also that he is surprisingly resourceful in his own right: His scorpion is, however briefly, a good asset to Cersei's war against Daenerys Targaryen, managing to severely injure Drogon, who is ultimately able to destroy it. Qyburn's curious and clever nature is also shown when he is actually intrigued by the sight of the wight brought to the Dragonpit, calmly observing the severed hand of the creature.\n", "\n"], "quotes": [], "figure_captions": []}