{"id": "Ramsay_Bolton", "name": "Ramsay Bolton", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Ramsay_Bolton", "personality": ["Ramsay is a genuine sociopath.[26] He seems to be the personification of pure evil, with no redeemable features. He is dishonorable, manipulative, ruthless, extremely sadistic, sexually depraved, wild, and completely capable of committing unspeakable atrocities without remorse, simply for pure amusement. Ramsay fully admits—and indeed revels in the fact—that he tortures and kills innocent people for no reason whatsoever, and that they did not deserve what he did to them. He simply enjoys inflicting horrific torture on people.\n", "Whenever he has the advantage in a skirmish, Ramsay is fearless—almost a beast in human skin—reveling in the violence of personal combat.[11] This is the polar opposite of Joffrey Baratheon's cowardice. Ramsay did not rave and rage, however, he had a perverse, playful, childlike giddiness as he inflicts pain on others, from flaying men alive to hunting and killing girls for sport. This behavior, however, was not displayed when Jon Snow proposes that the two of them fight one-on-one rather than send thousands to their deaths to determine who holds sway over The North. Ramsay scoffs at the idea due to his initial numerical superiority, and also strikes anger in Jon and Sansa's hearts by having Smalljon Umber drop Shaggydog's head in front of them to display his power over them mentally and physically. Only when Jon and his allies breach Winterfell thanks to the arrival of the knights of the Vale, does Ramsay reconsider fighting one-on-one against him, choosing a bow and arrows as his weapon but only because he knew he would be quickly killed if he chose to attack the surrounding soldiers whereas he had a better chance of surviving but fighting Jon one-on-one.\n", "In his own twisted way Ramsay was actually quite intelligent, possessing a certain \"low cunning\" with which he tricked his enemies. He was particularly good at thinking on his feet, but reckless when it came to long-term consequences and intricate politics. Ramsay deeply enjoyed playing mind games with his enemies using psychological torture, often tricking them into trusting him only to then break his empty promises. A good display of Ramsay's deceitful tact was when while playing a \"game\" with Theon Greyjoy to guess where he was, who he was, and why he was being tortured, he allowed him to believe his guesses were correct until he pointed out that Theon \"forgot to ask if he was a liar\" and continued to flay his finger anyway. Another instance is using Rickon Stark as bait to \"trap\" Jon in the middle of the battlefield at the Battle of the Bastards, knowing that his family-loving nature would leave him defenseless to arrow attacks.\n", "On the other hand, Ramsay is very impulsive, not fully considering the long-term consequences of his actions much to his father's chagrin. When Lord Medger Cerwyn refuses to pay Ramsay taxes or even acknowledge Bolton rule, Ramsay flays Cerwyn alive along with his wife and brother while forcing his son to watch, and puts the corpses on public display. Roose angrily warns his son that this disproportionate brutality is severely damaging their long-term position but Ramsay largely ignores his warnings, instead privately holding a massive feast for himself even as other lords are worried about stockpiling provisions for the winter. In addition, he kills his father, stepmother, and half-brother for his own gain even though he has yet to produce an heir, a selfish, short-sighted, downright stupid action that eventually dooms House Bolton.\n", "Ramsay is greatly frustrated by his bastard status, and was easily angered when he was referred to in such a way. A possible source of this resentment was his jealousy of Jon Snow, another Northern bastard son who was raised by his father, Ned Stark, alongside his trueborn sons and eventually rose to become Lord Commander of the Night's Watch, and as such, Ramsay desired to rise to a powerful political position as Jon did, which he himself states to Sansa by comparing himself to Jon. Ramsay's jealousy of Jon was so much that he expressed a willingness to kill Jon if the chance comes, though at the same time appears fearful when he hears that Jon may come after him with a wildling army. Due to his immense insecurities about his baseborn status, Ramsay makes it a point to mock and belittle Jon for being a bastard—continuously referring to him as \"bastard\" in both a letter he sends to him at Castle Black, and in person when they finally meet, despite the fact that Ramsay is initially a bastard himself.\n", "Due to having played mind games and tortured helpless and defenseless victims and getting away with it all his life, Ramsay is not used to the possibility of losing a confrontation. Even while being beaten almost to death by Jon, Ramsay smiles with confidence that somehow he will survive, and even displays this behavior when faced with his hungry hounds, who he staunchly believes will never harm him. However, when one of the dogs disobeys his commands to get off him and starts hungrily licking his face, Ramsay's commands get more desperate, and for the first and last time in his life, Ramsay shows genuine fear when he realizes he can't control them and won't survive after all.\n"], "personality_quotes": [["Jon Snow: \"I've fought beyond the Wall against worse than Ramsay Bolton. I've defended the Wall from worse than Ramsay Bolton.\"\n", "Sansa Stark: \"You don't know him.\""]], "figure_captions": ["Ramsay demonstrates his fearlessness in the face of ironborn warriors."], "quote": ["If you think this has a happy ending, you haven't been paying attention.", "―Ramsay to Theon Greyjoy", "The Climb"], "description": "Lord Ramsay Bolton, born Ramsay Snow, was the legitimized bastard son of Roose Bolton, Lord of the Dreadfort, and the unidentified wife of a miller.\n"}