{"id": "Rast", "name": "Rast", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Rast", "personality": ["Rast is a former raper who was offered the choice between joining the Night's Watch or facing castration, choosing the former. True to this criminal nature of his, he mercilessly preys those weaker than him, but often finds himself crumbling before those who could overpower and kill him. When Jon trains his fellow recruits in swordsmanship, Rast jumps at the opportunity to bully the overweight and defenseless Samwell Tarly on Alliser Thorne's orders, stopping only when he is threatened by Jon, Grenn and Pyp with dire consequences if he touches Sam again.\n", "Despite these traits, Rast is not without scruples, and tries to form genuine friendships with like-minded individuals. Even though he has contempt for Sam for his cowardice and for surviving the Battle at the Fist of the First Men when braver rangers fought and died, he tries to become friends with Sam's friends Grenn and Dolorous Edd. He likes Grenn and Edd enough to urge them to leave the exhausted Sam behind since he thinks they will all die of hypothermia if they do not but does not go on ahead of them even though he has the chance. After his fellow ranger Bannen dies of starvation at Craster's Keep, he angrily stands up to Craster for gorging himself on food they brought him and not sharing with them. The Lord Commander's continued insistence that they honor guest right eventually leads to Rast stabbing him in the back.\n", "Unfortunately for Rast, the fellow mutineers who shared his ideals had no interest in being friends with him. While he still got to abuse Craster's daughter-wives and Hodor, he was little more than a servant in the new hierarchy he found himself in. He was forced to follow the orders of the more dangerous Karl under threat of death. As the Raid on Craster's Keep turned in favor of the loyalists, Rast tried to flee only to be mauled by Ghost. Ultimately, he was a cruel bully and coward right to the very end.\n"], "quotes": [], "figure_captions": []}