{"id": "Renly_Baratheon", "name": "Renly Baratheon", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Renly_Baratheon", "personality": ["Renly was established to have an extremely strained relationship with his two brothers, Robert and Stannis. The long-ridiculed youngest brother, originally Renly saw no hope of ever becoming king as there were too many heirs with claims better than his for the Iron Throne. With inspiration from his lover Loras Tyrell, however, Renly arrogantly flouted the line of succession and declared himself king ahead of Stannis after Robert died. However, his strained relationship with his brothers didn't prevent him from complimenting Robert behind his back that he used to be good at killing and showing concern when he was mortally wounded by the boar. Renly also claimed to have once loved Stannis after their final encounter, making him the only brother to say as much about one of the others whereas Robert openly stated he never loved either of them. Stannis pretty much says the same about Robert but claims to grieve for Renly in a way after he murders him. However, Stannis does not show genuine remorse for the act until after he is defeated at the Battle of the Blackwater.\n", "Unlike his other brothers, who undoubtedly would make bad kings but were skilled in battle; Robert, a fierce warrior but incompetent king, and Stannis a proven battle commander but unmerciful lord, Renly never raised a sword in combat. Adding to this, he used to become uneasy around violence and blood, throwing up when a knight was maimed after jousting and even after Loras cut him to prove a point, Renly was still squeamish and treated it as if it was a mortal wound. According to him, all he heard about from Robert was how he was never \"tough\" enough, and came to resent the idea that good soldiers automatically make good kings, which was seen when Ned Stark attempted to reinforce Stannis as the rightful heir. He disregarded the fact that a king, while having to be charismatic and peaceful, also had to be legitimately strong, which his brothers were on account of being respectively skilled warriors and commanders.\n", "Despite his lackluster on the battlefield, Renly was skilled in politics. He became a member of Robert's small council while he was alive and forged a marriage alliance with House Tyrell to support his claim for the Throne, gaining more bannermen and strengthening his army by marrying Margaery Tyrell. At the same time however, the prospect of a marriage alliance was to create a line of children, which he was was unable to do on account of his homosexuality until Margaery reformed that their marriage was only on paper. Renly was patient; for all of his zeal to obtain the title of king he was capable of waiting until Robb Stark had weakened the forces in King's Landing and take control later on. He also had some understanding of warfare tactics and planned to take Joffrey hostage after learning of his true parentage to weaken House Lannister so there would be no opposition for his titles. He was also very receptive to an alliance with the Starks and the Tullys (as he sympathized with them over the execution of Ned Stark) although he made such an alliance conditional to them swearing fealty to him as King; unlike Stannis, however, he wisely did not threaten them with retribution for not submitting, recognizing that it was Joffrey's threats and killing of Ned that had made them rebel in the first place.\n", "For all of his ambitions, Renly only attempted to assist his own claim and never neutralized those against him. He relied on Joffrey's illegitimacy, made aware by Stannis who also fought for the Iron Throne to support his right and never attempted to demoralize Stannis to his army even though, in the eyes of the Seven Kingdoms, Stannis possessed the most solid claim in comparison to Renly. He relied on his charisma and popularity for the support of his troops rather than propaganda, and disregarded the royal line of succession in favor of the rightful ruler being the best suited, which was automatically him in his opinion. Renly was also a tolerant man, as he allowed Brienne of Tarth to join his Kingsguard, whereas many scorned her for her gender and lack of virtue. In addition, Renly was legitimately kind to Brienne, saving her from scorn when they first met and comforting her, and voicing to Loras that he appreciated her devotion to him.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["He inspires no love or loyalty. He's not a king. I am.", "―Renly Baratheon declares he would be a better king than his brother, Stannis.", ""], "description": "King Renly Baratheon was the youngest of three brothers and thus fourth in line to inherit the throne after Joffrey, Tommen, and Stannis. He was granted the title of Lord Paramount of the Stormlands by his brother Robert, whose small council he also served on as Master of Laws, but abandoned the latter position when laying claim to the Iron Throne, styling himself as Renly of the House Baratheon, First of His Name, King of the Andals and the First Men, Lord of the Seven Kingdoms, and Protector of the Realm. Margaery Tyrell became Renly's queen when she married him in an alliance; however, it was her brother Loras whom he truly loved. During talks of an alliance with the Starks, his reign abruptly ended when a Shadow with the face of Stannis Baratheon killed Renly inside his tent. This led most of his bannermen from the Stormlands and some of the Reach to submit to his older brother Stannis as their new king.\n"}