{"id": "Rhaegar_Targaryen", "name": "Rhaegar Targaryen", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Rhaegar_Targaryen", "personality": ["According to those who knew him, Rhaegar was a wise, kind, and well-educated man, greatly loved in the Seven Kingdoms before his alleged abduction of Lyanna Stark. He was everything that could be hoped for in a future king, and very popular with lords and commoners alike - in contrast to his increasingly erratic father. Aerys's descent into insanity and paranoia greatly troubled Rhaegar, which resulted in Rhaegar frequently brooding on his inner turmoils. Rhaegar's honor and intelligence made him very charismatic, earning him the genuine support of his followers. Neither Rhaegar's allies nor his enemies could ever explain in later years why such a promising young prince would suddenly abduct Lyanna Stark, as it didn't seem in his character.\n", "Despite the superb skills he displayed while participating in the great Tourney at Harrenhal, Ser Barristan Selmy (whom Rhaegar had unhorsed in the final joust) described Rhaegar as a peaceful man who much preferred singing over fighting and killing. He was highly skilled at playing the harp as well, and would often go out into the streets of the capital city disguised as a common minstrel to play and sing for passers-by.\n", "Rhaegar's sorrow at the behavior of his father (and his treatment of Queen Rhaella) gave him compassion for the suffering of others. When he went out to sing in Flea Bottom, he would usually give away any money he had earned from it - sometimes to the next minstrel on the street, or to an orphanage (one time he used it to get very drunk with Barristan, though that might also be an example of him treating his friends well).\n", "After the Baratheons overthrew the Targaryens in Robert's Rebellion, history became biased in favor of the victors: Rhaegar became remembered as a villain second only to his insane father the Mad King, and people believed Rhaegar brutally abducted and raped Lyanna Stark and left her for dead. Even the Martells, who weren't sure what happened with Lyanna and didn't specifically care, were still upset that in either scenario, Rhaegar left Elia for another woman and dishonored Dorne. Had the Lannisters not butchered Elia Martell and her children by Rhaegar, the Martells might have kept that view, but the Lannisters' needless brutality drove a wedge between Dorne and the new Lannister-funded Baratheon regime in King's Landing. Targaryen loyalists, meanwhile - such as Rhaegar's own younger brother Viserys, in exile - developed their own skewed remembrance of events, that Rhaegar was the perfect Crown Prince, a tragic figure, and Robert was the villain of their story, seizing the throne from the rightful rulers and murdering the true heir.\n", "Ultimately, Rhaegar still remains a controversial and perplexing figure as his star-crossed romance with Lyanna Stark inadvertently led to his insane father sparking a war with half of the Seven Kingdoms. Thousands died due to Rhaegar's actions (or inaction), ending in his death, the overthrow and exile of what was left of his family, and (indirectly) resulted in the murder of Elia and their two children together.  What could possibly have motivated Rhaegar to not only elope with Lyanna, but fight a war to keep their marriage a secret, remains unknown. Rhaegar valued his forthcoming child with Lyanna so much that he even left champions of his Kingsguard behind in Dorne to defend her - living legends who could have tipped the balance if they had fought by his side at the Battle of the Trident.\n"], "personality_quotes": [["Barristan Selmy: \"Viserys never told you?\"\n", "Daenerys Targaryen: \"He told me Rhaegar was good at killing people.\"\n"]], "figure_captions": [], "quote": ["Rhaegar fought valiantly, Rhaegar fought nobly. And Rhaegar died.", "―Jorah Mormont", "Walk of Punishment"], "description": "Prince Rhaegar Targaryen, the last Prince of Dragonstone, was the eldest son and heir to King Aerys II Targaryen, the Mad King. He was the older brother of Viserys and Daenerys Targaryen and the husband of Elia Martell, with whom he had two children: Rhaenys and Aegon Targaryen.\n"}