{"id": "Robb_Stark", "name": "Robb Stark", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Robb_Stark", "personality": ["Robb had a surprisingly keen mind for warfare and strategy, a trait that takes Tywin Lannister completely by surprise. Tywin had originally seen Robb as a stupid child who hadn't the slightest idea of the violence of war and after his first taste of battle would \"run back to Winterfell with his tail between his legs.\" The Lannisters were quite surprised when Robb led a stunning surprise attack in the Battle of the Whispering Wood to crush the western half of the Lannister armies under Jaime. Tywin also did not expect Robb to have the determination to send hundreds of his own men to their deaths in a feint to the east. Sansa Stark mentions to Joffrey Baratheon that Robb is known to fight with his army's vanguard and commands his forces where the fighting is thickest. As such, Robb's tactical prowess and bravery in battle results in the Northerners seeing Robb as a larger than life figure and he is quickly known as the \"Young Wolf\" for his ferocity in battle. Robb's actions create lore throughout the Seven Kingdoms that tell tales of him riding his direwolf into battle and even transforming into a wolf himself. Tywin Lannister mentions to his war counsel at Harrenhal that Robb's men worship him and that he doubts Robb will lose unless drastic measures are taken to ensure this.\n", "Robb was very much his father's son, but this meant that he had not only his father's strengths, but also his father's weaknesses. Like Eddard, Robb lacked proper political skills and had a tendency to put honor before reason. He married a political nobody out of love, needlessly spurning a badly needed political alliance with the Freys. Robb also put honor before pragmatic political needs when he executed Lord Rickard Karstark for treason and murder, costing him the Karstark contingent from his army. Like most Northerners, Robb was more proficient as a warrior than as a politician. Much like his own father, Ned Stark, and the man he was named after, Robert Baratheon, Robb Stark was an excellent warrior and military commander but a poor politician.\n", "Roose Bolton viewed Robb as both arrogant and foolish, and Walder Frey considered Robb's title as the Young Wolf to be a show of pomposity. Despite this, Robb was overall viewed favorably as good man. He was mourned profusely by Sansa, Jon and Theon once they heard the news. Even Tyrion Lannister commented to Sansa that Robb seemed like a good man to him. Others high lords and ladies such as Stannis Baratheon, Olenna Tyrell, and Randyll Tarly viewed the way Robb was murdered to have been absolutely detestable.\n"], "quotes": [["Cersei Lannister: \"Robb Stark is a child.\"\n", "Tyrion Lannister: \"Who's won every battle he's fought!\""]], "figure_captions": []}