{"id": "Robert_Baratheon", "name": "Robert Baratheon", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Robert_Baratheon", "personality": ["Robert Baratheon, as a young man, possessed the typical talent for warfare and leadership as his brothers, as expected of Baratheon men. He was a charismatic and fearsome military commander and a formidable warrior, shown by his famous defeat of Rhaegar Targaryen on the Trident, pending the death of Aerys Targaryen.\n", "Robert was considered a very good man at heart, and he ultimately was, but people often couldn't see this because externally he appeared to be a brutal, heavy-drinking party animal. He had a fondness for strong drinks, women, tourneys and for extravagant parties, which he heavily immersed himself in after the end of his Rebellion against the Mad King- perhaps to drown his grief over having lost Lyanna. People often commented derogatorily that he was a drunken fool, and failed sometimes to see past his powerful temper.\n", "Admittedly, however, Robert proved to be a poor peacetime ruler; a soldier more than anything else, he understood nothing about administration, frequently ignoring the sound advice his Small Council gave him. His behavior in \"A Golden Crown\" underscores his incompetence as a king: he should have used his authority to put an end to the mutual hostilities between the Starks and Lannisters, before the situation got out of control; instead, he just ordered Ned - not very firmly - to have Tyrion released and to make peace with Jaime, then left the capital for his entertainments. \n", "Robert showed some good judgement by choosing Jon Arryn and later Eddard Stark as Hand, but then unintentionally undermined their good administration with his reckless spending on luxuries and entertainments, which eventually bankrupted the Seven Kingdoms and forced him to take loans from the Iron Bank of Braavos and the Lannisters. It is worth noting that the two men he selected as Hand were two men who had been extremely close to him, whom he trusted, as opposed to men like Tywin Lannister, who would have been an extremely effective, if unapologetically ruthless Hand. Thus, Robert isn't completely prone to errors of judgement. Also, he expressed a certain amount of charisma when he met Ned's children at Winterfell, complimenting Sansa's beauty and even playfully suggesting that Bran would be a soldier. He also showed a good sense of humor in remarking that Ned had 'gotten fat', before raucously laughing when Ned silently indicated that he had done too.\n", "Robert's relationship with Eddard Stark brought out the better side of Robert. Since he did not have a particular fondness or relationship with either one of his actual brothers, he considered the Stark lord a surrogate brother. Ned was the only person who could genuinely counsel Robert on any subject, and the only person he appeared to want to listen to, since he seemed extremely impatient with anybody else, especially his wife (something he didn't make any attempt to hide). Robert trusted Ned deeply and had a very strong sense of empathy and reason for him, assuring him that he only asked Ned to be Hand because he needed him - Robert openly told Ned that he was a loyal friend, showing his extreme admiration of Ned's character. In addition to this, Robert had a deep personal love for Lyanna Stark, Ned's sister, and often lamented about her death, but this lamenting often gave way to Robert intensely tirading about his hatred for the Targaryens - he called Rhaegar Targaryen a monster and scorned him as he believed that he had raped Lyanna, and even after he had vanquished Rhaegar on the Trident, his brutal hatred of the surviving Targaryens. Robert's love for Lyanna went to such a vast extent that, on their wedding night, he visited Cersei in their bed (critically drunk) and openly mistook her for Lyanna, showing that he was unable to accept that Lyanna was apart from him. It is worth noting that Robert's first priority once he arrived at Winterfell was to visit the crypts of Winterfell and pay his respects to Lyanna's tomb, even though he, his family and entourage had been riding for ages and he could have paid his respects at any time.\n", "Despite plunging into the temptations of drinking, feasting, gambling and suchlike, Robert Baratheon was not a stupid man in some respects. Even years after his climactic rebellion and his famous defeat of Rhaegar Targaryen and later the ironborn, Robert still had a sound mind when it came to military matters; he was still able to precisely recite the strategies of the Dothraki if they invaded and provided statistical arguments as to why the Dothraki, with Viserys Targaryen as the figurehead, would eventually gain the upper hand. He was also able to recognize and lament for his mistakes, and apologized to Joffrey that he had never been a particularly good parent. Also, on his deathbed, he begged for Eddard to help him in some way that Robert himself had been unable to, and finally let go of his hatred for the Targaryens when he asked Eddard to do what he could to protect Daenerys Targaryen from being assassinated, accepting that she did not have to suffer for her father and brother's actions.\n", "Robert had a tendency for being cruel or harsh towards Jaime Lannister, referring to him personally as Kingslayer (even though it was Aerys Jaime had killed, enabling Robert to take the throne) and laughingly mocking his status as Tywin Lannister's son forced to guard his extravagant king. He also had the gall to mock Jaime's execution of the Mad King, only to be shocked into silence when Jaime coldly reminded him of Aerys's madness. Robert could be smug, and arranged for Jaime to be on guard when Robert was entertaining his whores, knowing that Jaime (closer than anyone to Cersei) would be aware that this was a vicious insult. However, Robert at least suggested out loud to Eddard Stark that he would even consider naming Jaime as Hand if Ned refused to retake the position. He was also emotionally abusive toward Cersei and had physically struck her at least once, though he did feel remorse about it, saying it wasn't a kingly thing to do.\n"], "quotes": [], "figure_captions": []}