{"id": "Roose_Bolton", "name": "Roose Bolton", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Roose_Bolton", "personality": ["Roose Bolton is cautious, intelligent, ruthless, and easily capable of unspeakable cruelty. He has a very calm and calculating personality, never publicly expressing anger, happiness, or sadness. Politically astute, he frequently offered the most pragmatic advice to Robb Stark, albeit the most ruthless, such as recommending that they put prisoners to the sword because they were having difficulty feeding them all. However, despite his ruthlessness, Roose appears to follow a code of honor to a certain degree since he frequently opposes the needless, cruel deeds performed by Ramsay and his men, and outright shoots down Ramsay's suggestion to murder Jon Snow, since Jon is both a bastard and the Lord Commander of the Night's Watch. He appears genuinely shocked and saddened upon seeing the massacred Northmen at Gregor Clegane's hands at Harrenhal, hinting that he abhors needless violence and cruelty, and seems to do his best to offer his condolences to Rickard Karstark, referring to him as \"my friend\" and promising that his sons will be avenged.\n", "When he realized that Robb Stark had no chance of winning the war, he sought an alliance with House Frey and House Lannister. Roose's cold realism clashed with Robb's idealism. When all seemed lost, he did not attempt to fight for a losing cause and instead decided to safeguard his family's future by turning on his king. Similar to Tywin, Roose valued the legacy of House Bolton as something bigger than himself.\n", "Roose was a cunning strategist, both on and off the battlefield. His betrayal was sudden and unexpected, and it resulted in the utter decimation of the rebellious Northern lords and their armies while his own forces remained basically intact. This would allow House Bolton to overpower the now defenseless home territories of these other Houses in the North, ensuring Bolton rule.\n", "Unlike Robb Stark, he believed that he wasn't a lord to indulge his own petty whims and that strengthening his House was his first priority: in that context, he married Walda Frey to guarantee his alliance with House Frey. As a result, Roose was somewhat critical of Ramsay's more wild or shocking actions, because as Roose's only heir, Ramsay represents the future of House Bolton. Roose did enjoy sadistically toying with other people - as seen when he briefly taunted Jaime Lannister that King's Landing might have fallen to Stannis Baratheon - but a major difference between him and Ramsay is that Roose had caution enough to only partake in such amusements when he thinks he can get away with it. Roose was also cautious enough to realize that, despite his success in elevating House Bolton as a Great House of Westeros, this position is fragile and that only proper alliances would allow him to retain his power. This was the main reason behind his decision to marry Sansa to Ramsay and his willingness to consider an alliance with Littlefinger and the Lords of the Vale after Tywin's death.\n", "Despite his cruelty, he did have some form of affection for his children, and seemed pleased and possibly happy when his new son's birth was announced by Maester Wolkan. He also seemed to care for Ramsay to an extent, but overall mistrusted him.\n", "For all his caution while dealing with his enemies, Roose ironically fails to see the threats to his claim (or even his life) right in front of him. Despite knowing of Ramsay's impulsiveness and insanity, Roose frequently mistreats Ramsay by reminding him of his bastard status and implying that he will disinherit him despite his legitimization by publicly announcing that he is expecting a trueborn child, right in Ramsay's face, all of which ultimately led to Roose's death by his own son's hands. This also somewhat echoes Tywin's fate, as he was also killed by his own son, though Roose's case is more extreme, as he knew what kind of person Ramsay was but made no attempt to protect himself. However, Ramsay's unwillingness to follow Roose's cautious and practical advice ultimately led to his own downfall not long afterward, as well as House Bolton's extinction. In a twisted sense of irony, Roose's actions to elevate House Bolton's status and legacy instead led to its annihilation.\n"], "personality_quotes": [], "figure_captions": ["Roose Bolton taunting Jaime Lannister."], "quote": ["In my family we say, 'A naked man has few secrets, a flayed man, none.'", "―Roose Bolton", "Garden of Bones"], "description": "Lord Roose Bolton was the Lord of the Dreadfort and the head of House Bolton, the former ruling Great House of the North after usurping the position from House Stark. He was the father of Ramsay Bolton – his legitimized bastard – and an unnamed newborn baby from his wife, Walda Frey.\n"}