{"id": "Samwell_Tarly", "name": "Samwell Tarly", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Samwell_Tarly", "personality": ["On the outside, Samwell Tarly may appear completely antithetical to the standards of his house - he is extremely timid, awkward, cowardly, nervous and easily frightened. When he was first tested in combat by Alliser Thorne, he didn't even pick up a weapon and allowed himself to be beaten, terrified, leading to the impression that Sam was worthless (an impression that Randyll Tarly had never allowed him to forget). However, in reality, Sam is actually a good man - he is extremely loyal to those who show him kindness, as evidenced by his almost brotherly relationship with Jon Snow, who remained his best friend throughout his time as a member of the Night's Watch. His loyalty to Jon would resonate from the moment that he volunteered to take Jon's vows with him. His extreme personal loyalty is potentially one of his best qualities, and ironically evidence that Sam aligns with the expectations of his house - after all, House Tarly breeds soldiers, and soldiers are supposed to be loyal.\n", "When he comes to Castle Black, it is quickly realized that he is not a great warrior, but Sam makes up for it considerably by being highly intelligent and observant. He shows himself to be so insightful that he assures Jon Snow that Lord Commander Mormont is seeking to groom him for command based on the duties that being a squire would entail. Sam has an encyclopedic knowledge of Westerosi history, including the history of the Night's Watch, and is deeply fascinated by that history, to such an extent that his fellow sworn brothers often find him annoying for it. Even Jeor Mormont recognized Sam's intelligence and commended him for it. Those who could see through Sam's glutton and cowardice would realize how clever and valuable a person he was. Sam loves to read books at any given opportunity, so much that that the blind Maester Aemon easily deduced that Sam had come to see him, based on the fact that he had decided to enter the library at night to read.\n", "Throughout the series, Sam has shown himself to be capable of incredible bravery when he is pushed. While he cowered during the Battle on the Fist of the First Men, especially when he encountered a White Walker for the first time. One of his shining moments came when he faced off against another White Walker when it tried to attack Gilly and her son - Sam's extreme capacity for love towards Gilly compelled him to continue to attack the creature, even after it easily overpowered him already, and in spite of Sam being aware of the historical reputation of the White Walkers and how they had decimated the Rangers at the Fist of the First Men. Sam later proved himself to be gradually immune to the bullies that he had suffered most of his life, as evidenced by how he shamed Janos Slynt for his cowardice when the latter tried to shame him for loving Gilly. Sam's bravery wavered temporarily when he returned to Horn Hill and was chastised by his father Randyll again, so much that he was unable to speak throughout most of the conversation, but later on he openly defied his fearsome father by stealing the family heirloom Heartsbane and verbally daring Randyll to try and take it back (albeit, not to his face).\n", "Sam was very good friends with Maester Aemon, so much that Sam gave the man's eulogy at his funeral and didn't condemn him for being a Targaryen. Before Aemon passed away, Sam showed reluctance to believe that he was dying, showing that he deeply cared about the old man.\n"], "quotes": [], "figure_captions": []}