{"id": "Sandor_Clegane", "name": "Sandor Clegane", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Sandor_Clegane", "personality": ["The Hound is seen as a violent, aggressive and brutal man, with a fatalistic view of the world. He is a formidable warrior and he doesn't hide his love of killing people, believing all men love it, and he generally hates soldiers who try to convince themselves otherwise. However, he also displays small hints at being a reasonably affectionate and compassionate man underneath, particularly in response to Joffrey's treatment of Sansa. This is largely a result of his disgust at the brutality of his older brother Gregor: the respect and knighthood given to Gregor for his extreme brutality left Sandor thoroughly disillusioned that honorable men succeed in the real world the way they do in romantic songs. His growing disgust at Joffrey's sadism and concern for both of the Stark girls, however, show that he is not yet so cynical that there are no moral boundaries he wouldn't cross.\n", "There were a few times when Clegane showed visible signs of hating Joffrey, such as when he orders Sansa Stark to be stripped and beaten by Ser Meryn Trant. The Hound was the first to offer Sansa a cloak to cover herself after Tyrion ordered the spectacle to stop. His affection for Sansa is also demonstrated at the Battle of Blackwater when he offers to take her back to Winterfell, which she declines. He also seems intent on lecturing her about killers such as Joffrey, Tywin, and even her brother Robb Stark, trying bluntly to inform her about how brutal the world really is. This was not the only time he showed something that bordered on compassion: he was brave enough, during the Hand's Tourney, to stop his brother Gregor (a man he hates beyond any calculation) from needlessly butchering Loras Tyrell.\n", "Despite having initially a captor-prisoner relationship, Sandor becomes protective and even trusting of Arya. During their journey to the Eyrie, Sandor slowly opens up to Arya, and tells her how his own brother burned half of his face. He tells her that the worst part wasn't the actual pain, but the betrayal that his own brother did it, and that his own father covered it up by telling everyone that Sandor was burned by some bedding that caught fire. He points out that while Arya thinks she's alone because most of her family is dead or missing, he is even more alone, because at least while Arya's parents were alive they cared about her, unlike his own family. When the pair meet Brienne of Tarth he immediately becomes aggressive and protective of Arya even saying that he is the one who watches over her, implying a significant bond has grown between them, this is reflected later on when Arya tells the Waif that she had taken him off of her list.\n", "After his near-death experience, Sandor becomes more reflective of his actions and many of Septon Ray's teachings resonate with him, helping him to develop an aversion to unnecessary violence and a desire to live in a peaceful, contributory manner. This is also partly due to Ray's own dark past when he committed heinous crimes at the wishes of others, similar to Sandor during his service with the Lannisters. However, he is still fully willing to fight when the need arises, disagreeing with Ray's notion of not taking up arms if left with no other choice. This is further proven after Ray's murder, where Sandor sought to avenge his slain friend immediately until he reunites with Thoros and Beric. Though he resents Beric and Thoros for their previous encounter, his desire to protect the innocent compels him to join the Brotherhood and to help Jon Snow fight against the coming army of the dead.\n", "Despite having mellowed out somewhat during his stay with Ray and the villagers, Sandor has since reverted to his more cynical and acidic self, swearing and openly insulting his allies in the brotherhood. However, Sandor still retains his guilt and capacity for remorse as upon coming across a farmhouse he recognized, he instantly became reluctant to enter it. Later, he is discovered by Thoros of Myr burying the dead out of guilt for his part in their fate and laments that they deserved better. Tormund Giantsbane, himself a feared wildling chieftain, appears to see the compassion within Sandor by noting he has \"sad eyes\", and asks, though in a bantering way, if his burn scars are the source of his bitterness at the world. Though Sandor reacts with hostility, it is apparent that he appreciates Tormund's concern enough to save him from being killed by wights. He shows some sadness over Thoros's death, and tries to comfort Beric, telling him that freezing to death is said to be one of the better ways to die. He also appears regretful upon seeing Viserion killed by the Night King, and then goes on to save Jorah Mormont from falling off Drogon.\n", "Sandor, despite being proud of being tough and \"hard to kill\" as he once told Ray, held no shame in being defeated by Brienne of Tarth, openly telling Ray when he asked who took him down, that it was by a woman. Upon meeting Brienne again on his way to the Dragon Pit, they exchanged words civilly, both of them explaining that they were just trying to protect Arya.\n", "While Sandor hates his brother to the point of desiring to kill him, when confronting Gregor at the Dragon Pit, he showed a moment of emotion when asking Gregor what was done to him before quickly dismissing it and reminding his brother who was going to end him.\n", "Sandor Clegane shares many traits with his brother, such as his large build, immense strength and toughness, though not to the same extent as Gregor, especially after the latter has been revived by Qyburn. Sandor has shown to be capable of lifting a man clean off the ground by his neck with no visible strain or forward momentum from the weight. After being wounded and slightly crippled from his fight with Brienne, Sandor still possessed strength enough to carry a massive log by himself, whereas the other logs needed four people to carry them.\nSandor is a skilled swordsman but favors heavy strikes and brute force, like his brother he utilizes his sword in a one-handed style. Sandor is also skilled with an axe, able to swiftly kill four men within seconds of each other armed only with a woodcutter's axe. Sandor is at least competently skilled in using a warhammer and daggers, as demonstrated in his battles with the wights.\n", "Sandor suffers from pyrophobia as a result of a childhood trauma in which his own brother forced his face into a fire for playing with his toys. The psychological effect of this has caused Sandor to freeze up in situations that could result in his death such as during the Battle of the Blackwater and his recent quest beyond the wall. Sandor has on at least one occasion, overcome his pyrophobia when he was forced to fight Beric, who was using a flaming sword. By the time of the wight hunt, however, Sandor appears to have overcome his phobia more, as he seemed to show no signs of fear at the fire that Drogon, Viserion and Rhaegal unleashed on the wights to save him and his comrades from the wight army, possibly stemming from Jon Snow's revelation that fire is one of the only two weapons capable of defeating the wights.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["You didn't know me back in my time. You don't know the things I've done.", "―Sandor Clegane to Ray", "The Broken Man"], "description": "Sandor Clegane, nicknamed the Hound, is the younger brother of Ser Gregor Clegane and was the personal bodyguard of Prince Joffrey Baratheon. When Joffrey ascended the Iron Throne as King Joffrey I, Sandor was named into his Kingsguard despite not being a knight himself, but deserted from his post at the Battle of the Blackwater. After traveling as a fugitive with Arya Stark and having a close brush with death, he reluctantly travels with the Brotherhood Without Banners in hope of having a greater purpose. Upon the discovery of the return of the White Walkers and the army of the dead, Sandor now fights alongside the armies of Jon Snow and Daenerys Targaryen in order to prevent another Long Night.\n"}