{"id": "Sansa_Stark", "name": "Sansa Stark", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Sansa_Stark", "personality": ["When she lived at Winterfell with her family, Sansa grew up as the eldest daughter of a Great House, trying to emulate her mother's example of a \"proper lady\" from the southern courts. Sansa's devotion to the traditional, refined \"feminine virtues\" caused friction between her and her blunt, tomboyish younger sister Arya, with whom she had a sibling rivalry. As a little girl, Sansa naively believed in the tales and epic romances in which every princess gets her honorable knight in shining armor to sweep her off her feet. Sansa was infatuated with the traditional romances about mythical figures like Jonquil, and historical figures like Duncan Targaryen. Her greatest goal in life was to be married to a heroic and handsome prince, sitting around with other noblewomen eating lemon cakes while gossiping about the goings-on at court.\n", "Sansa's innocent, childhood infatuation with the ideals of princesses and knights made her tragically susceptible to the manipulations of the Lannisters. She held the blind belief that all queens and princes are kind and truthful, as if inherently a result of their titles, when Cersei just happened to be a woman who married a king to secure a marriage alliance, and Joffrey just happened to be her son. Without real cause, she blindly loved Joffrey with all her heart and trusted and admired Cersei, only for them to repay her love and trust by beheading her father before her very eyes.\n", "Afterwards, Sansa has a harrowing experience as a prisoner of the Lannisters, a plaything for the psychopathic Joffrey to have publicly beaten by his guards for petty amusement. Her shock at the death of her father was only later deepened at the news of how her mother and brother Robb were horrifically killed at the Red Wedding and their corpses desecrated. She was visibly elated upon hearing that Arya, Bran, and Rickon were actually still alive, and though she took mostly after her mother and had a somewhat distant relationship with Jon, she loved him all the same. She was surprised to hear that Jon had become Lord Commander of the Night's Watch, and Jon was the first person she turns to for shelter after escaping Winterfell, aware that he would protect her from Ramsay.\n", "Sansa subsequently escapes King's Landing to the Vale with Littlefinger, and her experiences have clearly changed her personality. She had to learn from painful experience how to lie to survive at Joffrey's court, saying one thing but meaning another and manipulating people to her own ends as best she could. No longer under constant control by Joffrey and Cersei's guards, she is in her own way beginning to mature into her own power and influence as a political force.\n", "The numerous tragedies she has suffered, and the crimes against herself and her family, have also darkened her personality turning her more ruthless, though not quite cruel. This shows when she refuses to take Theon's arm when he comes to escort her to the Godswood to marry Ramsay and coldly asks if he thinks she cares what Ramsay will do to him if she doesn't. She also later expresses approval of what Ramsay did to Theon, now Reek, and declares she would do the same. Once reclaiming Winterfell, Sansa feeds her abusive husband, Ramsay to his own hounds, even smiling as it happened.\n", "However, despite all the suffering that she has been through, Sansa appears to have retained a certain degree of compassion that is also demonstrated in her multiple attempts at reaching out to Theon after Theon admits that he did not kill Bran and Rickon and they are alive. After Theon helps her escape from Winterfell, Sansa once again sees Theon as a surrogate brother and promises she will not let Jon execute him when Theon fears Jon will have him killed for his crimes. Sansa also becomes more compassionate and a loyal sister to Jon and apologizes for being \"awful\" when they were children. When she faces Myranda for the last time prior to her escape from Winterfell, Sansa was about to allow the psychopathic girl to shoot her so that she could die with as much of herself as was remaining. She has also become significantly more brave, courageous and is developing nerves of iron.\n", "Sansa's sufferings have made her stronger and more mature, but also more war-like. Caring less for the traditional feminine virtues she used to praise as a child, Sansa moves against Ramsay in order to take back Winterfell and the North, and outright rejects his conditions for saving her brother Rickon, knowing full well he would never keep his word and instead tells him that he will die the next day. Her experiences with the Lannisters have enabled her to watch in grim satisfaction as Ramsay is torn apart and eaten by his own hounds. This contrasts her visible horror in Season 1 upon seeing the violence when she first arrived in King's Landing, where she is distressed at Gregor Clegane's violence against Ser Hugh and Loras Tyrell and faints when her father is abruptly beheaded in front of her. Sansa is also effective as Lady of Winterfell and Jon's regent, devoting her efforts to maintaining order and preparing the North for winter, for which she earns the respect of many Vale and Northern lords. \n", "Due to the harrowing experiences of the Stark children, Sansa experiences a development in the relationships with her surviving siblings when they are reunited. Though she and Jon were the least close of the Stark children, they love one another as siblings[61] and their relationship as brother and sister becomes stronger when they are reunited. While Sansa will argue with Jon, she speaks to him as an equal, wants to see him safe, and Turner observes Sansa's relationship with Jon has restored Sansa's faith in men.[62]While Jon remains a protective older brother to Sansa and likewise wants her safe, he also recognizes Sansa's intelligence and her adeptness as a leader, placing the North in her charge as his regent. Sansa and Arya did not get along as children and though they love each other, experience a rocky start after their reunion in Season 7 due to their experiences. Nonetheless, they come to recognize new strengths in one another: Arya's skills as a combatant and Sansa's abilities as Lady of Winterfell. By the end of Season 7, their relationship grows stronger and they develop a new closeness as sisters. Sansa is relieved and happy to be reunited with Bran but is unsettled by the changes he has undergone as a result of becoming the Three-Eyed Raven. Regardless, she asks for Bran's help in using his powers to look into Littlefinger's past and upon learning the truth, decide to put Littlefinger on trial to answer for his crimes.\n"], "quotes": [], "figure_captions": []}