{"id": "Shae", "name": "Shae", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Shae", "personality": ["Shae began as a curt, willingly mysterious woman with a cynical attitude and a sharp, often biting tongue. Being a prostitute for most of her life, forced to sell her body (initially by her own mother) since age nine for men whom treat her like a mindless sex object to survive has left her somewhat jaded as she refuses to say anything about herself or past life and wishes to not care about the concerns or wellbeing of others. It was Tyrion who observed that Shae wanted a different life than the one she had then. Beneath this she is a much more loving, loyal and strong-willed woman who will protect those who treat her well. As stated by others she knows how to defend herself and gets by using her skills in self-defence as well as her voluptuousness and sex appeal.\n", "Up until her betrayal, Shae genuinely cared about other people. Despite her relationship with Tyrion beginning as a customer/employer one they grew to love one another, that being said during their run they did endure tribulations which tested both of their wills. Her decisions to stay with Tyrion even when his face was wounded after the Battle of Blackwater and refusing Varys' offer to leave King's Landing in return for diamonds proves she was not the shallow whore she painted herself out to be. Tyrion's love for Shae was so great that even after she incriminates him at his trial for killing King Joffrey he admits to Tywin that he still loved her. She also grows attached to Sansa Stark as she disguises herself as her handmaiden. She goes as far to threaten a handmaiden with a knife if she told the Queen about her flowering and Sansa felt comfortable confiding her disgust over Joffrey with Shae.\n", "Shae, however, is not without her own insecurities. Although throughout his marriage with Sansa, Tyrion assures that he has no romantic feelings for her whatsoever and even refuses to consummate their wedding she allows her jealousy to get the better of her, feeling envious over Sansa's highborn status and great beauty as Shae a common handmaiden and even worse, whore can not hope to have a relationship with a Lord. Moreover when Tyrion could not leave King's Landing with her as he has to fulfil his duty as a Lannister she believes he enjoys his marriage with her and will forget her eventually. Tyrion preys on these insecurities later on by degrading her as a whore and treating their relationship as if it was another encounter and she leaves King's Landing in tears.\n", "When she did return to the city, her jealousy was replaced by bitterness and anger. With her suspicions over Tyrion and Sansa seemingly confirmed she incriminates the two of them further by saying they planned King Joffrey's assassination together and manipulating his words of love to antagonise and humiliate him during his trial. She goes further by having an affair with his father, Tywin who has an equal amount of hatred for his son and outwardly attacks Tyrion when he finds her in his father's bedchambers either out of fear that he was there to kill her or initial anger. She ends up being strangled with the chains that symbolised their love.\n"], "quotes": [], "figure_captions": []}