{"id": "Stannis_Baratheon", "name": "Stannis Baratheon", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Stannis_Baratheon", "personality": ["Stannis was a cold, hard, serious, stubborn, firm and rarely-forgiving man but also brave and in possession of an immense sense of duty. As is expected of Baratheons, Stannis was proven on the battlefield as both a commander and warrior. He had a keen mind for strategy and warfare that led him to be respected by many high-lords and was also fearless in combat, where he could battle and defeat other soldiers, even when injured or unarmored. While he may not be popular, he is certainly respected as a warrior and commander.\n", "Stannis led at the front lines alongside his troops to inspire them on many occasions. His military record prior to the War of the Five Kings was exemplary; he held Storm's End against an overwhelming siege for much of Robert's Rebellion and captured Dragonstone at its conclusion, and he achieved two crucial victories during the Greyjoy Rebellion. His ambush against Mance Rayder's army was also a decisive victory, despite being overwhelmingly outnumbered. Stannis's only two major defeats were at the Battle of Blackwater (where he was attacked on the flank by unexpected Lannister-Tyrell reinforcements) and the Battle of Winterfell (where Stannis's stubborn desire to give battle in spite of the odds doomed him and his army)\n", "With regard to his brothers, Stannis was in better control of his emotions in comparison to the temperamental Robert and youthful Renly, whereas he always appeared calculating and stoic, repressing his emotions and desires for most of his life for the sole objections of the greater good. Even when fully prepared to vent his emotions, he is able to retain his composure and dignity, even when he is about to be assassinated. Stannis has very little patience for false politeness that is expected of a lord in court and generally states his opinions of others or what is on his mind aloud. Because of this, he does not surround himself with sycophants as Cersei does but with advisors whom he trusts to be blunt with the truth, whether he may object to it or not.\n", "Stannis has an unbreakable code of honor and sense of duty and justice which governs his actions. He supported his brother in Robert's Rebellion and fought bravely to put down the Greyjoy Rebellion. When a newly-crowned Robert granted dominion of the much larger and wealthier Stormlands and Storm's End to young Renly and left Stannis with Dragonstone, Stannis accepted his brother's wishes. During the Siege of Storm's End, Stannis held out against the Tyrells despite the hunger, hopelessness and overwhelming numbers they faced. When Davos finally managed to smuggle food into the castle, Stannis made sure his men were fed first before feeding himself.[42] He then rewarded (and punished) Davos fairly, which impressed the smuggler and earned his admiration.\n", "After learning that Robert's children were all bred of incest and had no actual entitlement to the Iron Throne, he recognized his right to be king, but despite his ambitions, Stannis did not appear (or externally appear) megalomaniacal. He admits to Davos Seaworth that although he did not ask to be king, by every rightful law he is and had to accept his duty whether he liked it or not. Stannis, while fundamentally viewed as a good, or at the very least, decent man could easily be swayed due to his religious faith and obsession with fulfilling the prophecy of Azor Ahai which could turn him toward ruthless, regrettable actions, such as burning his daughter alive.\n", "Stannis is also not as popular with the smallfolk as his two brothers are. Robert, although a poor ruler was at least respected as a warrior and Renly was the most well-liked of the Baratheons. Stannis, meanwhile, is lacking both the charisma and handsomeness that is found within his family. Due to his cold and blunt nature, he inspires little loyalty or love from his peers and he does not seem to care about his unpopularity nor does he seek the respect or admiration of the people. Loras Tyrell described him as having the personality of a lobster. He has faith that his men will follow him and die for him anyway because of his birthright. Stannis is also reliant on fear to keep his men in check and considers public displays of kindness a weakness leaders should not possess. On the other hand, Stannis's advisor, Davos Seaworth has complete loyalty, admiration and respect for Stannis and encourages his claim completely despite being drastically punished by him in the past, implying some degree of bravado on his part.\n", "Ever since encountering Lady Melisandre and welcoming her into his inner council, he has accepted her religion in The Lord of Light completely and also her beliefs that he is the Prince That Was Promised, a messiah figure within the faith of R'hllor. Stannis, after converting to The Lord of Light has employed the use of blood magic to secure his claim to the throne such as human sacrifices and burning leeches. Stannis is also quite proud of his faith as he uses the symbol of R'hllor, a burning heart as the banner for his house, modified with the stag head of House Baratheon in the middle.\n", "Stannis has a good side and will show that if he is impressed with someone, and he is not above making personal friends. He was fond of his daughter, Shireen, defending her from his wife, Selyse. Selyse resented their daughter since birth on account of her gender and because of her Greyscale. He also made a friend of Davos Seaworth, one of his most trusted advisors and this was reciprocated fully with Davos pledging his loyalty and life to Stannis. He planned to name Davos Hand of the King after he took the Iron Throne and comforted him over the death of his son despite imprisoning him as a traitor at the time. He was obviously impressed with Jon Snow, the illegitimate son of Eddard Stark, and treated him respectfully, presumably out of regard for Jon's father who made Stannis aware of Joffrey, Tommen and Myrcella's parentage. Before Jon turns down Stannis's offer of legitimization, Stannis was prepared to make him the official Lord of Winterfell as Jon Stark if he agreed to help his cause. Robert and Stannis were in a loveless brotherhood, which they admit to each other. This was also the same with Renly, however they appear on slightly better terms than with Robert. During negotiations he welcomed Renly to a place in his small council and (until he fathered a male heir) was prepared to allow him be heir to his throne if he lay down his forces. He also showed remorse over indirectly killing his little brother and he doesn't attempt to lie to Brienne of Tarth, Renly's Kingsguard, over his involvement. In the end, Stannis doesn't begrudge Brienne's intentions and simply tells her to do her duty, which was to kill him.\n", "Despite his accomplishments and supreme tactics, Stannis was extremely stubborn. He refused to ask Robb Stark or his brother to assist his army, ignoring that Robb and his goals could help each other, claiming he stole the North from his kingdom. Stannis equates this with everything, viewing everyone who does not support his claim as foes and lords of different parts of the Seven Kingdoms without his say-so as usurpers. The prime example of Stannis's rigidity is what caused his demise. The first example of this was choosing to assassinate Renly instead of allying with him to defeat the Lannisters, a mistake that not only laid the seeds of his death, but led to the Tyrells joining forces with the Lannisters and defeating his army at the Battle of Blackwater. Later on, ignoring the loss of half his forces and Melisandre abandoning him, he continues his siege on Winterfell anyway and is quickly destroyed by Ramsay Bolton's forces. With his faith broken, his ambition quashed and his family destroyed, Stannis does not attempt to avoid his fate and calmly accepts his death.\n"], "personality_quotes": [["\"Stannis has the personality of a lobster.\"", "―Loras Tyrell to Renly Baratheon[src]"]], "figure_captions": [], "quote": ["The Iron Throne is mine by right. All those that deny that are my foes.", "―Stannis Baratheon to his brother Renly", "Garden of Bones"], "description": "King Stannis Baratheon was the Lord of Dragonstone, the younger brother of King Robert Baratheon, and older brother of Renly Baratheon.\n"}