{"id": "Theon_Greyjoy", "name": "Theon Greyjoy", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Theon_Greyjoy", "personality": ["Before his capture by Ramsay Snow, Theon is shown to be arrogant, narcissistic and vain, but fundamentally not malicious. For example, when he returned to the Iron Islands, he expected to receive a hero's welcome for being the only living heir of Balon Greyjoy. He was both baffled and offended that he did not receive such a welcome when he landed in Pyke. Also, in order to appear like a strong, accomplished young man, he would gloat over things in an almost ridiculous way - he gloated to Osha that he was the man who captured her, even though Robb Stark fought and captured her.\n", "Beneath his confident exterior, however, Theon is insecure, weak, and unsure of himself. This stems particularly from his conflicted family allegiances. After his father's failed rebellion against Robert Baratheon, he was taken from Pyke when he was nine years old to be raised at Winterfell by the Stark family as their ward/hostage. Even though he grew up alongside the Stark children - Robb Stark and Theon considered each other best friends - Theon never forgot that he was an outsider since he was not of their blood, and would be executed if his father tried to rebel again. This outsider status weighed heavily on Theon, demonstrated when Ros and Tyrion Lannister mention it.\n", "This insecurity eventually leads him to question which is his true family: the Starks or the Greyjoys. When Robb sends Theon to Pyke to convince his father Balon and sister Yara to help the Starks fight against the Lannisters, Balon and Yara are initially successful in using their family bond to sway Theon to their side to instead fight the Starks and not aid them against the Lannisters. Even though Theon agrees to go along with his father's plan, this still causes a great deal of conflict in Theon and he almost warns Robb of Balon's plan before deciding against it. Theon tries to become a ruthless ironborn raider to gain his biological father's approval and find a true home but the conscience that he developed living with the Starks makes it difficult for him to live up to these expectations. When he seizes Winterfell, he promises Bran that no one will be harmed if Bran surrenders - which is something an honorable northerner would promise but no true ironborn would ever do - but minutes later, Theon shatters his promise by beheading Ser Rodrik Cassel when Cassel spits in his face, an unforgivable act among the ironborn.\n", "The seizure of Winterfell shows that Theon has tactical skills, but also that he is a total ignorant in strategy. He fails to consider what Yara explains him very bluntly: that Winterfell is surrounded by hostile forces and too far from the sea, thus the ironborn garrison cannot be reinforced and eventually will be destroyed. Yara urges Theon to leave Winterfell, but he foolishly insists to keep his \"prize\", refusing to understand how poor his position is.\n", "Even throughout Theon's \"rule\" of Winterfell, he is shown to be in a constant battle with himself, implying he knows deep down that invading his childhood home for his father was far from the right thing to do. Maester Luwin even points out to Theon that all of this is just an act to live up to his father's expectations and that Theon himself must know that his betrayal at Winterfell is wrong. Theon resignedly admits to Luwin that he is correct, but that he can't stop because he has already come too far to be forgiven, and refuses to join the Night's Watch, where all of his crimes would be forgiven, out of shame (and partially out of fear that Jon Snow might kill him in retribution for allegedly murdering Bran and Rickon). It is only after Theon becomes a prisoner of the Boltons and realizes that his father has no intention of rescuing him that he admits to himself and to Ramsay Snow that Ned Stark was his \"real father\" and laments Ned's execution in King's Landing.\n", "After being tortured by Ramsay Snow in the dungeons of the Dreadfort for over a year, Theon's original personality has been seemingly obliterated, and he is little more than a broken and half-insane prisoner. Among various tortures, Ramsay cut off several of his fingers and toes, flayed off sections of his skin, and even cut off his genitals. Ramsay even mockingly renamed him \"Reek\", physically and psychologically coercing Theon into denying his identity as \"Theon Greyjoy\" and accepting \"Reek\" as his new name and identity. Ramsay also psychologically tortured him with fake escape attempts or promises of rescue, before recapturing him. As a result, Reek thinks any possibility of escape or fighting back against Ramsay is simply another ruse. He lives in great fear of Ramsay, desperate to avoid angering him and is in such a state of traumatic shock that he is very withdrawn and submissive.\n", "However, despite his previous actions, Reek appears to have retained a strong love and loyalty to the remaining Starks, demonstrated on several occasions: he is visibly shocked when Ramsay gloats about Robb's death, briefly holding a razor to Ramsay's neck and appearing on the verge of slitting his throat (though he doesn't, because Roose and Locke are present); he appears hesitant about telling them that Bran and Rickon may be sheltering at Castle Black with Jon Snow, knowing that it may lead to their deaths, but does so anyway to avoid angering Ramsay; he silently cries and briefly looks angry when Ramsay rapes Sansa, and does his best (or what he thinks is the best) to keep Sansa from angering Ramsay and suffering more at his hands, and even goes as far as to confess to Sansa that he deserved what he suffered under Ramsay and that he deserved to be Reek for what he did to the Stark family. However, when pushed too far, Theon ultimately abandons his Reek persona and chooses his loyalty to the Starks over Ramsay, by killing Myranda and helping Sansa escape from Winterfell, though still believing himself unworthy of anyone's forgiveness for betraying the Starks, who were the only ones who ever treated him like family.\n", "Despite this admission, Theon still expresses shock after learning of his father's death when he returns to the Iron Islands. Though his sister Yara is still angry with him for refusing to be rescued, they reconcile when Theon offers to support Yara's claim to the Salt Throne. While initially despondent, Theon regains some of his confidence during the Kingsmoot to select the next ruler of the Iron Islands. Giving a brief rousing speech, he manages to convince many of the gathered Ironborn to join him in supporting his sister's claim to the Salt Throne, his speaking skills demonstrating that the original Theon Greyjoy is starting to resurface, though he and Yara are outmaneuvered by Euron, who wins many over by offering to seal an alliance with Daenerys Targaryen.\n", "After escaping Euron with his sister Yara, Theon slides back into his despondent state and is troubled by his role in the death of the orphan boys; believing that he should hang for his crimes. Yara counsels him to rediscover himself so that they can secure an alliance with Daenerys and retake the Iron Islands from their uncle Euron. While negotiating with Daenerys, Theon does not display reluctance for the ironborn to cease raping, pillaging and reaving, and nods at Yara to tell her to agree with Daenerys, demonstrating that despite his recovery, he is still greatly traumatized by his torture by Ramsay, and apparently wishes to lead a more peaceful life in order to prevent it from happening again.\n", "By the time of the alliance between Jon Snow and Daenerys Targaryen, Theon has shown himself to have changed with one particular act: he fought Harrag over the next move of the surviving ironborn. This act shows: Theon, who once demanded the respect of the ironborn he had not earned when he first returned to Pyke, approaches the ironborn as an equal and attempts to rally them to rescue Yara; he was willing to admit publicly that he was a coward to flee from Euron, something he never would have done previously; furthermore, Theon will fight to the death over what he believes, instead of fleeing or submitting as he has in the past. Even though Harrag was significantly stronger than him, he continued to fight, and when Harrag loses his advantage Theon seizes his chance and overpowers him, finally earning the respect of his sister's warriors. This shows that the Theon who betrayed House Stark, as well as the Reek who was a prisoner and lapdog of Ramsay Bolton, is dead and gone, and that the new Theon Greyjoy stands in his place, a brave and strong man willing to fight for what he believes in.\n"], "quotes": [["\"I'm a Greyjoy. We've been Lords of the Iron Islands for hundreds of years. There's not a family in Westeros that can look down on us. Not even the Lannisters.\"", "―Theon displaying his family pride to Ros[src]"]], "figure_captions": []}