{"id": "Tommen_Baratheon", "name": "Tommen Baratheon", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Tommen_Baratheon", "personality": ["Throughout his life, it has been fundamentally clear that Tommen Baratheon's most prominent quality is that he is innocent. He has been the victim of his older brother Joffrey's intense cruelty, sadism and overindulgence by their mother, and this has set the two brothers apart quite considerably. Where Joffrey was arrogant, monstrous and a dolt, Tommen was humble, gentle, polite, compassionate, kind and sweet to a fault. Tommen was extremely emotional, crying helplessly when his sister Myrcella was sent to Dorne by Tyrion. He didn't stand up for himself when Joffrey callously mocked Tommen for crying, showing that at this point Tommen was underconfident, especially where Joffrey was concerned because Joffrey had tormented his little brother his entire life. Tommen is so kind that he heartily says he doesn't want Joffrey to kill Robb Stark in battle, despite the fact that officially the Starks and Lannisters were in a pitched war with one another.\n", "One of the most unfortunate elements of Tommen's innocence and kindness is that he is considerably easy to manipulate. This set him apart from Joffrey, who was willful and fearsome in his own way and had to be disciplined into following others. Both Tywin Lannister and the High Sparrow saw this weakness in Tommen, and exploited it. That being said, Tywin had the decency to say that he thought Tommen would be a much better ruler than his psychopathic older brother was. In this exact same conversation, Tommen is shown to be surprisingly intelligent and didn't require much prompting to figure out what made a good king, without taking it as a criticism as Joffrey would have done. Tommen's intelligence didn't necessarily make him perceptive of people manipulating him, though.\n", "Tommen's compassion stretched to shocking degrees, since he apologized and even speculated that he'd hurt Margaery when she cried out during the consummation of their marriage. Even after the mass expansion of rumors (which of course are true) that Tommen and his siblings were products of incest between Cersei and Jaime, Tommen still loved his mother, but he did gain some independent emotions towards other people despite Cersei's best efforts. Tommen loved Margaery extremely deeply and expressed uncharacteristic anger and frustration when confronting the High Sparrow and demanding Margaery's release. Tommen's love for Margaery and the faith was so powerful that, when he saw the Great Sept of Baelor explode in a blaze of wildfire, and knew immediately that Margaery, her family and thousands of innocent people who were inside and outside it had been exterminated at Cersei's doing, feeling he lost everything, he immediately removed his crown and silently, calmly, threw himself from the window to his death.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Wisdom. Wisdom is what makes a good king.", "―Tommen to his grandfather, Tywin Lannister", "Breaker of Chains"], "description": "King Tommen I Baratheon was the younger brother of King Joffrey and Princess Myrcella. Though legally the son of the late King Robert Baratheon and Queen Cersei Lannister, his true father is Ser Jaime Lannister, the Queen's twin brother, and is thus a bastard born of incest. His sole biological grandparents, Tywin and Joanna Lannister, were also first cousins.\n"}