{"id": "Tormund_Giantsbane", "name": "Tormund", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Tormund_Giantsbane", "personality": ["Tormund Giantsbane is an extremely fierce and determined man and a born warrior of the Free Folk in almost every way. Aside from his excellent fighting skills and monstrous strength, Tormund is a supremely intimidating individual who immediately asserts that his enemies should be afraid of him, which he does in his first encounter with Jon Snow, stating that men similar to Jon have met their ends trying to end Tormund's life in combat. Tormund is clearly hugely respected among his people, as evidenced by the immense responsibilities placed upon him by Mance Rayder during their campaign against the Night's Watch - namely to climb the Wall itself and enter the southern kingdoms on the other side. Tormund proved to be capable of great cruelty and brutality during this campaign, and in several others.\n", "To his credit, Tormund is both dangerous and loyal in equal measure - as one of Mance Rayder's most trusted and terrifying lieutenants, eclipsing only Styr in that regard, Tormund followed the King Beyond the Wall's orders without hesitation or complaint and outright devoted himself to the task of fighting the Night's Watch in support of the plan that Mance had. His respect and love for Mance Rayder grew to the extent that he was seen simmering with rage during Mance's execution, despite not saying a single word. He cares tremendously about his own kind, protecting Ygritte during the duel between Jon Snow and Orell, preventing her from interfering or being killed for treachery by their companions. Earlier on, Tormund expressed that he would kill Jon if the latter was deceiving them, in spite of the fact that Tormund admittedly liked him. When Jon betrays them and escapes to Castle Black, Tormund shows skepticism that Ygritte failed to kill Jon, citing his knowledge of her archery skills as support of his suspicions.\n", "Tormund is capable of working well with those who were originally his enemies, albeit rather begrudgingly at first. Even though he stated outright that he hated Thenns, he willingly worked with Styr and his followers in the attack on Castle Black. When Styr was killed, Tormund became the last surviving commander of the wildlings besides Mance Rayder himself, and dueled Alliser Thorne blade-to-blade, gaining the upper hand against but not killing the man. Tormund was different from some wildlings: he was not nearly as sadistic as Styr was, nor as cruel as Rattleshirt, nor as vindictive as Orell; he proved all three of these things by working with Jon Snow for the benefit of his people after the death of Mance Rayder. Tormund's loyalty to Jon Snow shone in his support of the bastard during the Massacre at Hardhome, where Tormund aided Jon in gaining the trust and allegiance of the Free Folk. He outright declared that the crow was courageous for defying Stannis Baratheon and giving Mance Rayder the gift of mercy; he also respectfully assured Jon that Ygritte loved him, and requested that she be cremated in the north, where she belonged. He also joined Eddison Tollett in returning to Castle Black to avenge Jon, before serving as one of the man's fiercest lieutenants during the climactic Battle of the Bastards. He advanced his capacity to adapt by working with the other Westerosi lords after the victory in the North as a representative of his people.\n", "The Giantsbane was a man with a sense of humor to match his ferocity: upon encountering the resurrected Jon Snow, Tormund remarked that his people thought Jon to be a god, but cited his knowledge to the contrary since a god wouldn't have a 'pecker' as small as Jon's. When the wildlings moved to avenge Jon, and Alliser cited that the Night's Watch had repelled the wildlings for centuries, Tormund bluntly replied 'until you'. He also glibly remarked how the wildlings had ironically become the 'Night's Watch' after this victory.\n", "To some extent, Tormund was not at all above violence against other wildlings, even though he cared about the vast majority of them. This is shown outright when Tormund faces Rattleshirt and, when pushed by the belligerent wildling, Tormund savagely beats him to death with his own weapon, then demands that the present wildlings gather the elders without paying any mind to the man he has just bludgeoned.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Plenty of little men tried to put their swords through my heart. And there's plenty of little skeletons buried in the woods.", "―Tormund to Jon Snow", "Valar Dohaeris"], "description": "Tormund, often called Tormund Giantsbane, is a renowned warrior and raider among the Free Folk and one of the key leaders behind Mance Rayder. Tormund respected Mance as the King-Beyond-the-Wall and suspected he was the man to lead them through the Long Night. As time passes and Mance is killed on the orders of Stannis Baratheon, he believes the prophesied warrior is his enemy-turned-friend Jon Snow.\n"}