{"id": "Tyrion_Lannister", "name": "Tyrion Lannister", "fandom": "gameofthrones", "url": "https://starwars.fandom.com/wiki/Tyrion_Lannister", "personality": ["Despite his harsh treatment at the hands of others over the years, Tyrion has managed to develop a thick skin and is able to brush off others' japes about his short stature (except when coming from his father). Tyrion advised Jon Snow how to handle his own bastard status, which reflects Tyrion's own approach to life: take your impediment in stride and wear it like armor, so it cannot be used to hurt you. Being born a dwarf and subject to ridicule for most of his life, Tyrion has admittedly developed a soft spot for his fellow outcasts and has shown them kindness, such as having a saddle designed for the crippled Bran Stark allowing him to ride. Being physically weak, Tyrion is also upset when the helpless are harmed. He was particularly enraged when Janos Slynt carried out an order to kill a defenseless baby girl, Barra (because she was one of Robert's bastards), and as punishment had him exiled to the Wall. Tyrion is also genuinely loyal to those who treat him with love and respect. He also seems to have a level of honor and dignity that the rest of his family seem to lack; events such as the Red Wedding disgusted him, and he considered them to be crimes (though he did admit that there was a certain level of \"cheating\" in war that he is comfortable with, the Red Wedding went beyond that). One of his most interesting and enduring friendships is with the eunuch Varys, the Master of Whisperers. Tyrion and Varys connect on several levels: they are both social lepers because of a physical condition that most people treat with distaste, they are both brilliant intellectuals with a dry sense of humor, they both have a compassionate nature but are capable of being ruthless when necessary, and they are both fond of wine. Although Tyrion and Varys were wary of each other at first (mainly due to the extreme reputations they both maintained), they have developed trust over the course of their various adventures.\n", "Tyrion, however, is not without faults. He tends to overindulge in food, drink, and sex in part to self-medicate for the terrible treatment he's suffered most of his life; when overly stressed, upset or uncomfortable, he will quickly find the nearest container of wine or beer and consume most of it. Tyrion can also act vicious if he feels he's been wronged - such as confining Grand Maester Pycelle to the Black Cells for betraying him or, in his darkest hour, killing Shae for testifying against him during his trial and having an affair with his father, and then going on to kill Tywin himself. Because his father and sister treated him like a social leper, Tyrion craves love and acceptance and is genuinely hurt when this is denied him by others. \n", "He has complex relationships with other members of his family, most of whom resent him and only thinly veil their contempt for his existence. His older sister Cersei blames him for causing the death of their mother and has (as revealed during a conversation with Oberyn) hated Tyrion since his birth. His father, Tywin, shares Cersei's resentment for Tyrion due to the death of his wife while birthing him, as Joanna Lannister was the only person Tywin ever loved. Although Tywin recognizes and respects Tyrion's intellect, it does not lessen his prejudice towards his youngest son; by the same token Tyrion fears and admires his father, but hates him for his inflexibility and unwillingness to show any love for his children. Tywin also just thinks it is an embarrassment that Tyrion was born with a physical disability, seeing it as a judgement from the gods meant to humiliate him by his son's mere existence.\n", "Only Tyrion's older brother Jaime maintained a good relationship with Tyrion, admiring him for both his intellect and inability to let his diminished stature drag him down, and he has frequently attempted to come to Tyrion's defense when his other family members treat him maliciously, making Jaime the only member of his immediate family whom Tyrion loves. Tyrion harbors a mutual admiration for Jaime, even naming him as his champion when he demanded a trial by combat while being held prisoner at the Eyrie. However, this cozy relationship ended when Tyrion killed their father, although they seem to be reconciled since then.\n", "After he killed Shae and his father, Tyrion becomes a broken man: he had lost the will to live. Traumatized by killing the woman he loved and losing his lordship, influence and fabulous wealth, he becomes more cynical and pessimistic and was content to just drink himself to death instead of helping Varys to aid Daenerys Targaryen in getting the Iron Throne. Tyrion becomes convinced in the futility of everything, gaining a negative and rather fatalistic outlook on the past and the future, to the point of suicidal, as well gains a lower view for matters he dealt with high esteem and importance beforehand in the past, such as the Great Houses or the bid for the Iron Throne. Even when meeting Daenerys face to face, Tyrion explained that he was still content to die. However, whilst helping with the chaos in Meereen, and keeping Daenerys from becoming like her father in her ruthlessness, he regains his will to live. He also finally finds something to believe in, as he believes in Daenerys. His sense of humor is more muted and cynical than before, however; this may be the result of his no longer being able to rely on his family title for protection and influence, and having to earn his merits with Daenerys on his brains alone.  \n", "Although Tyrion's skills with political maneuvering, administration, and diplomacy are extremely impressive, his record as a military strategist and tactician are more mixed. In this respect he is similar to his father, although unlike Tywin, Tyrion's lack of skill on the battlefield has more to do with his unwillingness to inflict heavy loss of life on either side. He achieved a successful ambush at the Battle of the Blackwater with his wildfire trap and led his troops personally on a sortie, but this alone was still not enough to win the battle without help from Tywin and the Tyrells; indeed, the massive casualties resulting from the wildfire shook him and (presumably) made him reluctant to use such a devastating weapon again. This, in turn, made him somewhat overly cautious in his strategy to help Daenerys win against Cersei. As a result, most of his battle plans, with the exception of capturing Casterly Rock, failed, leading Daenerys to lose her patience with his strategy and take matters into her own hands. Nonetheless, Tyrion played a valuable role in developing and solidifying the alliance between Daenerys and Jon Snow, the King in the North.  \n"], "quotes": [["\"Tyrion Lannister is one of the few people alive who can make this country a better place. He has the mind for it, he has the will and he has the right last name.\"", "―Varys's high opinion of Tyrion.[src]"]], "figure_captions": []}