{"id": "Tywin_Lannister", "name": "Tywin Lannister", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Tywin_Lannister", "personality": ["Tywin is known for his stoic, tough as nails, pragmatic, cunning and calculating demeanor, but also his ruthless, cold, manipulative, power-hungry, and often unfettered attitude, even for his family. The only person he held any sentiment towards was his late wife Joanna (whom he loved dearly), having died giving birth to their son Tyrion. Since then he expressed disdain towards Tyrion for the death of his wife, as well as for shaming Tywin and their family by being born a misshapen dwarf.\n", "Tywin insists that all he does is for the sake of his family. Tywin's own father Tytos was a nice, generous and caring man, whose bad investments and indecision made House Lannister a laughingstock. As a result, despite admitting to Arya Stark that Tytos was \"a good man\", Tywin viewed his father's kindness as a source of weakness that nearly destroyed the reputation of House Lannister. Tywin successfully rebuilt his family's fortunes almost singlehandedly, and this along with his total destruction of the rebellious House Reyne caused him to embrace ruthlessness as a principle of keeping one's family in power. This ruthlessness, combined with his shrewd, efficient, cunning, incredibly intelligent, bloodthirsty and power-hungry nature, caused the Mad King to appoint Tywin as his Hand, though Tywin later resigned due to insults by Aerys against his family. Tywin was one of the best-suited Hands in recent history, to his credit; many saw him, not Aerys, as the man who ruled the realm.\n", "Ironically, Tywin's harsh actions and unwillingness to serve as a caring father figure have resulted in severe emotional problems in all three of his children, who are all terrified of him. Jaime and Cersei have been having an incestuous sexual relationship since they were very young, partially due to the lack of any loving parental relationship either of them had. Tywin actually spent most of their lives away in King's Landing serving as Hand of the King, and with their mother dead, his children were functionally raised by servants. Tywin only sporadically visited his home at Casterly Rock, and on the occasions when he did return he would deal out severe punishment for any transgressions his children committed while he was away.\n", "What little relationship Tywin may have had with Tyrion was destroyed when Tywin had his marriage to the commoner Tysha annulled, then forced Tyrion to watch as he had his guards gang-rape the girl. Tywin wanted to force all of his children into marriage-alliances to benefit House Lannister (as Cersei was later married off to King Robert), and he was offended that Tyrion risked such a future marriage alliance for himself by marrying a commoner for love. The hypocrisy in this is that Tywin himself married for love when he married his own first cousin Joanna, instead of entering into a marriage-alliance with another more powerful noble family. Over the years, Tywin seemed to develop an outright joy in inflicting petty humiliations on Tyrion, such as \"rewarding\" him on his sixteenth nameday by putting him in charge of the privies and sewers at Casterly Rock. Yet despite all this, Tywin is fully aware that Tyrion is the most intelligent, efficient, intellectual, sophisticated and politically cunning of all of his children. Though this has driven him to despise Tyrion more, given that Tyrion is his least favorite son as well as his most valuable, Tywin has occasionally recognized Tyrion's incredible intelligence by naming him acting Hand of the King and later Master of Coin, and betrothing him to Sansa Stark, all for the benefit of the family. When Tyrion is accused of murdering Joffrey, Tywin's reaction appears to show that he is not entirely convinced of Tyrion's guilt, knowing that Tyrion is much too smart to commit regicide in such an obvious manner, but rather than attempt to prove his son's innocence, he uses the opportunity to rid himself of Tyrion once and for all, either by execution or sending him to the Night's Watch. Though he seems to prefer the latter so as to avoid being branded a kinslayer, it is later implied that this was also part of a plan to push Jaime into renouncing his Kingsguard vows and taking his place as Tywin's heir in return for Tyrion's life.\n", "Meanwhile, Tywin possesses a very conservative, patrician set of social values, in which women are suited to securing marriage-alliances and little else, not wielding power on their own. Thus in contrast to House Tyrell, in which female members of the family are trained in ruling and court intrigue as much as the men are, Tywin never trained Cersei how to rule. Without instruction from her father, because Tywin always disregarded her as simply a means to an end, Cersei turned into a queen who actually isn't very skilled at the art of ruling but who based her reign on her personal vendettas with Tyrion and Margaery. However, on one occasion Tywin outright stated to her that he distrusted her not because of her gender, but because she was not as smart as she thought herself to be. This assessment appears quite accurate, as Cersei's attempts to increase her power following Tywin's death simply left her more and more isolated and despised by the people of Westeros.\n", "Of his three children Tywin has the least shame and most empathy for Jaime, though not outright respect. Tywin feels disappointed that Jaime wants to continue to be a member of the Kingsguard, as while it is the highest honor a knight can aspire to, it means that Jaime had to swear away his rights to marriage or inheritance, which would leave Tywin's hated son Tyrion as his heir. When Jaime was captured by the Starks, Tywin did absolutely nothing to bring him back. Tywin also attempted to do anything to convince Jaime to be his heir, even going on to promise sparing Tyrion's life, which was though ultimately foiled.\n", "Tywin does have a generally good relationship with his younger brother Kevan, whom he shaped his whole life to serve as his faithful lieutenant. On the whole, however, for a man who claims to value family above all else, Tywin has hypocritically destroyed his relationships with his own children.\n", "Tywin is also shown to have no regard for his grandson Joffrey, knowing fully well that he is incompetent at ruling the realm. He was shown as having no qualms with putting Joffrey in his place when necessary, normally being cold and blunt with the boy and exerting authority over him when need be. On one occasion when Joffrey defied Tywin about having to walk a long distance to council meetings, Tywin coldly suggested having Joffrey carried there; the second time, when Joffrey heatedly insulted Tywin as a coward, Tywin sent Joffrey to his chambers, even suggesting Essence of Nightshade to help him sleep. Beforehand, Tywin exercised his belief that \"any man who must say I am the king is no true king\", and that the crown and title of king didn't truly give a man absolute power. At Joffrey's funeral, Tywin was very cold and careless toward his grandson's body, and he openly tells his grandson Tommen that Joffrey was not a good king nor a wise king much to the chagrin of Cersei.\n", "Tywin lacks, or at least overtly lacks, the sadistic and bloodthirsty nature of his grandson Joffrey. Tywin is intelligent enough to weigh political reality against a desire for personal, petty revenge. When Tywin arrived at Lannister-occupied Harrenhal, he put a stop to the pointless torture of captured smallfolk, simply because it would be a more efficient use of resources to put them to work. In contrast, during the Sack of King's Landing he allowed his army to murder, pillage and rape throughout the city, devastating its inhabitants. Underneath his calm exterior, Tywin can be seen to take personal satisfaction in crushing anyone who openly humiliates him (Tyrion, House Reyne of Castamere, Robb Stark, Aerys Targaryen etc.) though he only seeks this kind of vengeance when it is practical for House Lannister. Tywin treated his plans for the Red Wedding as a necessity of ending the war against the North, and he had the Stark family sword, Ice, melted down because it was made out of irreplaceable Valyrian steel which could be used to make other weapons. Privately, however, he bore a look of satisfaction as he personally threw Ice's wolf-pelt scabbard into a fire, symbolizing his destruction of House Stark in the same way he had destroyed the Reynes when they humiliated his family.\n", "Despite his ruthless and calculating nature, Tywin is shown to have a good side if he is impressed with someone, demonstrated when he treats his young servant and cupbearer (unaware that she is Arya Stark) with respect and kindness when she displays knowledge and the ability to read, speaks openly with her and even allows her to eat his dinner when he is not hungry and treat herself to whatever she likes in the kitchen (though considering an earlier \"assassination\" attempt on him, Tywin was probably also being cautious about poisoned food). He also demonstrates this constructive and caring side with his grandson Tommen, whom he knows will become a much better and wiser king than Joffrey, and shares his knowledge and wisdom concerning the duties and obligations of a king.\n", "Although Tywin's skill at politics and administration cannot be denied, his military record is mixed. During Robert's Rebellion, Tywin participated in none of the battles except his infamous sacking of King's Landing, when it was already clear that Robert Baratheon would win the war. During the Greyjoy Rebellion, Tywin lost his entire fleet to a surprise attack by Euron Greyjoy, and in the War of the Five Kings he badly underestimated Robb Stark and was repeatedly outmaneuvered on the battlefield (though on at least one occasion this was due to an incompetent subordinate). However, Tywin later turned the tables by winning a spectacular victory at the Battle of Blackwater (thanks in part to his new alliance with House Tyrell), and although his actions at the Red Wedding, the destruction of House Reyne, and the Sack of King's Landing were extremely brutal and heinous, they produced decisive military results. While Tywin might not be much of a field commander, he is certainly a good strategist: he always has the endgame in mind, and always knows how to best inspire fear in his enemies.\n", "While not trusting even his own small council—telling Tyrion to execute Varys, Pycelle, or Baelish on \"even a whiff of treason\"—Tywin is also much more diplomatic than Cersei or Joffrey. While he doesn't trust any of the Great Houses apart from his own, Tywin recognizes it as necessary to make some concessions to House Tyrell and House Martell in order to keep their valuable support. Following his death, however, Cersei spurns the Martells and re-ignites her previous rivalry with Margaery Tyrell, eventually destroying both alliances and undoing Tywin's careful work in securing House Lannister.\n", "Tywin is a very efficient ruler, but has five flaws: first, he always seeks to promote the interests of his house, even at the expense of the realm (for instance, he wouldn't forgive the crown's debt to House Lannister); second, his methods are overly cruel: he employs extremely brutal warriors like the Mountain and Lorch, gives them a free hand in committing atrocities while fulfilling his orders, and has no qualms about killing small children, infants or even whole houses; third, despite that he believes that family is the most important thing to him, he mistreats his children and sees his legacy as more important to him than family, that his house needs as many heirs to build up House Lannister; fourth, even though Tywin was powerful and respected, his power was only built on fear, which made his house vulnerable after his death; fifth, Tywin's power, arrogance and stubbornness made himself to believe that he was more superior than anyone or anything, even the gods, old and new. Committing acts, like the Red Wedding, believing that no consequences would follow with his actions, even disregarding the words \"The northerners will never forget.\", never realizing that his hold on the North would be lost and his house would be brought into a dangerous situation by his power-mad daugther.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["Before long I'll be dead, and you and your brother and your sister and all of her children, all of us dead, all of us rotting in the ground. It's the family name that lives on. It's all that lives on. Not your personal glory, not your honor... but family.", "―Tywin Lannister to his eldest son, Jaime", "You Win or You Die"], "description": "Lord Tywin Lannister was the head of House Lannister, Lord of Casterly Rock, Warden of the West, Lord Paramount of the Westerlands, Hand of the King for three different kings, and Protector of the Realm. He was the father of Cersei, Jaime, and Tyrion Lannister, and sole grandfather of the incest-born Joffrey, Myrcella, and Tommen Baratheon.\n"}