{"id": "Viserys_Targaryen", "name": "Viserys Targaryen", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Viserys_Targaryen", "personality": ["Viserys was cruel, condescending, arrogant, and immoral. Much like Joffrey Baratheon, Viserys believed that people should obey him simply because of his birthright and would throw temper tantrums when he was not treated with the respect he thought he was owed, even though he did nothing to earn it. Viserys described his temper as \"a dragon\", but also referred to himself as such, thinking himself as one of the greatest Targaryens to have ever lived. Viserys's temper hopelessly outweighs his common sense, making him rash, temperamental, impetuous and reckless.\n", "Viserys was also extremely self-deluded and believed himself to be a mighty warrior, like his brother Rhaegar Targaryen, even though he had never wielded a sword against an opponent in his life and didn't truly know the first thing about combat, strategy or warfare. When he was attacked by Dothraki, he did not fight back himself but instead tried to get others - such as Jorah Mormont - to do it for him, regardless that he had, not so long ago, belittled the man and insulted his concept of loyalty. Viserys never expected any true consequences to come from his more rash actions, reacting in shock and awe when Daenerys fought back against him.\n", "Viserys was similarly as arrogant as his own father and neither could believe their allies would turn on them. For Aerys, he opened the gates of King's Landing to his old friend Tywin Lannister and his army, despite his remaining loyalists telling him it was a trap. This act of utter folly led to the Sack of King's Landing and his own death. For Viserys, he arrogantly believed that the Dothraki would never strike back at him for threatening their Khaleesi, and that he had the right to bare steel against them. His self-conception of being 'the dragon' blinded him to the fact that no man could shed blood or bare steel within Vaes Dothrak. Similarly, this belief cost Viserys his life.\n", "In regards to his sister Daenerys, Viserys looked at her as his property to abuse or hand out to others whenever he pleased. On the day he was to marry his sister over to Khal Drogo, he even fantasized that men will write that his reign began on that day, even though it was more an ascension of her status than his - he never inquired, nor cared, as to whether or not she wanted to be married to a Dothraki savage. As he said to her about her marriage to Khal Drogo, \"We go home with an army. With Khal Drogo's army. I would let his whole tribe fuck you, all forty thousand men and their horses too, if that's what it took.\" Despite this, Viserys believes that she is still loyal to him and nobody else. As Khal Drogo was preparing to \"crown\" him, he begs for her to intervene, despite giving her absolutely no reason to do so. In fact, only moments before, he had threatened to cut her open with a sword during her pregnancy.\n", "Daenerys believes Viserys could be good, due to him being kind and respectful to her once, but that the loss of their mother, father and brother early in his life, and having to beg everyone for money and shelter made Viserys cruel and bitter. She clearly once had some affection for him as her only living blood relative, since, in tribute, she named her dragon Viserion after him.\n", "Viserys was an individual with a terrible sense of morality, as evidenced by how he callously implied that, under his rule, Jorah Mormont would not face consequences for the crimes of selling slaves. A good king would have been appalled at the crime, as Jorah himself regretted it, but this reinforces the idea that Viserys did not see other men, especially common men, as people. He also did not see any problem with insulting or questioning other people's honor, integrity or duty, chastising Jorah Mormont for wanting Daenerys for himself, stating that he could 'dine on her' however he wanted, so long as he let Viserys go. Viserys desired loyalty, power and fealty, but he deserved neither.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["I want us both to go home, but they took it from us. So tell me, sweet sister, how do we go home? ...We go home with an army.", "―Viserys to his sister, Daenerys", "Winter is Coming"], "description": "King Viserys Targaryen was the younger brother of the late Rhaegar Targaryen and the older brother of Daenerys Targaryen. Viserys and Daenerys are the remnants of the exiled House Targaryen following Robert's Rebellion against their father Aerys II Targaryen, the Mad King. He claimed the Iron Throne as King Viserys III after his father was overthrown and killed in Robert's Rebellion but never sat on the Iron Throne before being killed by Khal Drogo.\n"}