{"id": "Yara_Greyjoy", "name": "Yara Greyjoy", "fandom": "gameofthrones", "url": "https://gameofthrones.fandom.com/wiki/Yara_Greyjoy", "personality": ["Yara Greyjoy is an Ironborn woman of the finest caliber: courageous, clever, determined and proud. In sharp contrast to the allusions people have about her on the basis that she is a woman, Yara is extremely headstrong and formidable towards anybody who dares cross her, as well as possessing a sharp, cynical, and sarcastic sense of humor. She rebuffs Theon's labeling her as a woman by pointing out that he is the one wearing a skirt, knowing full well that he has already been berated for it and it will only enrage him. She is a fierce warrior and a staunch leader, and obdurate about her own independence. She does not apologize to her father for leading a personal mission to rescue Theon from the Boltons, despite having failed and lost many men. Later on, when Theon returns, Yara is furious with him for costing her so many lives in his decision to stay in the Dreadfort, showing that she was remorseful of her defeat during the rescue mission.\n", "Because of her sharpness, Yara can come across as aggressive towards people she doesn't like or people who try to put her in her place, and isn't swayed when Theon warns her against crossing him. She can be slightly judgmental and labels Theon as an idiot for forgetting that, while he had conquered Winterfell, the Ironborn were primarily sailors and islanders and couldn't hold landlocked castles like Winterfell for very long. Nevertheless, she clearly loves Theon enough to want to rescue him from Ramsay Bolton, and previously she begged him not to die 'so far from the sea', gently recalling the two of them as children. By the time Theon returns to the Iron Islands after Eddard Stark's death, Yara is a renowned leader and, in Balon's words, has commanded and killed men with her own hands. She eventually gained great support during the Kingsmoot with the reminder that she was a reaver, a warrior and a seasoned leader, but this was ruined when Euron arrived and promised the present ironborn greater glory.\n", "Despite their troubled past, different personalities and Theon's actions, Yara still values Theon's advice, possibly from his experiences in the North and Riverlands, shown when she only agrees to Daenerys Targaryen's conditions when Theon nods his approval, and continues to be protective of him, telling Ellaria Sand to leave him alone when she asks him to pour ale for her and then invites him for a threesome with Yara (though it can be argued that Ellaria did not know that Theon had been castrated by Ramsay). Yara was also apologetic of mocking Theon at the brothel in Volantis, compensating for her coldness by encouraging him to continue living and fighting, because she needed him beside her in order to defeat Euron and avenge their father; in this particular conversation, she showed her more compassionate side and shed the scornful way in which she spoke to Theon when he first returned to the Iron Islands.\n"], "personality_quotes": [], "figure_captions": [], "quote": ["And she is your rightful ruler. Those of you that have sailed under her, and there are many of you here, you know what she is! She is a reaver! She is a warrior! She is Ironborn! We will find no better leader! This is our queen!", "―Theon Greyjoy declaring Yara as the rightful Queen of the Iron Islands.", "The Door"], "description": "Queen Yara Greyjoy is the daughter of Balon Greyjoy and older sister and only surviving sibling of Theon Greyjoy. She was raised at Pyke, the stronghold of House Greyjoy. Yara is a fierce warrior and commands her own longship, the Black Wind.\n"}